[
    {
        "question": "The first computer language developed was ",
        "option1": " COBOL ",
        "option2": " BASIC ",
        "option3": " FORTRAN ",
        "option4": " PASCAL",
        "answar": "3",
        "category": "computer",
        "explain": " (3) The first programming languages predate the modern computer. At first, the languages were codes. The first modern programming language was FORTRAN (1955), the “FORMULA TRANSLATOR”, invented by John Backus, then COBOL,(1959) the Common Business Oriented Language, was used. Then PASCAL and BASIC came into existence. "
    },
    {
        "question": "Who among the following developed World Wide Web (WWW), which gave a new type of information exhibition ? ",
        "option1": " Bob Cohen ",
        "option2": " Tim Berners-Lee ",
        "option3": " Robert Morris Jr. ",
        "option4": " Michel Derstuses",
        "answar": "2",
        "category": "computer",
        "explain": " (2) The World Wide Web (abbreviated as WWW or W3, commonly known as the Web), is a system of interlinked hypertext documents accessed via the Internet. Using concepts from his earlier hypertext systems like ENQUIRE, British engineer, computer scientist and at that time employee of CERN, Sir Tim Berners-Lee, now Director of the World Wide Web Consortium (W3C), wrote a proposal in March 1989 for what would eventually become the World Wide Web. "
    },
    {
        "question": "Which among the following is a distinctive feature by which a CD ROM drive is classified in a personal computer ? ",
        "option1": " Software bundle ",
        "option2": " Data transfer rate ",
        "option3": " Memory capacity ",
        "option4": " Storage period",
        "answar": "2",
        "category": "computer",
        "explain": " (2) a CD-ROM drive, a device that can read information from a CD-ROM. CD-ROM players can be either internal, or external. There are a number of features that distinguish CD-ROM players, the most important of which is probably their speed or data transfer rate. CD-ROM players are generally classified as single-speed or some multiple of single-speed. "
    },
    {
        "question": "What is ‘Teletext’ ? ",
        "option1": " Flashing of telephone conversation on TV screen. ",
        "option2": " Printing the text of the message on the telex machine. ",
        "option3": " Connecting the local telephone with outstation telephones without STD codes. ",
        "option4": " Flashing of the text of news and information on the TV screen.",
        "answar": "4",
        "category": "computer",
        "explain": " (4) Teletext is a Data broadcasting service in which pre-programmed sequences of frames of data are broadcast cyclically, and a user, equipped with a standard television receiver and a special decoder, selects the desired frames for viewing. "
    },
    {
        "question": "Processing of a data file to reduce its size for storage on disk is termed : ",
        "option1": " Amplification ",
        "option2": " Reduction ",
        "option3": " Compression ",
        "option4": " Rarefaction",
        "answar": "3",
        "category": "computer",
        "explain": " (3) The process of reducing the size of a data file is popularly referred to as data compression, although its formal name is source coding. Compression is useful because it helps reduce resources usage, such as data storage space or transmission capacity. Because compressed data must be decompressed to use, this extra processing imposes computational or other costs through decompression. "
    },
    {
        "question": "Which of the following mobile telephone network is not based on GSM technology ? ",
        "option1": " Idea ",
        "option2": " BPL Mobile ",
        "option3": " Airtel ",
        "option4": " Reliance Infocomm",
        "answar": "4",
        "category": "computer",
        "explain": " (4 ) GSM stands for Global System for Mobile Communications. Just like computers, mobile phones have evolved over time. There were first generation mobile phones in the 70’s, there are 2nd generation mobile phones in the 80’s and 90’s, and now there are 3rd gen phones which are about to enter the Indian market. GSM is called a 2nd generation, or 2G communications technology. Idea, Airtel, and BPL Mobile are based on GSM technology while Reliance Infocommis not based on GSM technology. COMPUTER & IT SGAE–1037 "
    },
    {
        "question": "A compact disc (CD) is a data storage system of the type ",
        "option1": " magnetic ",
        "option2": " optical ",
        "option3": " electrical ",
        "option4": " electro-mechanical",
        "answar": "2",
        "category": "computer",
        "explain": " (2) The Compact Disc, or CD for short, is an optical disc used to store digital data. It was originally developed to store and play back sound recordings only, but the format was later adapted for storage of data (CD-ROM).Standard CDs have a diameter of 120 millimetres (4.7 in) and can hold up to 80 minutes of uncompressed audio or 700 MB (700 × 106  bytes) of data. "
    },
    {
        "question": "Who developed the concept ‘World Wide Web’ ? ",
        "option1": " Tim Berners-Lee ",
        "option2": " Microsoft ",
        "option3": " Arthur Clarke ",
        "option4": " AT & T Bell Lab",
        "answar": "2",
        "category": "computer",
        "explain": " (2) The World Wide Web (abbreviated as WWW or W3, commonly known as the Web), is a system of interlinked hypertext documents accessed via the Internet. Using concepts from his earlier hypertext systems like ENQUIRE, British engineer, computer scientist and at that time employee of CERN, Sir Tim Berners-Lee, now Director of the World Wide Web Consortium (W3C), wrote a proposal in March 1989 for what would eventually become the World Wide Web. "
    },
    {
        "question": "‘IC’ in computers stands for ",
        "option1": " Integrated Charge ",
        "option2": " Integrated Current ",
        "option3": " Integrated Circuits ",
        "option4": " Internal Circuits",
        "answar": "3",
        "category": "computer",
        "explain": " (3) IC, or An integrated circuit is a small wafer, usually made of silicon, that can hold anywhere from hundreds to millions of transistors, resistors, and capacitors. These extremely small electronics can perform calculations and store data using either digital or analog technology."
    },
    {
        "question": "WLL stands for ",
        "option1": " Walking Land Line ",
        "option2": " Walking Loop Line ",
        "option3": " Wireless Land Line ",
        "option4": " Wireless in Local Loop",
        "answar": "4",
        "category": "computer",
        "explain": " (4) WLL stands for Wireless in local loop, is a term for the use of a wireless communications link as the “last mile / first mile” connection for delivering plain old telephone service (POTS) and/or broadband Internet to telecommunications customers. "
    },
    {
        "question": "A computer virus is ",
        "option1": " a chemical that attacks silicon. ",
        "option2": " a micro-organism that destroys integrated circuits. ",
        "option3": " data that the computer fails to handle. ",
        "option4": " a special kind of computer programme.",
        "answar": "4",
        "category": "computer",
        "explain": " (4) A computer virus is a computer programme that can replicate itself and spread from one computer to another. The term “virus” is also commonly, but erroneously, used to refer to other types of malware, including but not limited to adware and spyware programs that do not have a reproductive ability. Malware includes computer viruses, computer worms, Trojan horses, most rootkits, spyware, dishonest adware and other malicious or unwanted software, including true viruses. "
    },
    {
        "question": "Which one of the following companies announced sometime back the launch of India’s first personal computer with one terabyte hard drive capacity? ",
        "option1": " Infosys Technologies ",
        "option2": " Wipro ",
        "option3": " HCL Infosystems ",
        "option4": " IBM",
        "answar": "3",
        "category": "computer",
        "explain": " (3) On 15th July, 2007, HCL InfoSystem Ltd. India’s premier information and the country’s largest PC manufacturer announced the launch of India’s first personal computer with one terabyte hard drive capacity in the market. "
    },
    {
        "question": "Nano technology deals with objects with dimensions in the range of ",
        "option1": " 10–3 m ",
        "option2": " 10–6 m ",
        "option3": " 10–9 m ",
        "option4": " 10–12 m",
        "answar": "3",
        "category": "computer",
        "explain": " (3) Nanotechnology (sometimes shortened to “nanotech”) is the manipulation of matter on an atomic and molecular scale. Generally, nanotechnology works with materials, devices, and other structures with at least one dimension sized from 1 to 100 nanometres which is equal to 10–9 m. "
    },
    {
        "question": "An Intelligent terminal ",
        "option1": " has a microprocessor, but cannot be programmed by the user ",
        "option2": " can process small data processing jobs, with the use of a large CPU ",
        "option3": " interacts with the user in English ",
        "option4": " cannot take data from the user",
        "answar": "2",
        "category": "computer",
        "explain": " (2) An Intelligent terminal is A terminal with built-in processing capability, but no local disk or tape storage. It may use a general-purpose CPU or may have specialized circuitry as part of a distributed intelligence system. Intelligent terminals include memory and a processor to perform special display operations. "
    },
    {
        "question": "Processor’s speed of a computer is measured in ",
        "option1": " BPS ",
        "option2": " MIPS ",
        "option3": " Baud ",
        "option4": " Hertz",
        "answar": "2",
        "category": "computer",
        "explain": " (2) million instructions per second (MIPS) is a measure of a computer’s processor speed. Many reported IPS values have represented “peak” execution rates on artificial instruction sequences with few branches, whereas realistic workloads typically lead to significantly lower IPS values. "
    },
    {
        "question": "‘C’ language is a ",
        "option1": " Low level language ",
        "option2": " High level language ",
        "option3": " Machine level language ",
        "option4": " Assembly level language",
        "answar": "2",
        "category": "computer",
        "explain": " (2) C is a high level language. In computing is a general-purpose programming language initially developed by Dennis Ritchie between 1969 and 1973 at Bell Labs. C is one of the most widely used programming languages of all time, Many later languages have borrowed directly or indirectly from C, including C#, D, Go, Java, JavaScript, Limbo, LPC, Perl, PHP, Python, and Unix’s C shell. "
    },
    {
        "question": "Window 7, the latest operating system from Microsoft Corporation has ....... Indian languages fonts. ",
        "option1": " 14 ",
        "option2": " 26 ",
        "option3": " 37 ",
        "option4": " 49",
        "answar": "4",
        "category": "computer",
        "explain": " (4) Windows 7 is the first version of Windows to ship with more fonts for non-Latin scripts than for Latinbased scripts. One major area of improvement is for the languages of India. earlier windows have nine (9) fonts for Indian languages that shipped in Vista, Windows 7 adds forty (40) more. Windows 7 will now include multiple fonts (often in multiple weights) for each of the official languages of India. "
    },
    {
        "question": "In a 14\" TV or computer monitor, the dimension of 14\" stands for ",
        "option1": " the length of the screen ",
        "option2": " the breadth of the screen ",
        "option3": " the diagonal of the screen ",
        "option4": " the maximum length of the screen",
        "answar": "3",
        "category": "computer",
        "explain": " (3) The size of a display is usually by monitor manufacturers given by the diagonal, i.e. the distance between two opposite screen corners. This method of measurement is inherited from the method used for the first generation of CRT television, when picture tubes with circular faces were in common use. Being circular, only their diameter was needed to describe their size. Since these circular tubes were used to display rectangular images, the diagonal measurement of the rectangle was equivalent to the diameter of the tube’s face. "
    },
    {
        "question": "Who is called the Father of Computer ? ",
        "option1": " Charles Babbage ",
        "option2": " Stephen Hawking ",
        "option3": " W.G. Grace ",
        "option4": " John Lennon",
        "answar": "1",
        "category": "computer",
        "explain": " (1) Charles Babbage, was an English mathematician, philosopher, inventor and mechanical engineer who originated the concept of a programmable computer. Considered as “father of the computer”, Babbage is credited with inventing the first mechanical computer that eventually led to more complex designs. "
    },
    {
        "question": "What is clickjacking ? ",
        "option1": " Malicious technique of tricking Web usear into revealing confidential information ",
        "option2": " A device that sends and receives data in a bit second ",
        "option3": " A form of Computer Engineering ",
        "option4": " A digital process that is used to display an image on monitor",
        "answar": "1",
        "category": "computer",
        "explain": " (1) Clickjacking is a malicious technique of tricking a Web user into clicking on something different to what the user perceives they are clicking on, thus potentially revealing confidential information or taking control of their computer while clicking on seemingly innocuous web pages. It is a browser security issue that is vulnerability across a variety of browsers and platforms. A clickjack takes the form of embedded code or a script that can execute without the user’s knowledge, such as clicking on a button that appears to perform another function. The term “clickjacking” was coined by Jeremiah Grossman and Robert Hansen in 2008. "
    },
    {
        "question": "As announced by the Finance Minister in his Budget speech on 28th February, 2011, with a view to assist States in modernising their stamp and registration administration, E-stamping is expected to be rolled out in all the districts of different States in a period of ",
        "option1": " one year ",
        "option2": " two years ",
        "option3": " three years",
        "option4": " five years",
        "answar": "3",
        "category": "computer",
        "explain": " (3) Finance Minister in his Budget speech on 28th February, 2011 said that “Five years ago, we took an initiative to introduce a modern and people-friendly e-stamping facility in the country. Only six States have introduced this system so far. I propose to launch a new scheme with an outlay of Rs 300 crore to provide assistance to States to modernise their stamp and registration administration and roll out estamping in all the districts in the next three years.” "
    },
    {
        "question": "Where was India’s first computer installed ? ",
        "option1": " Indian Institute of Technology, Delhi ",
        "option2": " Indian Institute of Science, Bangalore ",
        "option3": " Indian Iron’& Steel Co. Ltd., Burnpur ",
        "option4": " Indian Statistical Institute, Calcutta",
        "answar": "4",
        "category": "computer",
        "explain": " (4) First Computer came in India in 1956, in Calcutta now Kolkata In Indian statistical institute Kolkata under doctors Dutta, Majumdar and Roy .It was not only the first computer of India but also Asia’s first computer outside Japan. "
    },
    {
        "question": "What is the commonly used unit for measuring the speed of data transmission ? ",
        "option1": " Mega Hertz ",
        "option2": " Characters per second ",
        "option3": " Bits per second ",
        "option4": " Nano seconds",
        "answar": "3",
        "category": "computer",
        "explain": " (3) the commonly used unit for measuring the speed of data transmission is bits per second, abbreviated bps. The baud rate is actually the measure of transi- COMPUTER & IT SGAE–1038 tions per second. A 56 kbps modem actually only changes its output amplitude, phase, and frequency 1200 times a second, but uses amplitude and phase to encode multiple bits into a single state. "
    },
    {
        "question": "In which of the following areas, a spreadsheet software is more useful ? ",
        "option1": " Psychology",
        "option2": " Publishing ",
        "option3": " Statistics ",
        "option4": " Message sending",
        "answar": "3",
        "category": "computer",
        "explain": " (3) A spreadsheet is an interactive computer application program for organization and analysis of information in tabular form. Spreadsheets developed as computerized simulations of paper accounting worksheets. The program operates on data represented as cells of an array, organized in rows and columns. Each cell of the array is a model–view–controller element that can contain either numeric or text data, or the results of formulas that automatically calculate and display a value based on the contents of other cells. It is more useful in Statistics. "
    },
    {
        "question": "A Group Ware is a ",
        "option1": " Hardware ",
        "option2": " Network ",
        "option3": " Software ",
        "option4": " Firmware",
        "answar": "3",
        "category": "computer",
        "explain": " (3) Collaborative software or groupware is computer software designed to help people involved in a common task achieve goals. The design intent of collaborative software is to transform the way documents and rich media are shared to enable more effective team collaboration. Collaboration requires individuals working together in a coordinated fashion, towards a common goal. Accomplishing the goal is the primary purpose for bringing the team together. "
    },
    {
        "question": "A communication network which is used by large organizations over regional, national or global area is called ",
        "option1": " LAN ",
        "option2": " WAN ",
        "option3": " MAN ",
        "option4": " VAN",
        "answar": "2",
        "category": "computer",
        "explain": " (2) A Wide Area Network (WAN) is a network that covers a broad area (i.e., any telecommunications network that links across metropolitan, regional, or national boundaries) using private or public network transports. Business an-d government entities utilize WANs to relay data among employees, clients, buyers, and suppliers from various geographical locations. In essence, this mode of telecommunication allows a business to effectively carry out its daily function regardless of location. "
    },
    {
        "question": "Microsoft Office’s personal information manager is ",
        "option1": " Outlook ",
        "option2": " Internet Explorer ",
        "option3": " Organizer ",
        "option4": " Access",
        "answar": "1",
        "category": "computer",
        "explain": " (1) Microsoft Outlook is a personal information manager from Microsoft, available as a part of the Microsoft Office suite. Although often used mainly as an email application, it also includes a calendar, task manager, contact manager, note taking, a journal and web browsing. "
    },
    {
        "question": "WIKILEAKS, a whistleblowers website is an international organisation based in ",
        "option1": " U.S.A. ",
        "option2": " U.K. ",
        "option3": " Sweden ",
        "option4": " Norway",
        "answar": "1",
        "category": "computer",
        "explain": " (1) WikiLeaks is an international, online, self-described not-for-profit organisation publishing submissions of secret information, news leaks, and classified media from anonymous news sources and whistleblowers. Its website, launched in 2006 under the Sunshine Press organisation, claimed a database of more than 1.2 million documents within a year of its launch. Julian Assange, an Australian Internet activist, is generally described as its founder, editor-in-chief, and director. it is based in USA."
    },
    {
        "question": "A parallel port is most often used by a – ",
        "option1": " Printer ",
        "option2": " Monitor ",
        "option3": " Mouse ",
        "option4": " External storage device",
        "answar": "1",
        "category": "computer",
        "explain": " (1) A parallel port can be used to connect a large number of devices. The most common usage was for printers, although scanners, external disk drives, and network adapters also used this port. With a special cable, two computers could also be connected directly for sharing files. "
    },
    {
        "question": "The symbols used in an assembly language are ",
        "option1": " Codes ",
        "option2": " Mnemonics ",
        "option3": " Assembler ",
        "option4": " Machine codes",
        "answar": "2",
        "category": "computer",
        "explain": " (2) Assembly language uses a mnemonics to represent each low-level machine operation or opcode. Some opcodes require one or more operands as part of the instruction, and most assemblers can take labels and symbols as operands to represent addresses and constants, instead of hard coding them into the program. "
    },
    {
        "question": "The ‘NOSHADE’ attribute in HTML ",
        "option1": " defines the thickness of the line ",
        "option2": " displays the line in red ",
        "option3": " displays the line in dark grey ",
        "option4": " displays the example in red",
        "answar": "2",
        "category": "computer",
        "explain": " (2) The ‘NOSHADE’ attribute in HTML specifies that a horizontal line should render in one solid color (no shaded), instead of a shaded color. So, it displays the line in red. "
    },
    {
        "question": "Where are programs and data to be used by the computer available? ",
        "option1": " Processing Unit ",
        "option2": " Output ",
        "option3": " Storage ",
        "option4": " Input",
        "answar": "3",
        "category": "computer",
        "explain": " (3) In a computer, storage is the place where data is held in an electromagnetic or optical form for access by a computer processor. It is a technology consisting of computer components and recording media used to retain digital data. It is a core function and fundamental component of computers. "
    },
    {
        "question": "In HTML, <B> and </B> tags display the enclosed text in ",
        "option1": " black colour ",
        "option2": " background ",
        "option3": " bold ",
        "option4": " bright",
        "answar": "3",
        "category": "computer",
        "explain": " (3) In HTML, The Bold <B></B> element specifies that the enclosed text should be displayed in boldface. The Underlined <U></U> element specifies that the enclosed text should be displayed underlined. The Italic <I></I> element specifies that the enclosed text should be italicized. "
    },
    {
        "question": "Which of the following is not a Hardware ? ",
        "option1": " Processor chip ",
        "option2": " Printer ",
        "option3": " Mouse ",
        "option4": " Java",
        "answar": "4",
        "category": "computer",
        "explain": " (4) Processor chip, Printer and Mouse are hardware while JAVA is a software. Java is a programming language originally developed by James Gosling at Sun Microsystems (which has since merged into Oracle Corporation) and released in 1995 as a core component of Sun Microsystems’ Java platform. The language derives much of its syntax from C and C++, but it has fewer low-level facilities than either of them. "
    },
    {
        "question": "Which one of the following is a system software ? ",
        "option1": " Database programs ",
        "option2": " Word processors ",
        "option3": " Spreadsheets ",
        "option4": " Compilers",
        "answar": "4",
        "category": "computer",
        "explain": " (4) System software (or systems software) is computer software or an operating system designed to operate and control the computer hardware and to provide a platform for running application software. The term system software also includes software development tools like a compiler. "
    },
    {
        "question": "Who introduced “MMX” technology? ",
        "option1": " IBM ",
        "option2": " Apple ",
        "option3": " Microsoft ",
        "option4": " Intel",
        "answar": "4",
        "category": "computer",
        "explain": " (4) MMX is a single instruction, multiple data (SIMD) instruction set designed by Intel, introduced in 1996 with their P5-based Pentium line of microprocessors, designated as \"Pentium with MMX Technology\". It developed out of a similar unit introduced on the Intel i860, and earlier the Intel i750 video pixel processor. "
    },
    {
        "question": "Where is the proposed Microsoft Software Development Centre in India to come up? ",
        "option1": " Bangalore ",
        "option2": " New Delhi ",
        "option3": " Hyderabad",
        "option4": " Pune",
        "answar": "3",
        "category": "computer",
        "explain": " (3) Located in Hyderabad, the Microsoft India Development Center (MSIDC) is Microsoft’s largest software development center outside of their headquarters in Redmond, Washington. The MSIDC teams focus on strategic and IP sensitive software product development. "
    },
    {
        "question": "‘IC-Chips’ for computer are usually made of ",
        "option1": " Silicon ",
        "option2": " Lead ",
        "option3": " Chromium ",
        "option4": " Gold",
        "answar": "1",
        "category": "computer",
        "explain": " (1) An integrated circuit or monolithic integrated circuit (also referred to as an IC, a chip, or a microchip) is an electronic circuit on one small plate (\"chip\") of semiconductor material, normally silicon. Such a circuit can be made very compact, having up to several billion transistors and other electronic components. "
    },
    {
        "question": "To read a CD-ROM disc, you need a ",
        "option1": " laser beam ",
        "option2": " magnetic needle ",
        "option3": " sound card ",
        "option4": " graphics card",
        "answar": "1",
        "category": "computer",
        "explain": " (1) Data is stored on the disc as a series of microscopic indentations. A laser is shone onto the reflective surface of the disc to read the pattern of pits and lands. Because the depth of the pits is approximately one-quarter to one-sixth of the wavelength of the laser light used to read the disc, the reflected beam's phase is shifted in relation to the incoming beam, causing destructive interference and reducing the reflected beam's intensity. This pattern of changing intensity of the reflected beam is converted into binary data. COMPUTER & IT SGAE–1039 "
    },
    {
        "question": "If you undergo a CAT scan then you have been subjected to ",
        "option1": " a computer aided test ",
        "option2": " a computerised axial topography ",
        "option3": " a computer aided tomography ",
        "option4": " a computerised axial tomography",
        "answar": "4",
        "category": "computer",
        "explain": " (4) A CT scan stands for Computed Tomography scan. It is also known as a CAT (Computer Axial Tomography) Scan. It is a medical imaging procedure that utilizes computer-processed X-rays to produce tomographic images or 'slices' of specific areas of the body. "
    },
    {
        "question": "Microsoft Power Point is a software designed to create ",
        "option1": " Internet browsers ",
        "option2": " Data bases ",
        "option3": " Text documents ",
        "option4": " Multimedia presentations",
        "answar": "4",
        "category": "computer",
        "explain": " (4) Microsoft PowerPoint is a robust tool for creating powerful multimedia presentations. It provides such features as clip art, fancy fonts, animations, charts, graphics, sound, and an array of dazzling color schemes to make the presentations more interactive and effective. "
    },
    {
        "question": "Information Technology is the combination of ",
        "option1": " computing, business and communications ",
        "option2": " business, internet and software ",
        "option3": " microelectronics, computing and communications ",
        "option4": " data base management, communications and internet",
        "answar": "4",
        "category": "computer",
        "explain": " (4) The term “Information Technology” (IT) has been variously defined. It is defined as the coming together of computing and telecommunications for the purpose of handling information; the application of technologies to information handling; including generation, storage, processing, retrieval and dissemination. It is a broad-based term comprising the gathering (acquisition), organization (packaging), storage and retrieval (dissemination) of information. Internet is an essential component of it. "
    },
    {
        "question": "An electronic device that produces sounds from instructions in a mini file is a ",
        "option1": " synthesizer ",
        "option2": " scanner ",
        "option3": " speaker ",
        "option4": " sampler",
        "answar": "1",
        "category": "computer",
        "explain": " (1) A sound synthesizer is an electronic instrument capable of producing a wide range of sounds. Synthesizers may either imitate other instruments (\"imitative synthesis\") or generate new timbres. They can be played (controlled) via a variety of different input devices (including keyboards, music sequencers and instrument controllers). Synthesizers generate electric signals (waveforms), and can finally be converted to sound through the loudspeakers or headphones. "
    },
    {
        "question": "A technique for producing animation in which one image changes into another is called ",
        "option1": " Embedding ",
        "option2": " Linking ",
        "option3": " Morphing ",
        "option4": " Scanning",
        "answar": "3",
        "category": "computer",
        "explain": " (3) Morphing is a special effect in motion pictures and animations that changes (or morphs) one image into another through a seamless transition. Most often it is used to depict one person turning into another through technological means or as part of a fantasy or surreal sequence. "
    },
    {
        "question": "The device that converts digital signals to analog signals at the start of long distance transmissions is ",
        "option1": " peripheral ",
        "option2": " modem ",
        "option3": " telephone ",
        "option4": " antenna",
        "answar": "2",
        "category": "computer",
        "explain": " (2) A modem takes the digital signal from the computer and converts it to \"analog\". It does this by both creating an analog sine wave and then \"MODulating\" it. Since the result still represents digital data, it could also be called a digital signal instead of analog. "
    },
    {
        "question": "Information in a combination of graphics, text, sound, video and animation is called ",
        "option1": " Multiprogram ",
        "option2": " Multifacet ",
        "option3": " Multimedia ",
        "option4": " Multiprocess",
        "answar": "3",
        "category": "computer",
        "explain": " (3) Multimedia is media and content that uses a combination of different content forms. This contrasts with media that use only rudimentary computer displays such as text-only or traditional forms of printed or hand-produced material. Multimedia includes a combination of text, audio, still images, animation, video, or interactivity content forms. "
    },
    {
        "question": "Optic fibres are used in place of wire cables because ",
        "option1": " they generate strong magnetic fields ",
        "option2": " they do not generate magnetic fields ",
        "option3": " they do not require boosting ",
        "option4": " they are more economical",
        "answar": "2",
        "category": "computer",
        "explain": " (2) Optical fibers are used instead of metal wires because signals travel along them with less loss and are also immune to electromagnetic interference. Besides, there are no radiated magnetic fields around optical fibers; the electromagnetic fields are confined within the fiber. Since fiber optics do not radiate electromagnetic energy, emissions cannot be intercepted. "
    },
    {
        "question": "The name “modem” is derived from ",
        "option1": " modern demarkator ",
        "option2": " modulator demand ",
        "option3": " modern demodulator ",
        "option4": " modulator demodulator",
        "answar": "4",
        "category": "computer",
        "explain": " (4) A modem (modulator-demodulator) is a device that modulates an analog carrier signal to encode digital information, and also demodulates such a carrier signal to decode the transmitted information. The goal is to produce a signal that can be transmitted easily and decoded to reproduce the original digital data."
    },
    {
        "question": "How much data does a standard floppy disk hold? ",
        "option1": " 512KB ",
        "option2": " 1.44MB ",
        "option3": " 20 MB ",
        "option4": " 1GB",
        "answar": "2",
        "category": "computer",
        "explain": " (2) The floppy disk were produced with a capacity of 720 KB, followed by what became the most common format, 1.44 MB. All disks had a rectangular hole which, if obstructed, write-enabled the disk. 1.44 MB disks had another hole which identified them as being of that capacity. "
    },
    {
        "question": "Consider the following statements: A. Adam Osborne produced the first portable computer. B. Ian Wilmut created the cloned sheep. Which of the statements given above is (are) correct ? ",
        "option1": " A only ",
        "option2": " B only ",
        "option3": " Both A and B ",
        "option4": " Neither (A) nor (B)",
        "answar": "3",
        "category": "computer",
        "explain": " (3) Adam Osborne was an American entrepreneur who was best known for creating the first commercially available portable computer, the Osborne 1, released in April 1981. Ian Wilmut is best known as the leader of the research group that in 1996 first cloned a mammal from an adult somatic cell, a Finnish Dorset lamb named Dolly. "
    },
    {
        "question": "In a computer, what does RAM stand for ? ",
        "option1": " Ready to Access Memory ",
        "option2": " Read At-a-time Memory ",
        "option3": " Random Access Memory ",
        "option4": " Readily Available Memory",
        "answar": "3",
        "category": "computer",
        "explain": " (3) Random-access memory (RAM) is a form of computer data storage. A random-access device allows stored data to be accessed in very nearly the same amount of time for any storage location, so data can be accessed quickly in any random order. In contrast, other data storage media read and write data only in a predetermined order. "
    },
    {
        "question": "The period of the Second Generation Computers was ",
        "option1": " 1946 – 1958 ",
        "option2": " 1940 – 1960 ",
        "option3": " 1959 – 1964 ",
        "option4": " 1965 – 1975",
        "answar": "3",
        "category": "computer",
        "explain": " (3) The period 1953-1964 is generally taken to be the period of second generation computers. Sometimes, 1946-1958 is supposed to be the period of first generation computers. By 1948, the invention of the transistor greatly changed the computer's development. The transistor replaced the large, cumbersome vacuum tube in televisions, radios and computers. As a result, the size of electronic machinery has been shrinking ever since. From 1955 onwards transistors replaced vacuum tubes in computer designs, giving rise to the \"second generation\" of computers. A second generation computer, the IBM 1401, captured about one third of the world market. IBM installed more than ten thousand 1401s between 1960 and 1964 . "
    },
    {
        "question": "LAN stands for ",
        "option1": " Land Area Network ",
        "option2": " Local Area Network ",
        "option3": " Local Access Network ",
        "option4": " Local Area Netware",
        "answar": "2",
        "category": "computer",
        "explain": " (2) A local area network (LAN) is a computer network that interconnects computers in a limited area such as a home, school, computer laboratory, or office building using network media. The defining characteristics of LANs, in contrast to wide area networks (WANs), include their usually higher data-transfer rates, smaller geographic area, and lack of a need for leased telecommunication lines. "
    },
    {
        "question": "Correct expansion of the term ‘http’ in Internet address is ",
        "option1": " higher text transfer protocol ",
        "option2": " higher transfer text protocol ",
        "option3": " hybrid text transfer protocol ",
        "option4": " hypertext transfer protocol",
        "answar": "4",
        "category": "computer",
        "explain": " (4) The Hypertext Transfer Protocol (HTTP) is an application protocol for distributed, collaborative, hypermedia information systems. HTTP is the foundation of data communication for the World Wide Web. HTTP is the protocol to exchange or transfer hypertext. "
    },
    {
        "question": "The term PC means ",
        "option1": " Private Computer ",
        "option2": " Personal Computer ",
        "option3": " Professional Computer ",
        "option4": " Personal Calculator",
        "answar": "2",
        "category": "computer",
        "explain": " (2) A personal computer (PC) is any general-purpose computer whose size, capabilities, and original sales price make it useful for individuals, and which is intended to be operated directly by an end-user with no intervening computer operator. This contrasted with the batch processing or time-sharing models which allowed larger, more expensive minicomputer and mainframe systems to be used by many people. "
    },
    {
        "question": "1024 bytes equals : ",
        "option1": " 1 TB ",
        "option2": " 1 GB ",
        "option3": " 1 MB ",
        "option4": " 1 KB",
        "answar": "4",
        "category": "computer",
        "explain": " (4) The kilobyte (symbol: kB) is a multiple of the unit byte for digital information. Although the prefix kilomeans 1000, the term kilobyte and symbol kB have historically been used to refer to either 1024 bytes or 1000 (103 ) bytes, dependent upon context, in the fields of computer science and information technology. COMPUTER & IT SGAE–1040 "
    },
    {
        "question": "The term 'PC - XT' refers to ____. ",
        "option1": " Personal Computer External Technology ",
        "option2": " Personal Computer Extended Technology ",
        "option3": " Personal Computer Expanded Technology ",
        "option4": " Personal Computer Embedded Technology",
        "answar": "2",
        "category": "computer",
        "explain": " (2) The IBM PC XT was the successor of the IBM PC. The XT stands for EXtended Technology and was introduced in early 1983. It had enhanced features: CGA graphic card, hard disk, more memory, and no more tape port. The term PC-XT refers to personal computer extended Technology. "
    },
    {
        "question": "ENIAC was ",
        "option1": " an electronic calculator ",
        "option2": " an electronic computer ",
        "option3": " an memory device ",
        "option4": " an engine",
        "answar": "2",
        "category": "computer",
        "explain": " (2) ENIAC was the first electronic general-purpose computer. It was Turing-complete, digital, and capable of being reprogrammed to solve a full range of computing problems. It was designed to calculate artillery firing tables for the United States Army's Ballistic Research Laboratory. "
    },
    {
        "question": "One byte consists of ",
        "option1": " one bit ",
        "option2": " four bits ",
        "option3": " eight bits ",
        "option4": " ten bits",
        "answar": "3",
        "category": "computer",
        "explain": " (3) The byte is a unit of digital information in computing and telecommunications that most commonly consists of eight bits. Historically, a byte was the number of bits used to encode a single character of text in a computer and for this reason it is the basic addressable element in many computer architectures. "
    },
    {
        "question": "The first operational electronic digital computer is ",
        "option1": " ENIAC ",
        "option2": " EDVAC ",
        "option3": " EDSAC ",
        "option4": " UNIVAC",
        "answar": "1",
        "category": "computer",
        "explain": " (1) ENIAC was the first electronic general-purpose computer. It was Turing-complete, digital, and capable of being reprogrammed to solve a full range of computing problems. The 18,000-tube ENIAC was completed in 1946. "
    },
    {
        "question": "DTP stands for ",
        "option1": " Daily Text Printing ",
        "option2": " Desk Top Publishing ",
        "option3": " Desk Top Printing ",
        "option4": " Daily Text Publishing",
        "answar": "2",
        "category": "computer",
        "explain": " (2) Desktop publishing software (abbreviated DTP) is the creation of printed materials using page layout on a personal computer. When used skillfully, desktop publishing software can produce printed literature with attractive layouts and typographic quality comparable to traditional typography and printing. "
    },
    {
        "question": "Which of the following is not a computer network? ",
        "option1": " Wide area network ",
        "option2": " Local area network ",
        "option3": " Personal network ",
        "option4": " Metropolitan area network",
        "answar": "3",
        "category": "computer",
        "explain": " (3) A personal network is a set of human contacts known to an individual, with whom that individual would expect to interact at intervals to support a given set of activities. Personal networks are intended to be mutually beneficial–extending the concept of teamwork beyond the immediate peer group. The term is usually encountered in the workplace "
    },
    {
        "question": "When a group of computers is connected together in a small area without the help of telephone lines, it is called : ",
        "option1": " Remote Communication Network (RCN) ",
        "option2": " Local Area Network (LAN) ",
        "option3": " Wide Area Network (WAN) ",
        "option4": " Value Added Network (VAN)",
        "answar": "2",
        "category": "computer",
        "explain": " (2) A local area network (LAN) is a computer network that interconnects computers in a limited area such as a home, school, computer laboratory, or office building using network media. The defining characteristics of LANs, in contrast to wide area networks (WANs), include their usually higher data-transfer rates, smaller geographic area, and lack of a need for leased telecommunication lines. "
    },
    {
        "question": "Fifth generation computers do not have : ",
        "option1": " Speech recognition ",
        "option2": " Artificial intelligence ",
        "option3": " Very large scale integration ",
        "option4": " Vacuum tubes",
        "answar": "4",
        "category": "computer",
        "explain": " (4) The period of first generation computers (1946- 1958) is referred to as the Vacuum Tube Years. The first generation computers were huge, slow, expensive, and often undependable. In 1946 Presper Eckert and John Mauchly built the ENIAC electronic computer which used vacuum tubes instead of the mechanical switches of the Mark I. The ENIAC led to other vacuum tube type computers like the EDVAC (Electronic Discrete Variable Automatic Computer) and the UNIVAC I (UNIVersal Automatic Computer). "
    },
    {
        "question": "Where does a computer add, compare and shuffle data ? ",
        "option1": " Memory chip ",
        "option2": " CPU chip ",
        "option3": " Floppy disk ",
        "option4": " Hard disk",
        "answar": "2",
        "category": "computer",
        "explain": " (2) A central processing unit (CPU) is the hardware within a computer system which carries out the instructions of a computer program by performing the basic arithmetical, logical, and input/output operations of the system. Two typical components of a CPU are the arithmetic logic unit (ALU), which performs arithmetic and logical operations, and the control unit (CU), which extracts instructions from memory and decodes and executes them, calling on the ALU when necessary. In most computers, the shuffling of data between the CPU and RAM happens millions of times every second. "
    },
    {
        "question": "The letter ‘G’ used in ‘2G Spectrum’ stands for ",
        "option1": " Governance ",
        "option2": " Global ",
        "option3": " Generation",
        "option4": " Google",
        "answar": "3",
        "category": "computer",
        "explain": " (3) 2G (or 2-G) is short for second-generation wireless telephone technology. Three primary benefits of 2G networks over their predecessors were that phone conversations were digitally encrypted; 2G systems were significantly more efficient on the spectrum allowing for far greater mobile phone penetration levels; and 2G introduced data services for mobile, starting with SMS text messages. "
    },
    {
        "question": "Double is a ______ data type. ",
        "option1": " primitive ",
        "option2": " user defined ",
        "option3": " system defined ",
        "option4": " local",
        "answar": "1",
        "category": "computer",
        "explain": " (1) The Double class wraps a value of the primitive type double in an object. An object of type Double contains a single field whose type is double. In addition, this class provides several methods for converting a double to a String and a String to a double, as well as other constants and methods useful when dealing with a double. "
    },
    {
        "question": "Most of the computers available today are : ",
        "option1": " 3rd generation computers ",
        "option2": " 4th generation computers ",
        "option3": " 5th generation computers ",
        "option4": " 6th generation computers",
        "answar": "2",
        "category": "computer",
        "explain": " (2) Fourth Generation computers are the modern day computers. It began in 1971 when the Intel 4004 chip took the integrated circuit one step further by locating all the components of a computer (central processing unit, memory, and input and output controls) on a minuscule chip. The microprocessor is the characteristic of fourth generation computers, capable of performing all of the functions of a computer's central processing unit. "
    },
    {
        "question": "A ____ is a high-speed network that connect local networks in a city or town. ",
        "option1": " LAN ",
        "option2": " MAN ",
        "option3": " WAN ",
        "option4": " TAN",
        "answar": "2",
        "category": "computer",
        "explain": " (2) A metropolitan area network (MAN) is a computer network that usually spans a city or a large campus. A MAN usually interconnects a number of local area networks (LANs) using a high-capacity backbone technology, such as fiber-optical links, and provides uplink services to wide area networks (or WAN) and the Internet. ."
    },
    {
        "question": "PDA stands for ",
        "option1": " Personal Digital Assistant ",
        "option2": " Personal Development Agency ",
        "option3": " Personal Data Authority ",
        "option4": " Personal Data Array",
        "answar": "1",
        "category": "computer",
        "explain": " (1) A personal digital assistant (PDA), also known as a palmtop computer, or personal data assistant, is a mobile device that functions as a personal information manager. PDAs are largely considered obsolete with the widespread adoption of smartphones. Nearly all current PDAs have the ability to connect to the Internet. "
    },
    {
        "question": "The device that converts computer output for transmission over telephone lines is called ",
        "option1": " interface ",
        "option2": " interpreter ",
        "option3": " modem ",
        "option4": " I/O port",
        "answar": "3",
        "category": "computer",
        "explain": " (3) The modem is an external device or internal electronic circuitry used to transmit and receive digital data over a communications line normally used for analog signals. A modem attached to a computer converts digital data to an analog signal that it uses to modulate a carrier frequency. This frequency is transmitted over a line, frequently as an audio signal over a telecommunications line, to another modem that converts it back into a copy of the original data. "
    },
    {
        "question": "A ‘bug’ in a programme is a ",
        "option1": " Statement ",
        "option2": " Error ",
        "option3": " Signature ",
        "option4": " both ",
        "answar": "2",
        "category": "computer",
        "explain": " (2) A software bug is an error, flaw, mistake, failure, or fault in a computer program or system that produces an incorrect or unexpected result, or causes it to behave in unintended ways. Most bugs arise from mistakes and errors made by people in either a program's source code or its design, and a few are caused by compilers producing incorrect code. "
    },
    {
        "question": "DOS is a ",
        "option1": " Direct Operating System ",
        "option2": " Dual Operating System ",
        "option3": " Disk Operating System ",
        "option4": " Dial-up Operating System",
        "answar": "3",
        "category": "computer",
        "explain": " (3) DOS (\"Disk Operating System) is an acronym for several closely related operating systems that dominated the IBM PC compatible market between 1981 and 1995, or until about 2000 including the partially DOS-based Microsoft Windows versions 95, 98, and Millennium Edition. COMPUTER & IT SGAE–1041 "
    },
    {
        "question": "One Byte is equal to ",
        "option1": " 8 bits ",
        "option2": " 12 bits ",
        "option3": " 16 bits ",
        "option4": " 20 bits",
        "answar": "1",
        "category": "computer",
        "explain": " (1) The byte is a unit of digital information in computing and telecommunications that most commonly consists of eight bits. Historically, a byte was the number of bits used to encode a single character of text in a computer. "
    },
    {
        "question": "Small and cheap computers built into several home appliances are of which type? ",
        "option1": " Mainframes ",
        "option2": " Mini computers ",
        "option3": " Micro computers ",
        "option4": " None of the above",
        "answar": "3",
        "category": "computer",
        "explain": " (3) A microcomputer is a small, relatively inexpensive computer with a microprocessor as its central processing unit (CPU). It includes a microprocessor, memory, and input/output (I/O) facilities. They were at the centre of the home computer market segment. "
    },
    {
        "question": "What is the process of defining tables called ? ",
        "option1": " Data definition ",
        "option2": " Data Normalisation ",
        "option3": " Index definition ",
        "option4": " Data administration",
        "answar": "3",
        "category": "computer",
        "explain": " (3) The process is known as index definition. The order in which columns are listed in the index definition is important. A database index is a data structure that improves the speed of data retrieval operations on a database table at the cost of slower writes and increased storage space. Indices can be created using one or more columns of a database table, providing the basis for both rapid random lookups and efficient access of ordered records. "
    },
    {
        "question": "Which of the following is an example of a database manager? ",
        "option1": " Organizer ",
        "option2": " Paradox ",
        "option3": " Quattro Pro ",
        "option4": " Corel Draw",
        "answar": "1",
        "category": "computer",
        "explain": " (1) An electric organizer is a small calculator-sized computer, often with an in-built diary application but few other functions such as an address book and calendar. It normally has a small alphanumeric keypad and an LCD screen of one, two or three lines. "
    },
    {
        "question": "What are the signals that inform the operating system that some activity has taken place, called ? ",
        "option1": " Informers ",
        "option2": " Interrupts ",
        "option3": " Events ",
        "option4": " Handlers",
        "answar": "4",
        "category": "computer",
        "explain": " (4) In computer programming, an event handler is an asynchronous callback subroutine that handles inputs received in a program. Each event is a piece of application-level information from the underlying framework, typically the GUI toolkit. GUI events include key presses, mouse movement, action selections, and timers expiring. Event handlers are a central concept in event-driven programming. "
    },
    {
        "question": "Small and cheap computers built into several home appliances are of which type ? ",
        "option1": " Mainframes ",
        "option2": " Mini computers ",
        "option3": " Micro computers ",
        "option4": " None of these",
        "answar": "3",
        "category": "computer",
        "explain": " (3) A microcomputer is a small, relatively inexpensive computer with a microprocessor as its central processing unit (CPU). It is most commonly associated with the first wave of all-in-one 8-bit home computers and small business microcomputers (such as the Apple II, Commodore 64, BBC Micro, and TRS 80). "
    },
    {
        "question": "What is the process of defining tables called ? ",
        "option1": " Data definition ",
        "option2": " Data Normalisation ",
        "option3": " Index definition ",
        "option4": " Data administration",
        "answar": "3",
        "category": "computer",
        "explain": " (3) The process is known as index definition. The order in which columns are listed in the index definition is important. "
    },
    {
        "question": "Virus in a computer is a ",
        "option1": " Chemical that attacks silicon ",
        "option2": " Micro-organism that disturbs integrated circuits ",
        "option3": " Programme that damages the computer software ",
        "option4": " None of the above",
        "answar": "3",
        "category": "computer",
        "explain": " (3) A computer virus is a computer program that can replicate itself and spread from one computer to another. Computer virus is a term applied to any program that is designed to damage data stored on a computer system or network. The virus may infect documents, applications or worst of all system files that are essential to the correct running of the computer system. A virus itself is programme software and has effect basically on software and not hardware. It could have effect on the systems or Application software to execute specific instructions on the hardware. "
    },
    {
        "question": "Alta Vista is a ",
        "option1": " Programme ",
        "option2": " Software ",
        "option3": " Browser ",
        "option4": " Search Engine",
        "answar": "4",
        "category": "computer",
        "explain": " (4) AltaVista was a web search engine owned by Yahoo!. AltaVista was once one of the most popular search engines but lost its ground due to the rise of Google. In May 2011, Yahoo! shut down the site. "
    },
    {
        "question": "ATM is the abbreviation for ",
        "option1": " Automatic Teller Machine ",
        "option2": " Automated Teller Machine ",
        "option3": " Authentic Teller Machine ",
        "option4": " Authorised Teller Machine",
        "answar": "2",
        "category": "computer",
        "explain": " (2) An automated teller machine or automatic teller machine (ATM) is a computerized telecommunications device that enables the clients of a financial institution to perform financial transactions without the need for a cashier, human clerk or bank teller. The first modern ATMs came into use in December 1972 in the UK; the IBM 2984 was designed at the request of Lloyds Bank. "
    },
    {
        "question": "A ‘Bit’ refers to ",
        "option1": " Binary informatics ",
        "option2": " Bilingual information ",
        "option3": " Binary terminator ",
        "option4": " Binary digit",
        "answar": "4",
        "category": "computer",
        "explain": " (4) A bit (a contraction of binary digit) is the basic capacity of information in computing and telecommunications; a bit can have the value of either 1 or 0 (one or zero) only. These attributes may be implemented, in a variety of systems, by means of a two state device. "
    },
    {
        "question": "_______ allows users to access accounts and pay bills ",
        "option1": " Distance Learning ",
        "option2": " Online Banking ",
        "option3": " E-Commerce ",
        "option4": " Multimedia",
        "answar": "3",
        "category": "computer",
        "explain": " (3) Electronic commerce, commonly known as e-commerce, is the buying and selling of product or service over electronic systems such as the Internet and other computer networks. Electronic commerce draws on such technologies as electronic funds transfer, supply chain management, Internet marketing, online transaction processing, electronic data interchange (EDI), inventory management systems, and automated data collection systems. "
    },
    {
        "question": "The act of writing new data into register ",
        "option1": " is possible only when the register is an accumulator ",
        "option2": " is possible only when the register is an accumulator or instruction register ",
        "option3": " erases the previous contents of the register ",
        "option4": " is non-destructive to existing contents",
        "answar": "2",
        "category": "computer",
        "explain": " (2) The act of writing new data into register is possible only when the register is an accumulator or instruction register. "
    },
    {
        "question": "Which one of the following is an optical disk ? ",
        "option1": " Jaz disk ",
        "option2": " Super disk ",
        "option3": " Worm disk ",
        "option4": " Zip disk",
        "answar": "2",
        "category": "computer",
        "explain": " (2) An optical disc is an electronic data storage medium that can be written to and read using a low-powered laser beam. Super disk is an optical disk. "
    },
    {
        "question": "The term API refers to ",
        "option1": " Application Program Interface ",
        "option2": " Application Program Interaction ",
        "option3": " Applied Program Interaction ",
        "option4": " Application Process Interface",
        "answar": "1",
        "category": "computer",
        "explain": " (1) API : Application Programming Interface "
    },
    {
        "question": "A Floppy Disc can store _____ data. ",
        "option1": " 1.44 bytes ",
        "option2": " 1.44 MB ",
        "option3": " 1.44 KB ",
        "option4": " 1.44 GB",
        "answar": "2",
        "category": "computer",
        "explain": " (2) A Floppy Disc can store 1.44 mb data. "
    },
    {
        "question": "Pick the odd one out : ",
        "option1": " Java clients ",
        "option2": " Worms ",
        "option3": " Trojan Horse ",
        "option4": " Virus",
        "answar": "3",
        "category": "computer",
        "explain": " (3) Trojan Horse is a hallow wooden horse."
    },
    {
        "question": " The rate at which scanning is repeated in a CRT is called : ",
        "option1": " refresh rate ",
        "option2": " resolution ",
        "option3": " pitch ",
        "option4": " bandwidth",
        "answar": "1",
        "category": "computer",
        "explain": " (1) The rate at which scanning is repeated in a CRT is called refresh rate. "
    },
    {
        "question": " Telnet is a : ",
        "option1": " browser ",
        "option2": " protocol ",
        "option3": " gateway ",
        "option4": " search engine",
        "answar": "2",
        "category": "computer",
        "explain": " (2) Telnet is a protocol. "
    },
    {
        "question": " The term ODBC stands tor: ",
        "option1": " Object Database Communication. ",
        "option2": " Open Database Communication. ",
        "option3": " Open Database Connectivity. ",
        "option4": " Object Database Connectivity.",
        "answar": "3",
        "category": "computer",
        "explain": " (3) ODBC : Open Database Connectivity "
    },
    {
        "question": " Both the ALU and Control Section have special purpose storage locations called : ",
        "option1": " Registers ",
        "option2": " Accumulators ",
        "option3": " Bus ",
        "option4": " Address",
        "answar": "1",
        "category": "computer",
        "explain": " (1) Both the ALU (Arithmetic Logic Unit) and Control Section have special purpose storage locations called registers. "
    },
    {
        "question": " A translator for the assembly language to machine language is ",
        "option1": " assembler ",
        "option2": " compiler ",
        "option3": " interpreter ",
        "option4": " linker",
        "answar": "1",
        "category": "computer",
        "explain": " (1) Assembly language is converted into executable machine code by a utility program referred to as an assembler; the conversion process is referred to as assembly, or assembling the code. "
    },
    {
        "question": " Where is India’s super computer ‘PARAM’ located ? ",
        "option1": " Chennai ",
        "option2": " Pune ",
        "option3": " Bengaluru ",
        "option4": " Kolkata",
        "answar": "2",
        "category": "computer",
        "explain": " (2) PARAM is a series of supercomputers designed and assembled by the Centre for Development of Advanced Computing (C-DAC) in Pune, India. The latest machine in the series is the PARAM Yuva. PARAM 8000, which was installed in 1991, is considered as India’s first supercomputer. "
    },
    {
        "question": " Expansion of RDBMS is ",
        "option1": " Repairable Database Management System ",
        "option2": " Relational Database Management System ",
        "option3": " Relational Database Memory System ",
        "option4": " Recurring Database Memory System",
        "answar": "2",
        "category": "computer",
        "explain": " (2) A relational database management system (RDBMS) is a database management system (DBMS) that is based on the relational model as introduced by E. F. Codd, of IBM’s San Jose Research Laboratory. "
    },
    {
        "question": " ________ is a program that places programs into memory and prepares them for execution. ",
        "option1": " Assembler ",
        "option2": " Compiler ",
        "option3": " Loader ",
        "option4": " Macro processor",
        "answar": "3",
        "category": "computer",
        "explain": " (3) Loader is a program that places programs into memory and prepares them for execution. "
    },
    {
        "question": " Programs stored in a ROM are called ",
        "option1": " Software ",
        "option2": " Freeware ",
        "option3": " Firmware ",
        "option4": " None of these",
        "answar": "3",
        "category": "computer",
        "explain": " (3) Programs stored in a ROM (Read Only Memory) are called Firmware. "
    },
    {
        "question": " A bug in a programme is a/an ",
        "option1": " Statement ",
        "option2": " Error ",
        "option3": " Syntax ",
        "option4": " Both ",
        "answar": "2",
        "category": "computer",
        "explain": " (2) A bug in a program is an error. "
    },
    {
        "question": " Icons are ______commands. ",
        "option1": " typed ",
        "option2": " verbal ",
        "option3": " picture ",
        "option4": " imaginary",
        "answar": "3",
        "category": "computer",
        "explain": " (3) Icons on the screen of a computer are picture commands. "
    },
    {
        "question": " Which one of the following is an MS-DOS external command ? ",
        "option1": " DIR ",
        "option2": " COPY ",
        "option3": " FORMAT ",
        "option4": " PROMPT",
        "answar": "3",
        "category": "computer",
        "explain": " (3) FORMAT is an MS-DOS external command. "
    },
    {
        "question": " An address consists of ____. ",
        "option1": " an offset ",
        "option2": " a base register ",
        "option3": " an index register ",
        "option4": " All of the above",
        "answar": "4",
        "category": "computer",
        "explain": " (4) An address consists of an offset, a base register and an index register. "
    },
    {
        "question": " A ____ is an input device, which is used for converting pictures, maps and drawings into digital form for storage in computers. ",
        "option1": " OCR ",
        "option2": " OMR ",
        "option3": " MICR ",
        "option4": " digitizer",
        "answar": "4",
        "category": "computer",
        "explain": " (4) A digitizer is an input device, which is used for converting pictures, maps and drawings into digital form for storage in computers. COMPUTER & IT SGAE–1042 "
    },
    {
        "question": " In C language, the formatting character should be preceded by the symbol: ",
        "option1": " + ",
        "option2": " / ",
        "option3": " % ",
        "option4": " –",
        "answar": "3",
        "category": "computer",
        "explain": " (3) In C language, the formatting character should be preceded by the symbol %. "
    },
    {
        "question": " A ‘bug’ in a program is ",
        "option1": " Statement ",
        "option2": " Error ",
        "option3": " Syntax ",
        "option4": " Both ",
        "answar": "2",
        "category": "computer",
        "explain": " (2) A bug in a program is an error, flaw, mistake or failure. "
    },
    {
        "question": " Which one of the following allows computers to transfer data using a telephone line ? ",
        "option1": " Keyboard ",
        "option2": " CPU ",
        "option3": " Modem ",
        "option4": " Printer",
        "answar": "3",
        "category": "computer",
        "explain": " (3) Modem allows computers to transfer data using a telephone line. "
    },
    {
        "question": " The process of writing on an optical disc is called ",
        "option1": " Ripping ",
        "option2": " Fetching ",
        "option3": " Scanning ",
        "option4": " Burning",
        "answar": "4",
        "category": "computer",
        "explain": " (4) Burning "
    },
    {
        "question": " A place through which, data can enter or leave a computer is called ",
        "option1": " bus ",
        "option2": " dock ",
        "option3": " mouse ",
        "option4": " port",
        "answar": "4",
        "category": "computer",
        "explain": " (4) port "
    },
    {
        "question": " Which of the following is not a secondary storage unit? ",
        "option1": " RAM ",
        "option2": " DVD ",
        "option3": " Floppy ",
        "option4": " Magnetic tape",
        "answar": "1",
        "category": "computer",
        "explain": " (1) RAM is not a secondary storage device. Storage consists of storage devices and their media not directly accessible by the Central Processing Unit (CPU). Secondary storage is all data storage that is not currently in a computer’s primary storage or memory. "
    },
    {
        "question": " “Booting the System” means ",
        "option1": " loading the operating system ",
        "option2": " dismissing the computer ",
        "option3": " running an application program called “Booting”. ",
        "option4": " physically kicking the computer",
        "answar": "1",
        "category": "computer",
        "explain": " (1) ‘Booting the System’ means restarting a computer or its operating system software. "
    },
    {
        "question": " An attribute that uniquely identifies the rows of a table is known as the ....... key. ",
        "option1": " primary ",
        "option2": " candidate ",
        "option3": " composite ",
        "option4": " foreign",
        "answar": "1",
        "category": "computer",
        "explain": " (1) An attribute that uniquely identifies the rows of a table is known as the primary key."
    },
    {
        "question": " In Windows, Icons such as Add/ Remove programs, Add New Hardware, Modems etc.; are found in : ",
        "option1": " Task Bar ",
        "option2": " Control Panel ",
        "option3": " Network Neighbourhood ",
        "option4": " My Computer",
        "answar": "2",
        "category": "computer",
        "explain": " (2) The Control Panel is a part of the Microsoft Windows graphical user interface which allows users to view and manipulate basic system settings and controls via applets, such as adding hardware, adding and removing software, controlling user accounts and changing accessibility options. "
    },
    {
        "question": " DVD is : ",
        "option1": " Dynamic Video Disk ",
        "option2": " Digital Video Disk ",
        "option3": " Dynamic Versatile Disk ",
        "option4": " Digilal Versatile Disk",
        "answar": "4",
        "category": "computer",
        "explain": " (4) DVD stands for Digital Versatile Disk. It is an optical disc storage format, invented and developed by Philips, Sony, Toshiba and Panasonic in 1995. When first invented, DVD stands for Digital Video Disk. Later on, DVD Forum proposed the backronym Digital Versatile Disk . "
    },
    {
        "question": " Find the odd man out : ",
        "option1": " Internet Explorer ",
        "option2": " Netscape ",
        "option3": " Mozilla ",
        "option4": " Excel",
        "answar": "4",
        "category": "computer",
        "explain": " (4) Excel is different from the other three. Internet Explorer, Netscaps and Mozilla are navigation programmes. Microsoft Excel is a spreadsheet application. "
    },
    {
        "question": " In MS-Excel, ______ provide a visual representation of the values in a worksheet. ",
        "option1": " Charts ",
        "option2": " Formulae ",
        "option3": " Templates ",
        "option4": " Views",
        "answar": "1",
        "category": "computer",
        "explain": " (1) In MS-Excel charts provide a visual representation of the values in a worksheet. "
    },
    {
        "question": " Speed of processor chip is measured in ",
        "option1": " Mbps ",
        "option2": " MHz ",
        "option3": " Bits/second ",
        "option4": " Bytes/second",
        "answar": "2",
        "category": "computer",
        "explain": " (2) Speed of processor chip is measured in megahertz (MHz) and gigahertz (GHz). "
    },
    {
        "question": " Which command is not used to switch off the computer ? ",
        "option1": " Turn off ",
        "option2": " Log off ",
        "option3": " Shut Down ",
        "option4": " Hibernate",
        "answar": "4",
        "category": "computer",
        "explain": " (4) Turn off, Log off and Shut Down are commands used to switch off the computer. "
    },
    {
        "question": " Synonym of Internet is ",
        "option1": " Gopher ",
        "option2": " Intranet ",
        "option3": " Cyber Space ",
        "option4": " World Wide Web (WWW)",
        "answar": "3",
        "category": "computer",
        "explain": " (3) The Internet is a global system of interconnected computer networks that use the standard Internet protocol suite. It is a network of networks linked by a broad array of electronic, wireless and optical networking technologies. Cyberspace refers to the global network of interdependent information technology infrastructures, telecommunications networks and computer processing systems in which online communication takes place. "
    },
    {
        "question": " The most crucial portion of any computer is the _____. ",
        "option1": " I/O Unit ",
        "option2": " Hard Disk ",
        "option3": " CPU ",
        "option4": " Memory",
        "answar": "3",
        "category": "computer",
        "explain": " (3) The most crucial portion of any computer is the Central Processing Unit (CPU). The CPU is the brain of the computer where most calculations take place. "
    },
    {
        "question": " In MS-Word, multiple words, lines or paragraphs can be selected by using ____ key. ",
        "option1": " Shift ",
        "option2": " Function F5 ",
        "option3": " Alt ",
        "option4": " Ctrl",
        "answar": "4",
        "category": "computer",
        "explain": " (4) In MS Word, multiple words, lines or paragraphs can be selected by using Ctrl+C keys. "
    },
    {
        "question": " Pick the odd one out. ",
        "option1": " Floppy Disk ",
        "option2": " ROM ",
        "option3": " DVD ",
        "option4": " Hard Disk",
        "answar": "2",
        "category": "computer",
        "explain": " (2) Read Only Memory (ROM) is a class of storage medium used in computers and other electronic devices. A hard disc drive is a data storage device. ROM is a primary storage medium while all others are secondary storage units. "
    },
    {
        "question": " Majority of the errors blamed on computers are actually due to ",
        "option1": " programming errors ",
        "option2": " hardware failure ",
        "option3": " defects in media ",
        "option4": " data entry errors",
        "answar": "4",
        "category": "computer",
        "explain": " (4) A programming error is an error which results from bad code in some program involved in producing the erroneous result. But, most of the errors are due to the person using it or giving wrong commands or data to the system. The next most common source is the poorly coded software. "
    },
    {
        "question": " The alignment of beginning and the end of lines is referred to as ",
        "option1": " Indentation ",
        "option2": " Justification ",
        "option3": " Superscript ",
        "option4": " Font",
        "answar": "2",
        "category": "computer",
        "explain": " (2) Text can be aligned with one or both edges (or insets) of a text frame. Text is said to be justified when it is aligned with both edges. We can justify text in a paragraph including the last line. "
    },
    {
        "question": " Which of the following is not a logical operator ? ",
        "option1": " ADD ",
        "option2": " AND ",
        "option3": " NOT ",
        "option4": " OR",
        "answar": "1",
        "category": "computer",
        "explain": " (1) Logical operators are mainly used to control program flow. And, Or, AndAlso, OrElse, and Xor are binary operators. "
    },
    {
        "question": " Arithmetic and Logic Unit I. Perform Arithmetic operations II. Store Data III. Perform comparisons IV. Communicate with input devices Which of the following is true ? ",
        "option1": " I only ",
        "option2": " III only ",
        "option3": " I and II ",
        "option4": " I and III",
        "answar": "4",
        "category": "computer",
        "explain": " (4) Arithmetic and Logic Unit (ALU) performs Arithmetic operations and comparisons. "
    },
    {
        "question": " In Word Processing, moving lexi from one place to another within a document is called as _____. ",
        "option1": " Clip Art ",
        "option2": " Search and Replace ",
        "option3": " Cut and Paste ",
        "option4": " Block Operation",
        "answar": "3",
        "category": "computer",
        "explain": " (3) In Word Processing, moving text from one place to another within a document is called as Cut and Paste. "
    },
    {
        "question": " What MS-DOS command is used to create a subdirectory ? ",
        "option1": " DIR/MK ",
        "option2": " MKDIR ",
        "option3": " CHDIR ",
        "option4": " RMDIR",
        "answar": "2",
        "category": "computer",
        "explain": " (2) MKDIR Ms-DOS command is used to create a subdirectory. "
    },
    {
        "question": " Which was the first super computer purchased by India for medium range weather forecasting? ",
        "option1": " CrayXMP-14 ",
        "option2": " Medha - 930 ",
        "option3": " CDC Cyber 930-11 ",
        "option4": " Param",
        "answar": "1",
        "category": "computer",
        "explain": " (1) The First supercomputer was Cray XMP-14 which was installed at National Centre for Medium Range Weather Forecasting, New Delhi, in 1989. Param was developed by C-DAC Pune in 1991. "
    },
    {
        "question": " Which was the first electronic computer constructed at the Moore School of Engineering ‘? ",
        "option1": " EOVAC ",
        "option2": " ONIVAC ",
        "option3": " ENIAC ",
        "option4": " EDSAC",
        "answar": "3",
        "category": "computer",
        "explain": " (3) ENIAC (Electronic Numerical Integrator and Computer) was the first electronic general-purpose computer. Charles Babbage, at the University of Pennsylvania’s Moore School of Electrical Engineering, was one of its co-inventors. "
    },
    {
        "question": " Which among the following standard protocols is the most widely used by the Internet ? ",
        "option1": " HTTP ",
        "option2": " TCP/IP ",
        "option3": " SMTP ",
        "option4": " SLIP",
        "answar": "2",
        "category": "computer",
        "explain": " (2) The Internet protocol suite is the set of communications protocols used for the Internet and similar networks, and generally the most popular protocol stack for wide area networks. It is commonly known as TCP/IP, because of its most important protocols: Transmission Control Protocol (TCP) and Internet Protocol (IP), which were the first networking protocols defined in this standard. "
    },
    {
        "question": " What type of information system would be recognised by digital circuits ? ",
        "option1": " Binary system ",
        "option2": " Both hexadecimal and binary system ",
        "option3": " Only Roman system ",
        "option4": " Hexadecimal system",
        "answar": "1",
        "category": "computer",
        "explain": " (1) Digital circuits, represent signals by discrete bands of analog levels, rather than by a continuous range. Because the fundamental information element of digital circuits has two states, it is most naturally represented by a number system where each individual digit has two states: binary. "
    },
    {
        "question": " Which of the following is an impact printer ? ",
        "option1": " Ink-jet printer ",
        "option2": " Bubble-jet printer ",
        "option3": " Laser printer ",
        "option4": " Daisy wheel printer",
        "answar": "4",
        "category": "computer",
        "explain": " (4) Impact Printers refer to a class of printers that work by banging a head or needle against an ink ribbon to make a mark on the paper. This includes dot-matrix printers, daisy-wheel printers, and line printers. In contrast, laser and ink-jet printers are nonimpact printers. "
    },
    {
        "question": " Identify the odd term amongst the following group : ",
        "option1": " Optical fibre ",
        "option2": " Twisted pair wire ",
        "option3": " Microwaves ",
        "option4": " Coaxial cable",
        "answar": "3",
        "category": "computer",
        "explain": " (3) Microwaves are radio waves, while the rest three are some form of cables. Coaxial cable: a kind of copper cable used between the community antenna and user homes and businesses; Optical fiber: a flexible, transparent fiber made of glass or plastic; and Twisted pair cable: a type of wiring in which two conductors of a single circuit are twisted together for the purposes of canceling out electromagnetic interference (EMI) from external sources. "
    },
    {
        "question": " The first computer mouse was built by ",
        "option1": " Douglas Engelbart ",
        "option2": " William English ",
        "option3": " Oaniel Coogher ",
        "option4": " Robert Zawacki",
        "answar": "1",
        "category": "computer",
        "explain": " (1) The computer mouse as we know it today was invented and developed by Douglas Englebart during the 1960’s. While creating the mouse, Douglas was working at the Stanford Research Institute and originally referred to the mouse as a “X-Y Position Indicator for a Display System.” This mouse was first used with the Xerox Alto computer system in 1973."
    },
    {
        "question": " A collection of HTML pages makes up the_______. ",
        "option1": " Hyperlinks ",
        "option2": " Hypertext ",
        "option3": " World Wide Web ",
        "option4": " Hypermedia",
        "answar": "3",
        "category": "computer",
        "explain": " (3) Web pages are what make up the World Wide Web. These documents are written in HTML (hypertext markup language) and are translated by the Web browser. "
    },
    {
        "question": " The technology that is used to establish wireless networking is ",
        "option1": " TCP/IP ",
        "option2": " J2ME ",
        "option3": " MATLAB ",
        "option4": " Bluetooth",
        "answar": "4",
        "category": "computer",
        "explain": " (4) Bluetooth is a wireless technology standard for exchanging data over short distances, creating personal area networks (PANs) with high levels of security. It can connect several devices, overcoming problems of synchronization. "
    },
    {
        "question": " What is USB ? ",
        "option1": " Ultimate Service Bit ",
        "option2": " Universal Sent-Bit ",
        "option3": " Universal Serial Bus ",
        "option4": " Urgent Sent Bit",
        "answar": "3",
        "category": "computer",
        "explain": " (3) Universal Serial Bus (USB) is an industry standard developed in the mid-1990s that defines the cables, connectors and communications protocols used in a bus for connection, communication and power supply between computers and electronic devices. USB was designed to standardize the connection of computer peripherals to personal computers, both to communicate and to supply electric power. "
    },
    {
        "question": " Sun Lab’s Java Car uses ....... technology to keep your car networked with the world outside. ",
        "option1": " embedded ",
        "option2": " spam ",
        "option3": " smart Screen",
        "option4": " access Point",
        "answar": "1",
        "category": "computer",
        "explain": " (1) The Sun Labs skunk works have found the use of computers and networks in the car, using Java, Solaris/Linux, and embedded systems. The car track is embedded with real-time Java sensor technology. "
    },
    {
        "question": " Identify the LIFO (Last In First Out) structure among the following: ",
        "option1": " Stack ",
        "option2": " Queue ",
        "option3": " De-queue ",
        "option4": " Array",
        "answar": "1",
        "category": "computer",
        "explain": " (1) In computer science, LIFO refers to the way items stored in some types of data structures are processed. A LIFO structure can be illustrated with the example of a stack of trays. The term in computing generally refers to the abstract principles of list processing and temporary storage, particularly when there is a need to access the data in limited amounts, and in a certain order. "
    },
    {
        "question": " Who is the founder of “Facebook” which is currently the No.1 social networking website in India? ",
        "option1": " Bill Gates ",
        "option2": " Martin Cooper ",
        "option3": " Orkut Buyukkokten ",
        "option4": " Mark Zuckerberg",
        "answar": "4",
        "category": "computer",
        "explain": " (4) Mark Elliot Zuckerburg is an American computer programmer and internet entrepreneur. He is best known as one of five co-founders of the social networking website Facebook. "
    },
    {
        "question": " In programming, repeating some statements is usually called ",
        "option1": " Compiling ",
        "option2": " Structure ",
        "option3": " Looping ",
        "option4": " Control structure",
        "answar": "3",
        "category": "computer",
        "explain": " (3) Looping is used in programming to save the tedium of many repetitive tasks. One of the main uses of loops in programs is to carry out repetitive tasks. A loop executes one or more lines of code (statements) as many times as one wants. "
    },
    {
        "question": " Which of the following is not an operating system ? ",
        "option1": " Multi user-Single tasking ",
        "option2": " Single user- Single tasking ",
        "option3": " Single user-Multitasking ",
        "option4": " Multi user-Multitasking",
        "answar": "1",
        "category": "computer",
        "explain": " (1) A multi-user operating system allows multiple users to access a computer system at the same time. Although frequently associated with multiprogramming, multiuser operating system does, not imply multiprogramming or multitasking. "
    },
    {
        "question": " The telephone line is connected through the ____on the computer. ",
        "option1": " USB ",
        "option2": " Modem ",
        "option3": " Ethernet ",
        "option4": " PS2",
        "answar": "2",
        "category": "computer",
        "explain": " (2) A modem turns the digital data of a personal computer into modulated electrical signals in the voice frequency range of a telephone channel. These signals can be transmitted over telephone lines and demodulated by another modem at the receiver side to recover the digital data. "
    },
    {
        "question": " In the nuclear reactors, moderators are used to : ",
        "option1": " Accelerate neutrons ",
        "option2": " Absorb the neutrons ",
        "option3": " Slow down the neutrons ",
        "option4": " Generate neutrons",
        "answar": "3",
        "category": "computer",
        "explain": " (3) A moderator is a medium that reduces the speed of fast neutrons, thereby turning them into thermal neutrons capable of sustaining a nuclear chain reaction involving uranium-235. Commonly used moderators include regular (light) water (roughly 75% of the world's reactors), solid graphite (20% of reactors) and heavy water (5% of reactors). "
    },
    {
        "question": " In HTML, tags consists of keywords enclosed within ",
        "option1": " angular brackets < > ",
        "option2": " parentheses ( ) ",
        "option3": " square brackets [ ] ",
        "option4": " flower brackets { }",
        "answar": "1",
        "category": "computer",
        "explain": " (1) Hyper Text Markup Language (HTML) is the main markup language for creating web pages and other information that can be displayed in a web browser. HTML is written in the form of HTML elements consisting of tags enclosed in angle brackets (like <html>), within the web page content "
    },
    {
        "question": " _____printer cannot print more than one character at a time. ",
        "option1": " Daisy-wheel ",
        "option2": " Laser ",
        "option3": " Dot-matrix ",
        "option4": " Line",
        "answar": "1",
        "category": "computer",
        "explain": " (1) Line Printer: prints a whole line of characters at a time; Daisy Wheel Printer and Dot-Matrix printer: print one character at a time; and Laser printer: prints one page at a time. A daisy wheel printer is an example of a character printer which prints one complete character at a time. "
    },
    {
        "question": " The waste generated by end life personal computers is known as ",
        "option1": " PC-waste ",
        "option2": " Physical waste ",
        "option3": " Computer waste ",
        "option4": " E-waste",
        "answar": "4",
        "category": "computer",
        "explain": " (4) Electronic waste or E-waste is the collective term for discarded electrical or electronic devices such as computers, mobile phones, etc that enter the waste stream from various sources. E-waste contains significant concentration of substances that are highly toxic and are hazardous to human health and the environment. "
    },
    {
        "question": " Which of the following is an Disk Operating System (DOS) command ? ",
        "option1": " LIST ",
        "option2": " CHANGE ",
        "option3": " DUPLICATE ",
        "option4": " FORMAT",
        "answar": "4",
        "category": "computer",
        "explain": " (4) The most famous Disk Operating System (DOS) commands are: dir (lists the contents of a folder), format (formats the given drive), type (displays the contents of a file), etc. "
    },
    {
        "question": " A type of internet account, in which the computer is not connected directly to the net. ",
        "option1": " Shell Account ",
        "option2": " Kernel Account ",
        "option3": " Server Account ",
        "option4": " TCP/IP Account",
        "answar": "4",
        "category": "computer",
        "explain": " (4) Computers connected directly to the internet are called “Servers,” while the computers we use are “clients,” because they are not connected directly to the internet, but through an Internet Service Provider. TCP/IP is the communication protocol for the internet. TCP/IP defines the rule computers must follow to communicate with each other over the internet.TCP provides a communication service at an intermediate level between an application program and the Internet Protocol (IP). "
    },
    {
        "question": " A computer programming language often used by children is ",
        "option1": " LOGO ",
        "option2": " PILOT ",
        "option3": " BASIC ",
        "option4": " JAVA",
        "answar": "1",
        "category": "computer",
        "explain": " (1) LOGO is a computer programming language used for functional programming, and is used for generating basic shapes using a turtle cursor. It was developed for children experimenting their first programming steps. It guides kids step by step with the basics of computers programming. "
    },
    {
        "question": " A portable, personal computer small enough to fit on your lap is called a ",
        "option1": " Note-book computer ",
        "option2": " PDA ",
        "option3": " Mainframe computer ",
        "option4": " Workstation",
        "answar": "1",
        "category": "computer",
        "explain": " (1) Laptops are also sometimes called notebook computers or notebooks. They are portable personal computer with a clamshell form factor, suitable for mobile use. Other terms, such as ultrabooks or netbooks, refer to specific types of laptop / notebook. "
    },
    {
        "question": " Assembler is a program that translates the program from ",
        "option1": " high-level to assembly ",
        "option2": " assembly to machine ",
        "option3": " machine to low-level ",
        "option4": " low-level to high-level",
        "answar": "2",
        "category": "computer",
        "explain": " (2) Assembler is a computer program which is used to translate program written in Assembly Language in to machine language. The translated program is called as object program. "
    },
    {
        "question": " Identify the DBMS among the following. ",
        "option1": " MS-Access ",
        "option2": " MS-Power Point ",
        "option3": " PL/SQL ",
        "option4": " MS-Excel",
        "answar": "3",
        "category": "computer",
        "explain": " (3) A general-purpose database management system (DBMS) is a software system designed to allow the definition, creation, querying, update, and administration of databases. Well-known DBMSs include MySQL, Microsoft SQL Server, Oracle, SAP, etc. PL/SQL (Procedural Language/Structured Query Language) is Oracle Corporation’s procedural language extension for SQL and the Oracle relational database. "
    },
    {
        "question": " The database in which records are organised in a tree-like structure is ",
        "option1": " Network database ",
        "option2": " Hierarchical database ",
        "option3": " Relational database ",
        "option4": " Object-oriented database",
        "answar": "2",
        "category": "computer",
        "explain": " (2) A hierarchical database model is a data model in which the data is organized into a tree-like structure. The structure allows representing information using parent/child relationships: each parent can have many children, but each child has only one parent. "
    },
    {
        "question": " A collection of pictures that can be inserted into documents is called : ",
        "option1": " Photo Shop ",
        "option2": " Auto Shapes ",
        "option3": " Word Art ",
        "option4": " Clip Art",
        "answar": "4",
        "category": "computer",
        "explain": " (4) Clip art, in the graphic arts, refers to pre-made images used to illustrate any medium. Today, clip art is used extensively in both personal and commercial projects, ranging from home-printed greeting cards to commercial candles. Clip art comes in many forms, both electronic and printed. However, most clip art today is created, distributed, and used in an electronic form. COMPUTER & IT SGAE–1044 "
    },
    {
        "question": " What did the first electronic digital computer contain ? ",
        "option1": " Transistors ",
        "option2": " Valves ",
        "option3": " Core memory ",
        "option4": " Semiconductor memory",
        "answar": "2",
        "category": "computer",
        "explain": " (2) The Atanasoff–Berry Computer (ABC) was the world’s first electronic digital computer, albeit not programmable. Atanasoff is considered to be one of the fathers of the computer. In late 1939, John Atanasoff teamed up with Clifford Berry to build a prototype. They created the first computing machine to use electricity, vacuum tubes, binary numbers and capacitors. The capacitors were in a rotating drum that held the electrical charge for the memory. The final product was the size of a desk, weighed 700 pounds, had over 300 vacuum tubes, and contained a mile of wire. "
    },
    {
        "question": " The term PC means : ",
        "option1": " Private Computer ",
        "option2": " Personal Calculator ",
        "option3": " Professional Calculator ",
        "option4": " Personal Computer",
        "answar": "2",
        "category": "computer",
        "explain": " (2) A personal computer (PC) is a digital computer designed for use by only one person at a time. A typical personal computer assemblage consists of a central processing unit (CPU) two types of computer memory and various input/output devices, including a display screen, keyboard and mouse, modem, and printer."
    },
    {
        "question": " By default, to run an application through mouse, which one of the following has to be done ? ",
        "option1": " Right click ",
        "option2": " Left click ",
        "option3": " Single click ",
        "option4": " Double dick",
        "answar": "4",
        "category": "computer",
        "explain": " (4) By default on most operating systems, for a person to execute a certain software function, he or she will have to click on the left button twice in quick succession. this is known as double-clicking. An example of this can be a person clicking on an icon. "
    },
    {
        "question": " One kilobit is equal to_______ bits ",
        "option1": " 512 ",
        "option2": " 1000 ",
        "option3": " 1024 ",
        "option4": " 1042",
        "answar": "3",
        "category": "computer",
        "explain": " (3) The kilobit is a multiple of the unit bit for digital information or computer storage. The prefix kilo (symbol k) is defined in the International System of Units (SI) as a multiplier of 103  (1 thousand), and therefore, 1 kilobit = 103 bits = 1000bits. However, computers are binary or base 2, as in ones and zeros. So instead of counting by tens, they count by 2s. So instead of 1,10,100,1000 it is 1,2,4,8,16,32,64,128,256, 512, 1024. "
    },
    {
        "question": " To find and load a file that has been saved on a computer, which of the given options is used ? ",
        "option1": " Select the close command ",
        "option2": " Select the new command ",
        "option3": " Select the save command ",
        "option4": " Select the open command",
        "answar": "4",
        "category": "computer",
        "explain": " (4) The Open command is used to find and load a file that has been saved on a computer. "
    },
    {
        "question": " Dot Matrix Printers, when compared to Laser Printers are ",
        "option1": " Quieter ",
        "option2": " Faster ",
        "option3": " Less expensive ",
        "option4": " More expensive",
        "answar": "3",
        "category": "computer",
        "explain": " (3) A dot matrix printer is a printer which uses dots to print letter and even pictures. They can only print one color. The advantages of using them are: low purchase cost, can handle multipart forms, cheap to operate, just new ribbons, rugged and low repair cost and the paper is completely connected. This allows to print long banners that span across several sheets of paper. "
    },
    {
        "question": " CRM in the context of software applications means. ",
        "option1": " Customer’s Relatives Meet ",
        "option2": " Channel Route Market ",
        "option3": " Customer Relationship Management ",
        "option4": " Customer Retention Manager",
        "answar": "3",
        "category": "computer",
        "explain": " (3) Customer relationship management (CRM) is a model for managing a company’s interactions with current and future customers. It involves using technology to organize, automate, and synchronize sales, marketing, customer service, and technical support. "
    },
    {
        "question": " A Supercomputer would be used for which one of the following applications ? ",
        "option1": " Business Computing ",
        "option2": " Desktop Publishing ",
        "option3": " Weather Forecasting ",
        "option4": " Computer Aided Designing",
        "answar": "3",
        "category": "computer",
        "explain": " (3) A supercomputer is used for processing of information on quantum mechanics, large scale weather forecasting, molecular studies, polymer research, to solve mathematical problems, wind tunnel research, and chemical composition. Meteorologists use them to do research on the climate and global warming. It was first created in 1960. "
    },
    {
        "question": " How many types of recipients are there in an e-mail system? ",
        "option1": " Three ",
        "option2": " Four ",
        "option3": " One ",
        "option4": " Two",
        "answar": "1",
        "category": "computer",
        "explain": " (1) Electronic mail, most commonly referred to as email, is a method of exchanging digital messages from an author to one or more recipients. Normally, there could be three types of recipients: the target recipient; a carbon copy (Cc) recipients; and blind carbon copy (Bcc) recipients. "
    },
    {
        "question": " Which one of the following is used as secondary storage system in computer ? ",
        "option1": " RAM ",
        "option2": " Floppy ",
        "option3": " EPROM ",
        "option4": " ROM",
        "answar": "2",
        "category": "computer",
        "explain": " (2) Secondary storage, sometimes called auxiliary storage, is all data storage that is not currently in a computer's primary storage or memory. In a personal computer, secondary storage typically consists of storage on the hard disk and on any removable media, if present, such as a CD or DVD, flash memory, floppy disks, magnetic tape, paper tape, punched cards, standalone RAM disks, and Iomega Zip drives. "
    },
    {
        "question": " The UNIX operating system is suitable for : ",
        "option1": " Multi user ",
        "option2": " Real-Time Processing ",
        "option3": " Distributed Processing ",
        "option4": " Single user",
        "answar": "1",
        "category": "computer",
        "explain": " (1) UNIX is a popular multi-user, multitasking operating system developed at Bell Labs in the early 1970s. Created by just a handful of programmers, UNIX was designed to be a small, flexible system used exclusively by programmers. It was designed to be portable, multi-tasking and multi-user in a timesharing configuration. "
    },
    {
        "question": " The ‘IBM-DOS’ is a ",
        "option1": " Single user operating system ",
        "option2": " Multiuser operating system ",
        "option3": " Batch operating system ",
        "option4": " Time-sharing operating system",
        "answar": "1",
        "category": "computer",
        "explain": " (1) Alternatively referred to as PC DOS, IBM DOS is a text-based operating system similar to Microsoft’s DOS, but only sold by IBM. DOS is a single-user, single-tasking operating system with basic kernel functions that are non-reentrant: only one program at a time can use them and DOS itself has no functionality to allow more than one program to execute at a time. "
    },
    {
        "question": " The new technology which is emerging in the field of computer is ",
        "option1": " IC-technology ",
        "option2": " Parallel processing system ",
        "option3": " Semiconductor technology ",
        "option4": " Transistor technology",
        "answar": "4",
        "category": "computer",
        "explain": " (4) Transistor technology is the new buzzword in the computer world. Replacing silicon transistors with carbon nanotubes could make any electronic device — smartphones, laptops, tablets and supercomputers — smaller and more powerful using less energy than those built using silicon-based transistors. Scientists at Stanford University, in September 2013, announced to have built the first functioning computer that used only carbon nanotube transistors. "
    },
    {
        "question": " Which is not an extension of a picture file on a computer ? ",
        "option1": " .jpeg ",
        "option2": " .png ",
        "option3": " .gif ",
        "option4": " .mdb",
        "answar": "4",
        "category": "computer",
        "explain": " (4) The most common image file formats, the most important for cameras, printing, scanning, and internet use, are JPG, TIF, PNG, and GIF. In computing, .mdb file-extension is used in certain versions of Microsoft Access databases. "
    },
    {
        "question": " Which measure of memory is the largest ? ",
        "option1": " MB Megabyte ",
        "option2": " GB Gigabyte ",
        "option3": " TB Terabyte ",
        "option4": " KB Kilobyte",
        "answar": "3",
        "category": "computer",
        "explain": " (3) The terabyte is a multiple of the unit byte for digital information. 1 TB = 1012bytes = 1073741824 Kilobyte = 1048576 MB = 103 gigabytes "
    },
    {
        "question": " The term used to describe a person who spends plenty of time online exploring the Internet is ",
        "option1": " Netaddict ",
        "option2": " Netguru ",
        "option3": " Cybernaut ",
        "option4": " Cyberphile",
        "answar": "1",
        "category": "computer",
        "explain": " (1) Cyberphile refers to a person who loves computers, internet and electronic gadgets. However, net addict is the correct word for a person who spends plenty of time online exploring the Internet. Internet addiction is a serious condition for parents and families. "
    },
    {
        "question": " The secondmost used language on the world wide web is ",
        "option1": " German ",
        "option2": " Franch ",
        "option3": " Chinese ",
        "option4": " English",
        "answar": "3",
        "category": "computer",
        "explain": " (3) According to the Internet World Stats, the top languages in the internet as on June 30, 2010 were English, Chinese, Spanish, Japanese and Portuguese. "
    },
    {
        "question": " Different computers are connected to a LAN by a cable and a ",
        "option1": " modem ",
        "option2": " interface card ",
        "option3": " special wires ",
        "option4": " telephone lines",
        "answar": "2",
        "category": "computer",
        "explain": " (2) A Network Interface Card (NIC) is a device that allows computers to be joined together in a network, typically a Local Area Network (LAN). The network interface card acts as an interpreter, allowing the machine to both send and receive data on a LAN. Information Technology (IT) specialists often use these cards to setup wired or wireless networks. COMPUTER & IT SGAE–1045 "
    },
    {
        "question": " Which one of the following was the top exporter company of software in 2001 in India ? ",
        "option1": " Infosys ",
        "option2": " TCS ",
        "option3": " Sun ",
        "option4": " Wipro",
        "answar": "2",
        "category": "computer",
        "explain": " (2) Tata Consultancy Services emerged the country’s No. 1 software exporter in 2001-02 with an export earning of Rs. 3,882 crore. Infosys occupied the second position with Rs. 2,553 crore while Wipro was the third-largest software exporter with export revenue of Rs. 2,298 crore. "
    },
    {
        "question": " Which one of the following converts assembly language into machine language ? ",
        "option1": " Algorithm ",
        "option2": " Interpreter ",
        "option3": " Compiler ",
        "option4": " Assembler",
        "answar": "4",
        "category": "computer",
        "explain": " (4) Assembly language is converted into executable machine code by a utility program referred to as an assembler. The conversion process is referred to as assembly, or assembling the code. "
    },
    {
        "question": " How many bytes are equal to one kilobyte ? ",
        "option1": " 1050 ",
        "option2": " 1000 ",
        "option3": " 976 ",
        "option4": " 1024",
        "answar": "4",
        "category": "computer",
        "explain": " (4) The kilobyte is a multiple of the unit byte for digital information. It refers to either 1024 (210) bytes or 1000 (103 ) bytes, dependent upon context, in the fields of computer science and information technology. "
    },
    {
        "question": " Which application in Microsoft Office is feasible for preparing presentations ? ",
        "option1": " Microsoft Excel ",
        "option2": " Microsoft Word ",
        "option3": " Microsoft Power Point ",
        "option4": " Microsoft Publishers",
        "answar": "3",
        "category": "computer",
        "explain": " (3) Microsoft PowerPoint is a slide show presentation program developed by Microsoft. It was officially launched on May 22, 1990, as a part of the Microsoft Office suite. "
    },
    {
        "question": " The language which was used to build Internet Pages in the beginning of Internet Technology is ",
        "option1": " XML ",
        "option2": " HTML ",
        "option3": " DHTML ",
        "option4": " ASP",
        "answar": "2",
        "category": "computer",
        "explain": " (2) Initially released in 1993, HTML or HyperText Markup Language is the standard markup language used to create web pages. The first important extension to HTML itself was called Dynamic HTML (DHTML). Active Server Pages (ASP) was released in 1996; XML was also started in the same year. "
    },
    {
        "question": " The most advanced form Of Read Only Memory (ROM) is ",
        "option1": " PROM ",
        "option2": " RAM ",
        "option3": " Cache Memory ",
        "option4": " EEPROM",
        "answar": "4",
        "category": "computer",
        "explain": " (4) EEPROM (Electrically Erasable Programmable Read-Only Memory) is a special type of non-volatile memory used in computers to store small amounts of data that must be saved when power is removed, e.g., calibration tables or device configuration. "
    },
    {
        "question": " A computer program that translates one program instruction one at a time into machine language is called a/an ",
        "option1": " Interpreter ",
        "option2": " Compiler ",
        "option3": " Simulator ",
        "option4": " Commander",
        "answar": "1",
        "category": "computer",
        "explain": " (1) An interpreter translates one instruction at a time, and then executes that instruction immediately. It directly executes, i.e. performs, instructions written in a programming or scripting language, without previously compiling them into a machine language program. "
    },
    {
        "question": " An aspect of Input/Output controller of data logic is called ",
        "option1": " General Buffering ",
        "option2": " Zero Buffering ",
        "option3": " Buffering ",
        "option4": " Data Buffering",
        "answar": "3",
        "category": "computer",
        "explain": " (3) I/O is the process of transferring data between a program and an external device. A buffer is a temporary storage location for data while the data is being transferred."
    },
    {
        "question": " What does BIOS stand for ? ",
        "option1": " Basic Internal Output System ",
        "option2": " Basic Intra Operating System ",
        "option3": " Basic Internal Organ System ",
        "option4": " Basic Input Outpur System",
        "answar": "4",
        "category": "computer",
        "explain": " (4) In IBM PC compatible computers, the Basic Input/Output System (BIOS), is the de facto standard defining a firmware interface. The name originated from the Basic Input/Output System used in the CP/ M operating system in 1975. "
    },
    {
        "question": " The process of combining strings is known as ",
        "option1": " compiling ",
        "option2": " Combining ",
        "option3": " Attaching ",
        "option4": " Concatenation",
        "answar": "4",
        "category": "computer",
        "explain": " (4) Concatenation is the process of appending one string to the end of another string. When we concatenate string literals or string constants by using the + operator, the compiler creates a single string. No run time concatenation occurs. However, string variables can be concatenated only at run time. "
    },
    {
        "question": " Which component is mainly responsible for doing calculation in computer ? ",
        "option1": " Random access memory ",
        "option2": " Control unit ",
        "option3": " Arithmetic logic unit ",
        "option4": " Hard disk",
        "answar": "3",
        "category": "computer",
        "explain": " (3) An arithmetic-logic unit (ALU) is the part of a computer processor (CPU) that carries out arithmetic and logic operations on the operands in computer instruction words. It performs all arithmetic computations, such as addition and multiplication, and all comparison operations. "
    },
    {
        "question": " Hard copies can be obtained from ",
        "option1": " Scanner ",
        "option2": " Speaker ",
        "option3": " Printer ",
        "option4": " Recorder",
        "answar": "3",
        "category": "computer",
        "explain": " (3) A hard copy is a printed copy of information from a computer. Sometimes referred to as a printout, a hard copy is so-called because it exists as a physical object. The same information, viewed on a computer display or sent as an e-mail attachment, is referred to as a soft copy. "
    },
    {
        "question": " Telnet stands for ",
        "option1": " Telephone Network ",
        "option2": " Television Network ",
        "option3": " Teletype Network ",
        "option4": " Telefax Network",
        "answar": "1",
        "category": "computer",
        "explain": " (1) TELNET stands for TELephone NETwork. Telnet is a network protocol used on the Internet or local area networks to provide a bidirectional interactive text-oriented communication facility using a virtual terminal connection. "
    },
    {
        "question": " What is the full form of ALU ? ",
        "option1": " Alternative Logic Unit ",
        "option2": " Arithmetic Logic Unit ",
        "option3": " Arithmetic Least Unit ",
        "option4": " Arithmetic Local Unit",
        "answar": "2",
        "category": "computer",
        "explain": " (2) ALU stands for arithmetic-logic unit which is the part of a computer processor (CPU) that carries out arithmetic and logic operations on the operands in computer instruction words. It is a fundamental building block of the central processing unit found in digital computers. "
    },
    {
        "question": " The popular search engine “Google” derives its name from the word “Googol”. What does the word mean ? ",
        "option1": " To search ",
        "option2": " To index ",
        "option3": " To crawl ",
        "option4": " The numeral one followed by a hundred zeros",
        "answar": "4",
        "category": "computer",
        "explain": " (4) Google derived its name from the word “googol”, a term coined by then nine-year-old Milton Sirotta, nephew of the American mathematician Edward Kasner. The story goes, Kasner had asked his nephew to invent a name for a very large number - ten to the power of one hundred (the numeral one followed by 100 zeros), and Milton called it a googol. "
    },
    {
        "question": " The time between program input and output is called ",
        "option1": " Turn around time ",
        "option2": " Waiting time ",
        "option3": " Execution time ",
        "option4": " Delay time",
        "answar": "1",
        "category": "computer",
        "explain": " (1) System management is designed to balance processing and input/output, with the aim of providing reasonable minimum turnaround and maximum throughput. Turnaround is the amount of time elapsing between a request to the computer to execute a program or input and the availability of output. "
    },
    {
        "question": " Which of the following devices is generally used to check multiple choice questions ? ",
        "option1": " OCR ",
        "option2": " OMR ",
        "option3": " MICR ",
        "option4": " Bar Code Reader",
        "answar": "2",
        "category": "computer",
        "explain": " (2) Optical Mark Reader (OMR) is a special type of optical scanner used to recognize the type of mark made by pen or pencil. It is used where one out of a few alternatives is to be selected and marked. It is specially used for checking the answer sheets of examinations having multiple choice questions. "
    },
    {
        "question": " The section of the CPU that selects, interprects and monitors the execution of program instructions is ",
        "option1": " Memory ",
        "option2": " Register ",
        "option3": " Control unit ",
        "option4": " ALU",
        "answar": "3",
        "category": "computer",
        "explain": " (3) The Control Unit, considered as the “Central nervous System” of computer, obtains the instructions from the memory, interprets them and directs the operation of the computer. It selects, interprets and monitors the execution of the program instructions by generating the timing and control signals. "
    },
    {
        "question": " Who among the following introduced the world’s first laptop computer in the market ? ",
        "option1": " Hewlett - Packard ",
        "option2": " Epson ",
        "option3": " Laplink travelling software Inc ",
        "option4": " Microsoft",
        "answar": "2",
        "category": "computer",
        "explain": " (2) The Epson HX-20 (also known as the HC-20) is generally regarded as the first laptop computer, announced in November 1981, although first sold widely in 1983. It was hailed by Business Week magazine as the “fourth revolution in personal computing”. "
    },
    {
        "question": " Fifth Generation Computers are ",
        "option1": " Data Processors ",
        "option2": " Knowledge Processors ",
        "option3": " Sound waves ",
        "option4": " Ultrasonic waves",
        "answar": "2",
        "category": "computer",
        "explain": " (2) Fifth generation computing devices, based on artificial intelligence, make use of parallel processing and superconductors. Built around the concepts of logic programming, they will be applicable to knowledge information processing systems. The goal of the fifth generation is to develop the device which could respond to natural language input and are capable of learning and self-organization. "
    },
    {
        "question": " The Indian Supercomputer built by CRL, Pune which ranked fourth fastest in the world and most powerful in Asia is called ",
        "option1": " Virgo ",
        "option2": " Param ",
        "option3": " EKA ",
        "option4": " SAGA",
        "answar": "3",
        "category": "computer",
        "explain": " (3) EKA (the Sanskrit name for number one) was ranked fourth fastest supercomputer in the world in November 2007. It was built by the supercomputer facility at Computational Research Laboratories (CRL), a wholly owned subsidiary of Tata Sons, in Pune. A Hewlett-Packard Cluster Platform 3000 BL460c system, EKA uses nearly 1,800 computing nodes and has a peak performance of 170 teraflops. COMPUTER & IT SGAE–1046 "
    },
    {
        "question": " In the field of internet, www stands for ",
        "option1": " world wide wrestling ",
        "option2": " world wide web ",
        "option3": " world wide wordstar ",
        "option4": " world without wrestling",
        "answar": "2",
        "category": "computer",
        "explain": " (2) www stands for the World Wide Web which is a system of Internet servers that support specially formatted documents. The documents are formatted in a markup language called HTML (HyperText Markup Language) that supports links to other documents, as well as graphics, audio, and video files. "
    },
    {
        "question": " Which application is used for accessing the information on internet ? ",
        "option1": " operating system ",
        "option2": " web browzer ",
        "option3": " microsoft word ",
        "option4": " system software",
        "answar": "2",
        "category": "computer",
        "explain": " (2) A web browser is a software application for accessing information resources on the World Wide Web. An information resource is identified by a Uniform Resource Identifier (URL). The major web browsers are Firefox, Internet Explorer, Google Chrome, Opera, etc. "
    },
    {
        "question": " In a computer system, which device is functionally opposite of a Key-board ? ",
        "option1": " Trackball ",
        "option2": " Joystick ",
        "option3": " Mouse ",
        "option4": " Printer",
        "answar": "4",
        "category": "computer",
        "explain": " (4) In a Computer System, Printer is functionally Opposite of a Keyboard. A keyboard is the most common input device that comprises a set of typewriterlike keys used to enter data into a computer. On the contrary, a printer is an output device capable of printing text and graphics on a paper. Printers convert processed data from a combination of electronic impulses into a printed form called hard copy. "
    },
    {
        "question": " RAM is used as a short memory in a computer because it: ",
        "option1": " Is volatile ",
        "option2": " Is programmable ",
        "option3": " Has less capacity ",
        "option4": " Is very expensive",
        "answar": "1",
        "category": "computer",
        "explain": " (1) Random-Access Memory (RAM) is a type of short memory because it is volatile. The stored information is lost if power is removed. All RAM except the CMOS RAM used for the BIOS is volatile. ROM, on the other hand, is nonvolatile. RAM is the most common type of memory found in computers and other devices, such as printers. "
    },
    {
        "question": " DTP stands for ",
        "option1": " Digital Transmission Protocol ",
        "option2": " Desktop Publishing ",
        "option3": " Data Type Programming ",
        "option4": " Document Type Processing",
        "answar": "2",
        "category": "computer",
        "explain": " (2) Desktop publishing (abbreviated DTP) is the creation of documents using page layout skills on a personal computer. This technology allows individuals, businesses, and other organizations to self-publish a wide range of printed matter. "
    },
    {
        "question": " Which of the following is used as a primary memory of computer ? ",
        "option1": " Optical storge device ",
        "option2": " Magnetic storage device ",
        "option3": " RAM ",
        "option4": " Magneto-Optical storage device",
        "answar": "3",
        "category": "computer",
        "explain": " (3) Primary storage, also known as main storage or memory, is the area in a computer in which data is stored for quick access by the computer’s processor. The terms random access memory (RAM) and memory are often as synonyms for primary or main storage. "
    },
    {
        "question": " What is used to identify whether a data word has an odd or even number of 1’s ? ",
        "option1": " Carry bit ",
        "option2": " Sign bit ",
        "option3": " Zero bit ",
        "option4": " Parity bit",
        "answar": "4",
        "category": "computer",
        "explain": " (4) Parity bit is a term used to identify whether a data word has an odd or even number of 1’s. If a data word contains an odd number of 1’s, the word is said to have odd parity. The binary word 0110111 with five 1’s has odd parity. The binary word 0110000 has an even number of 1’s (two), so it has even parity. "
    },
    {
        "question": " Rearranging and allocating space in memory to provide for multiple computing tasks is called ",
        "option1": " Networking ",
        "option2": " Multiprogramming ",
        "option3": " Multitasking ",
        "option4": " Memory Management",
        "answar": "4",
        "category": "computer",
        "explain": " (4) Memory management provides ways to dynamically allocate portions of memory to programs at their request, and free it for reuse when no longer needed. It enables the allocation of additional memory space or release of unwanted space at run time for optimizing the use of storage space. It provides flexibility in adding, deleting or rearranging data items at run time."
    },
    {
        "question": " The father of computer is ",
        "option1": " Oliver Twist ",
        "option2": " Charles Dickens ",
        "option3": " Charles Babbage ",
        "option4": " Love Lice",
        "answar": "3",
        "category": "computer",
        "explain": " (3) Charles Babbage was considered to be the father of computing after his invention and concept of the Analytical Engine in 1837. Babbage is credited with inventing the first mechanical computer that eventually led to more complex designs. He was an English polymath. "
    },
    {
        "question": " PSW stands for ",
        "option1": " Program status word ",
        "option2": " Processor status word ",
        "option3": " Process status word ",
        "option4": " Primitive status word",
        "answar": "1",
        "category": "computer",
        "explain": " (1) PSW stands for Program Status Word. It is an IBM System/360 architecture and successors control register which performs the function of a Status register and Program counter in other architectures, and more. It contains status bits that reflect the current CPU state. "
    },
    {
        "question": " The technology used in the electronic printer is called ",
        "option1": " Micro array ",
        "option2": " Micro millimetric ",
        "option3": " Micro technology ",
        "option4": " Micro encapsulation",
        "answar": "4",
        "category": "computer",
        "explain": " (4) Micro encapsulation is one of the several technologies used in Electronic printing. It is widely used in “carbonless” carbon paper and “scratch-and-sniff” cologne and perfume advertisements in magazines. This technology involves the usage of millions of transparent fluid-filled capsules containing microscopic particles (Chemistry By Steven Zumdahl, Susan Zumdahl, p. 488). "
    },
    {
        "question": " Which of the following is in the ascending order of Data hierarchy? ",
        "option1": " Byte–Bit–File–Record–Database–Field ",
        "option2": " Field–Byte–Bit–Record–File– Database ",
        "option3": " Bit–Byte–Record–Field–Database–File ",
        "option4": " Bit–Byte–Field–Record–File– Database",
        "answar": "4",
        "category": "computer",
        "explain": " (4) Data is organized in a data storage hierarchy of increasingly complex levels: bits, bytes (characters), fields, records, files, and databases. Data are logically organized into: l Bits (characters): - a bit is the smallest unit of data representation (0 or 1); l Byte: a unit of digital information that most commonly consists of 8 bits; l Field: a field consists of a grouping of characters; l Record: record consists of fields, with each field describing an attribute of the entity; l File: a group of related records; l Database: an integrated collection of logically related records or files. "
    },
    {
        "question": " A computer executes programs in the sequence of : ",
        "option1": " Execute, Fetch, Decode ",
        "option2": " Store, Fetch, Execute ",
        "option3": " Fetch, Decode, Execute ",
        "option4": " Decode, Fetch, Execute",
        "answar": "3",
        "category": "computer",
        "explain": " (3) Fetch-Decode-Execute Cycle is the basic operation cycle of a computer. It is the process by which a computer retrieves a program instruction from its memory (fetch), determines what actions the instruction requires (decode), and carries out those actions (execute). It is repeated continuously by the central processing unit, from boot up to when the computer is shut down. "
    },
    {
        "question": " The two specific heats of gases are related by : ",
        "option1": " Cp + Cv = RJ ",
        "option2": " Cp –Cv = R/J ",
        "option3": " Cp – Cv = RJ ",
        "option4": " Cp /Cv = R",
        "answar": "2",
        "category": "computer",
        "explain": " (2) There are two specific heats of gases- Specific Heat at Constant Pressure (Cp ) and Specific Heat at Constant Volume (Cv ). Heat supplied at constant pressure is used up in two ways: (a) for doing work in expansion and (b) for raising the temperature by 1o C, while at constant volume heat supplied is used only for rise of temperature. Therefore, Cp  is always greater than Cv . They are related as: Cp -Cv  = R/J. This relation is called Mayer’s Relation. "
    },
    {
        "question": " In a Database Managemnt System (DBMS), the content and the location of the data is defined by the ____. ",
        "option1": " Multi Dimensional data ",
        "option2": " Sequence data ",
        "option3": " Meta data ",
        "option4": " Sub data",
        "answar": "3",
        "category": "computer",
        "explain": " (3) In a Database Management System (DBMS), the content and the location of the data is defined by the Metadata. Metadata is “data about data”. It assists in resource discovery by allowing resources to be found by relevant criteria, identifying resources, bringing similar resources together, distinguishing dissimilar resources, and giving location information. "
    },
    {
        "question": " What is the speciality of WINDOWS–NT? ",
        "option1": " supports real–time processing ",
        "option2": " supports LAN and WAN ",
        "option3": " supports Batch processing ",
        "option4": " supports multi–processing",
        "answar": "4",
        "category": "computer",
        "explain": " (4) Windows NT is designed for multi-processor systems. It supports symmetrical multiprocessing which enables multiple microprocessors to be productive at all times, increasing overall system throughout and taking advantage of available processing power. Multiprocessing enables multiple tasks or applications to run in parallel on different microprocessors. Personal workstations are designed to operate with more than one microprocessor in order to take advantage of the multiprocessing capabilities of Windows NT (The GIS Book by G.B. Corte) COMPUTER & IT SGAE–1047 "
    },
    {
        "question": " After ‘PROM’ is programmed, we can only ____ the information. ",
        "option1": " read ",
        "option2": " write ",
        "option3": " read and write ",
        "option4": " remove",
        "answar": "1",
        "category": "computer",
        "explain": " (1) PROM (Programmable Read-Only Memory) is a memory chip on which data can be written only once. Once it is programmed, data is permanent and it cannot be erased. The information is stored permanently in the memory cell. We can only read that data but cannot write data on it. "
    },
    {
        "question": " ROM stands for ",
        "option1": " Real Office Manager ",
        "option2": " Read Only Memory ",
        "option3": " Read Only Memorandum ",
        "option4": " Role On Memory",
        "answar": "2",
        "category": "computer",
        "explain": " (2) ROM stands for Read-Only Memory. It is a type of computer memory on which data has been prerecorded. Once data has been written onto a ROM chip, it cannot be removed and can only be read. Unlike main memory (RAM), ROM retains its contents even when the computer is turned off. ROM is referred to as nonvolatile, whereas RAM is volatile. "
    },
    {
        "question": " The term ‘URL’ used in Internet technology stands for : ",
        "option1": " Uniform Resource Locater ",
        "option2": " Unique Resource Locater ",
        "option3": " Uniform Remote Locater ",
        "option4": " Unique Remote Locater",
        "answar": "1",
        "category": "computer",
        "explain": " (1) URL is an acronym for Uniform Resource Locator. Commonly referred to as a web address, URL is a reference to a web resource that specifies its location on a computer network and a mechanism for retrieving it. "
    },
    {
        "question": " Which of the following memories must be refreshed many times per second? ",
        "option1": " ROM ",
        "option2": " Dyanamic RAM ",
        "option3": " EPROM ",
        "option4": " Static RAM",
        "answar": "2",
        "category": "computer",
        "explain": " (2) Dynamic Random Access Memory (DRAM), the most common kind of Random Access Memory (RAM) for Personal computers and workstations, has to be refreshed many times per second in order to hold its data contents. DRAM is dynamic in that, unlike static RAM (SRAM), it needs to have its storage cells refreshed or given a new electronic charge every few milliseconds. DRAM stores each bit in a storage cell consisting of a capacitor and a transistor. Capacitors tend to lose their charge rather quickly thus, the need for recharging. "
    },
    {
        "question": " Which one of the following is odd? ",
        "option1": " IMAP ",
        "option2": " POP ",
        "option3": " SNMP ",
        "option4": " SMTP",
        "answar": "3",
        "category": "computer",
        "explain": " (3) IMAP (Internet Message Access Protocol) and POP (Post Office Protocol) are the two most prevailing methods or protocols for retrieving email from a mail server. Both of these protocols are supported by almost all popular mail client programs like Outlook, Thunderbird and Apple Mail. Similarly, Simple Mail Transfer Protocol (SMTP) is an Internet standard for electronic mail (email) transmission. However, Simple Network Management Protocol (SNMP) is an “Internet-standard protocol for managing devices on IP networks”. Devices that typically support SNMP include routers, switches, servers, workstations, printers, modem racks and more. SNMP is widely used in network management systems to monitor networkattached devices for conditions that warrant administrative attention. "
    },
    {
        "question": " USB is _____ type of storage device. ",
        "option1": " Auxillary ",
        "option2": " Primary ",
        "option3": " Secondary ",
        "option4": " Tertiary",
        "answar": "3",
        "category": "computer",
        "explain": " (3) The question has more than one option correct: secondary storage is also known as auxiliary storage or external storage. USB (memory stick) Flash Drive is a secondary data storage device that includes flash memory with an integrated USB interface. USB flash drives are typically removable and rewritable, and physically much smaller than an optical disc. They are often used for the same purposes, for which floppy disks or CDs were used, i.e., for storage, data back-up and transfer of computer files. "
    },
    {
        "question": " The fastest, costlier and relatively small form of storage managed by computer system hardware is : ",
        "option1": " Disk ",
        "option2": " Flash Memory ",
        "option3": " Main memory ",
        "option4": " Cache",
        "answar": "4",
        "category": "computer",
        "explain": " (4) Cache memory, also called CPU memory, is random access memory (RAM) that a computer microprocessor can access more quickly than it can access regular RAM. Cache is the fastest and most costly form of storage. For example, Level 1 (L1) cache is extremely fast but relatively small, and is usually embedded in the processor chip (CPU). Cache memory is volatile and managed by the computer system hardware. "
    },
    {
        "question": " All forms of ROM are also known as _____. ",
        "option1": " Freeware ",
        "option2": " Middleware ",
        "option3": " Firmware ",
        "option4": " Shareware",
        "answar": "3",
        "category": "computer",
        "explain": " (3) As the name suggests, read-only memory, or ROM, stores information that can only be read. It contains the basic instructions for what needs to happen when a computer is powered on. This is typically referred to as the firmware of a computer. The firmware represents the basic code to get the computer started. Once the computer is up and running, the CPU takes over. Firmware is also referred to as BIOS, or basic input/output system. "
    },
    {
        "question": " The Simplest CPU – scheduling algorithm is ______. ",
        "option1": " SJF scheduling algorithm ",
        "option2": " Round robin scheduling algorith ",
        "option3": " Multilevel scheduling algorithm ",
        "option4": " FCFS scheduling algorithm",
        "answar": "4",
        "category": "computer",
        "explain": " (4) First-Come, First-Served (FCFS) Scheduling is the simplest CPU scheduling algorithm. It is like customers waiting in line at the bank or the post office or at a copying machine. Under it, the process that requests the CPU first is allocated the CPU first. However, the average waiting time under FCFS is long. "
    },
    {
        "question": " Which type of switching is used in Internet? ",
        "option1": " Circuit ",
        "option2": " Telephone ",
        "option3": " Packet ",
        "option4": " Telex",
        "answar": "3",
        "category": "computer",
        "explain": " (3) Packet switching is the dividing of messages into packets before they are sent, transmitting each packet individually, and then reassembling them into the original message once all of them have arrived at the intended destination. Packets are the fundamental unit of information transport in internet that uses the datagram packet switching method. Most modern Wide Area Network protocols, including TCP/IP, are based on packet-switching technologies. "
    },
    {
        "question": " Breaking physical memory into fixed-sized bloclcs called as: ",
        "option1": " Packets ",
        "option2": " Page ",
        "option3": " Frames ",
        "option4": " Segments",
        "answar": "3",
        "category": "computer",
        "explain": " (3) The basic method for implementing paging involves breaking physical memory into fixed-sized blocks called frames and breaking logical memory into blocks of the same size called pages. When a process is to be executed, its pages are loaded into any available memory frames from the backing store. The backing store is divided into fixed-sized blocks that are of the same size as the memory frames. "
    },
    {
        "question": " Network of a series of vertical and horizontal lines constructed perpendicular to each other is known as: ",
        "option1": " Grid system ",
        "option2": " Latitudes ",
        "option3": " Geographic coordinates ",
        "option4": " Longitude",
        "answar": "1",
        "category": "computer",
        "explain": " (1) A grid is a network or a series or vertical and horizontal lines constructed perpendicular to each other. One series or lines runs from east to west and the other from north to south. Together they form squares of same dimensions within a given map. Each of the line forming the squares is given a value so that the position of an object on a map can be easily identified. "
    },
    {
        "question": " In operationg system, Round Robin Scheduling means : ",
        "option1": " A kind of scheduling ",
        "option2": " Repetition policy ",
        "option3": " A memory allocation policy ",
        "option4": " A process allocation policy",
        "answar": "1",
        "category": "computer",
        "explain": " (1) Round robin is the scheduling algorithm used by the CPU during execution of the process . Round robin is designed specifically for time sharing systems . It is similar to first come first serve scheduling algorithm but the preemption is the added functionality to switch between the processes"
    },
    {
        "question": " FORTRAN is called : ",
        "option1": " Formula Translator ",
        "option2": " Format Translator ",
        "option3": " File Translator ",
        "option4": " Floppy Translator",
        "category": "computer",
        "answar": "1",
        "explain": "234."
    },
    {
        "question": " The process of arranging data in logical sequence is called ",
        "option1": " Classifying ",
        "option2": " Reproducing ",
        "option3": " Summarizing ",
        "option4": " Sorting",
        "category": "computer",
        "answar": "4",
        "explain": "Fortran is a general-purpose, imperative program-\nming language that is especially suited to numeric\ncomputation and scientific computing. Its name is a\ncontraction of FORmula TRANslation. It aims to pro-\nvide a way to tell computers to calculate complicated\nmathematical expressions, with more ease than as-\nsembly language.\n235. "
    },
    {
        "question": " The term GIGO is related to ",
        "option1": " Flexibility ",
        "option2": " Versatility ",
        "option3": " Automatic ",
        "option4": " Accuracy",
        "category": "computer",
        "answar": "4",
        "explain": " In the field of computing, the process of arranging\ndata in a logical sequence is called sorting. It is a\nprocedure that accepts a random sequence of num-\nbers or any other data which can be arranged in a\ndefinite logical sequence as input. It arranges data\nitems in a logical sequence-alphabetical, numerical,\netc-by record key.\n236. "
    },
    {
        "question": " Which of the following computer memories is non-volatile ? ",
        "option1": " DRAM ",
        "option2": " SRAM ",
        "option3": " ROM ",
        "option4": " RAM",
        "category": "computer",
        "answar": "3",
        "explain": " Garbage in, garbage out (GIGO), in the context of\ninformation technology, is a slang expression that\nmeans regardless of how accurate a program’s logic\nis, the results will be incorrect if the input is invalid.\nA program gives inaccurate results due to inaccurate\ndata provided because a computer will always attempt\nto process data given to it. So GIGO is related to\naccuracy of output which, in turn’ is dependent on\nthe accuracy of inputs.\n237. "
    },
    {
        "question": " In present day computing, which code is used and is accepted worldwide? ",
        "option1": " ASCII ",
        "option2": " Hollerith Code ",
        "option3": " EBCDIC ",
        "option4": " ISCII",
        "category": "computer",
        "answar": "1",
        "explain": " Read-only memory (ROM) is a form of data stor-\nage in computers and other electronic devices that\nis non-volatile. Its contents are retained even when\nthe device is powered off. Other examples of non-\nvolatile memory include flash memory, ferroelectric\nRAM (F-RAM), hard disk drives, floppy disks, etc.\n238. "
    },
    {
        "question": " Which of the following is not an operating system ? ",
        "option1": " Android ",
        "option2": " Vista ",
        "option3": " iOS ",
        "option4": " Opera",
        "category": "computer",
        "answar": "4",
        "explain": " American Standard Code for Information Inter-\nchange (ASCII) is the predominant character set en-\ncoding of present-day computers. ASCII codes rep-\nresent text in computers, telecommunications equip-\nment, and other devices. Most modern character-\nencoding schemes are based on ASCII, although they\nsupport many additional characters.\n339. "
    },
    {
        "question": " Which of the following is used to protect objects in comput- er system, in the absence of mo re com plete protection schemes? ",
        "option1": " digital certificate ",
        "option2": " digital signature ",
        "option3": " passwords ",
        "option4": " tokens",
        "category": "computer",
        "answar": "3",
        "explain": " Opera is a web browser for Windows, macOS,\nand Linux operating systems. It is developed by Op-\nera Software. As of November 2016, the browser was\nowned by a Chinese group of investors under the\nname Golden Brick Capital Private Equity Fund I Lim-\nited Partnership.\n240. "
    },
    {
        "question": " What is the full form of PDA? ",
        "option1": " Personal Digital Assistant ",
        "option2": " Personal Data Addition ",
        "option3": " Personal Digital Addition ",
        "option4": " Peripheral Digital Assistant",
        "category": "computer",
        "answar": "1",
        "explain": " Passwords are often used to protect objects in the\ncomputer system, in the absence of more complete\nprotection schemes. They can be considered a spe-\ncial case of either keys or capabilities. Passwords are\nthe most common approach to authenticating a user\nidentity.\n241. "
    },
    {
        "question": " Communication satellites are used to: ",
        "option1": " To transmit communica- tion signals ",
        "option2": " To receive and redirect com- munication signals ",
        "option3": " To only receive communi- cation signal ",
        "option4": " To provide information of national sources only",
        "category": "computer",
        "answar": "2",
        "explain": " The acronym PDA stands for Personal Digital As-\nsistant. Also known as a handheld PC, or personal\ndata assistant, it is a mobile device that functions as\na personal information manager. The term evolved\nfrom Personal Desktop Assistant, an application that\nprompts or prods the user of a computer with sug-\ngestions or provides quick reference to contacts and\nother lists.\n242. "
    },
    {
        "question": " What is MS DOS? ",
        "option1": " Multipurpose System Digi- tal Offline Sign ",
        "option2": " Microsoft Disk Operating System ",
        "option3": " Multi System Disk Operat- ing System ",
        "option4": " Microchip Sign Digital Sys- tem",
        "category": "computer",
        "answar": "2",
        "explain": " A communications satellite works like a relay sta-\ntion: signals transmitted by the ground stations are\npicked up by the satellite’s receiver antennas, the\nsignals are filtered, their frequency changed and am-\nplified, and then routed via the transmit antennas\nback down to Earth. The redirected signals are re-\nceived by ground stations, also called earth stations\nand further processed to extract the base band sig-\nnals.\nSGAE–1048\n& IT\n243. "
    },
    {
        "question": " Which of the following is used for very high speed searching applications ? ",
        "option1": " Flash Memory ",
        "option2": " Content-addressable Mem- ory ",
        "option3": " Dynamic Random Access Memory ",
        "option4": " Static Random Access Memory",
        "category": "computer",
        "answar": "2",
        "explain": " MS-DOS stands for Microsoft Disk Operating Sys-\ntem. It is a discontinued operating system for x86-\nbased personal computers mostly developed by Mi-\ncrosoft. It was the main operating system for IBM PC\ncompatible personal computers during the 1980s and\n1990s.\n244. "
    },
    {
        "question": " Which of the following com- mands is called as three-fin- ger salute in computers ? ",
        "option1": " Ctrl + Alt + Delete ",
        "option2": " Ctrl + Shift + Escape ",
        "option3": " Ctrl + Shift + Enter ",
        "option4": " Ctrl + Alt + Arrow key",
        "category": "computer",
        "answar": "1",
        "explain": " Content-addressable memory (CAM) is a special\ntype of computer memory used in certain very-high-\nspeed searching applications. It is also known as as-\nsociative memory. It compares input search data (tag)\nagainst a table of stored data, and returns the ad-\ndress of matching data (or in the case of associative\nmemory, the matching data).\n245. "
    },
    {
        "question": " Data in database at a particular point of time is called as: ",
        "option1": " Intension ",
        "option2": " Extension ",
        "option3": " Back up ",
        "option4": " Application",
        "category": "computer",
        "answar": "2",
        "explain": " The three-finger salute refers to the original PC-\ncompatible system command to reboot or restart a\ncomputer by pressing three keys simultaneously:\nControl, Alt and Delete. The three-key combination of\nControl-Alt-Delete is specifically designed to be im-\npossible to execute with one hand in order to avoid\nthe potential for accidental reboots. It was developed\nby David Bradley.\n246. "
    },
    {
        "question": " In computer science, data haz- ard occurs when ",
        "option1": " pipeline changes the order of read/write access to oper- ands ",
        "option2": " performance loss ",
        "option3": " machine size is limited ",
        "option4": " some functional unit is not fully pipelined",
        "category": "computer",
        "answar": "1",
        "explain": " The overall design or description of the database\nis known as database schema or intension of the da-\ntabase, and is specified while designing the database.\nThe data in the database at a particular point of time\nis known as database instance of database state or\nsnapshot. The database state is also called extension\nof the schema.\n247. "
    },
    {
        "question": " Cancellation of thread occurs only when it reaches a : ",
        "option1": " Cancellation point",
        "option2": " Error point ",
        "option3": " Virtual point ",
        "option4": " Target point",
        "category": "computer",
        "answar": "1",
        "explain": " A major effect of pipelining is to change the rela-\ntive timing of instructions by overlapping their execu-\ntion. This introduces data and control hazards. Data\nhazards occur when the pipeline changes the order\nof read/write accesses to operands so that the order\ndiffers from the order seen by sequentially executing\ninstructions on the unpipelined machine.\n248. "
    },
    {
        "question": " A _____ is a computer, appli- ance, or router that sits be- tween the trusted and untrust- ed systems. ",
        "option1": " bridge ",
        "option2": " switch ",
        "option3": " firewall ",
        "option4": " hub",
        "category": "computer",
        "answar": "3",
        "explain": " Invoking thread cancellation requests cancellation,\nbut actual cancellation depends on thread state. Can-\ncellation only occurs when thread reaches cancella-\ntion point which happens only when cancellation is\nenabled. At the cancellation point, the cancellation\nrequest is acted upon and the thread to be terminat-\ned is allowed to perform application-specific cleanup\nprocessing.\n249. "
    },
    {
        "question": " What is the brain of the com- puter called? ",
        "option1": " CPU ",
        "option2": " Motherboard ",
        "option3": " HDD ",
        "option4": " Hardware",
        "category": "computer",
        "answar": "1",
        "explain": " Firewall is a computer appliance or router that\nsits between the trusted and untrusted systems. It\nenables a computer to be connected safely to an un-\ntrustworthy network. It is a network security system\nthat monitors and controls the incoming and outgoing\nnetwork traffic based on predetermined security rules.\n250. "
    },
    {
        "question": " How many bits are equal to one byte? ",
        "option1": " 8 ",
        "option2": " 10 ",
        "option3": " 12 ",
        "option4": " 14",
        "category": "computer",
        "answar": "1",
        "explain": " The CPU (Central Processing Unit) is commonly\nreferred to as the “brains” of a computer since it car-\nries out the instructions of a computer program by\nperforming the basic arithmetic, logical, control and\ninput/output (I/O) operations specified by the instruc-\ntions. The CPU is also known as the processor or\nmicroprocessor.\n251. "
    },
    {
        "question": " Processors contain a control unit and a/an: ",
        "option1": " Expansion slot ",
        "option2": " Port ",
        "option3": " Arithmetic logic unit (ALU) ",
        "option4": " CD drive",
        "category": "computer",
        "answar": "3",
        "explain": " The byte is a unit of digital information that most\ncommonly consists of eight bits. Computer storage is\nusually measured in byte multiples. For example, an\n820 MB hard drive holds a nominal 820 million bytes\n- or megabytes - of data.\n252. "
    },
    {
        "question": " Which of the following was used as circuitry for first generation of computers? ",
        "option1": " Vacuum tube ",
        "option2": " Transistors ",
        "option3": " Integrated circuits ",
        "option4": " Microprocessors",
        "category": "computer",
        "answar": "1",
        "explain": " Principal components of a processor (CPU) include\nthe arithmetic logic unit (ALU) that performs arith-\nmetic and logic operations, processor registers that\nsupply operands to the ALU and store the results of\nALU operations, and a control unit that fetches in-\nstructions from memory and “executes” them by di-\nrecting the coordinated operations of the ALU, regis-\nters and other components.\n253. "
    },
    {
        "question": " Which among the following is the name given to the cursor for the computer language ‘LOGO’? ",
        "option1": " Robot ",
        "option2": " Frog ",
        "option3": " Spider ",
        "option4": " Turtle",
        "category": "computer",
        "answar": "4",
        "explain": " The computers of first generation (1946-1959) used\nvacuum tubes as the basic components for memory\nand circuitry for CPUand magnetic drums for memo-\nry. These computers relied on machine language, the\nlowest-level programming language understood by\ncomputers, to perform operations.\n254. "
    },
    {
        "question": " Which of the following are val- id phases of a computer virus? ",
        "option1": " Only Triggering, Executing ",
        "option2": " Only Propagation, Execut- ing ",
        "option3": " Only Dormant, Propaga- tion, Triggering, Executing ",
        "option4": " Only Dormant, Propaga- tion, Triggering",
        "category": "computer",
        "answar": "3",
        "explain": " LOGO is a computer programming language used\nfor functional programming. It is used for generating\nbasic shapes using a turtle cursor. The turtle cursor\nis an on-screen cursor, which can be given movement\nand drawing instructions, and is used to\nprogrammatically produce line graphics.\n255."
    },
    {
        "question": " In IT, means that the data avail- able in the database is both ac- curate and consistent. ",
        "option1": " Data Security ",
        "option2": " Data Availability ",
        "option3": " Data Binding ",
        "option4": " Data Integrity",
        "category": "computer",
        "answar": "4",
        "explain": " The valid phases of a virus are: Dormant phase -\nPropagation phase - Triggering phase - Execution\nphase.\nl Dormant phase: The virus is idle. The virus will\neventually be activated by some event);\nl Propagation phase: The virus places an identical copy\nof itself into other programs or into certain system\nareas on the disk. Each infected program will now\ncontain a clone of the virus, which will itself enter a\npropagation phase;\nl Triggering phase: The virus is activated to perform\nthe function for which it was intended. Can be caused\nby a variety of system events;\nl Execution phase: The goal of the virus software is\nperformed\n256. "
    },
    {
        "question": " The first computer made avail- able for commercial use was ",
        "option1": " MANIAC ",
        "option2": " ENIAC ",
        "option3": " UNIVAC ",
        "option4": " EDSAC",
        "category": "computer",
        "answar": "3",
        "explain": " Data integrity is the maintenance of, and the as-\nsurance of the accuracy and consistency of, data over\nits entire life-cycle. It is a critical aspect to the de-\nsign, implementation and usage of any system which\nstores, processes, or retrieves data. Data integrity is\nthe opposite of data corruption, which is a form of\ndata loss.\nSGAE–1049\n& IT\n257. "
    },
    {
        "question": " What is the name of a memo- ry buffer used to accommo- date a speed differential ? ",
        "option1": " Cache ",
        "option2": " Stack Pointer ",
        "option3": " Accumulator ",
        "option4": " Disc",
        "category": "computer",
        "answar": "1",
        "explain": " The UNIVAC I (UNIVersal Automatic Computer I)\nwas the first commercial computer produced in the\nUnited States. It was designed principally by J. Pre-\nsper Eckert and John Mauchly, the inventors of the\nENIAC. It was the first computer designed for busi-\nness and administrative use with fast execution of\nrelatively simple arithmetic and data transport oper-\nations, as opposed to the complex numerical calcula-\ntions required of scientific computers.\n258. "
    },
    {
        "question": " Which is not an external stor- age device ? ",
        "option1": " CD - ROM ",
        "option2": " DVD-ROM ",
        "option3": " Pen Drive ",
        "option4": " RAM",
        "category": "computer",
        "answar": "4",
        "explain": " The memory buffer used to accommodate a speed\ndifferential is called cache. It is a hardware or soft-\nware component that stores data so future requests\nfor that data can be served faster. Cache serves to\nadd fast memory between the CPU and main memo-\nry.\n259. "
    },
    {
        "question": " In Networks, WEP stands for ",
        "option1": " Wireless Equivalent Privacy ",
        "option2": " Wired Extra Privacy ",
        "option3": " Wired Equivalent Privacy ",
        "option4": " Wireless Embedded Privacy",
        "category": "computer",
        "answar": "3",
        "explain": " Random Access Memory (RAM) is an example of\ninternal storage. Commonly called “memory,” it is con-\nsidered primary storage, since it stores data that is\ndirectly accessible by the computer’s CPU. RAM is a\nhigh-speed storage medium that can be accessed with\nminimal delays.\n260. "
    },
    {
        "question": " In IT terminology failure in the kernel is called as ",
        "option1": " Crash ",
        "option2": " C r a s h dump ",
        "option3": " Dump ",
        "option4": " Kernel error",
        "category": "computer",
        "answar": "1",
        "explain": " WEP stands for Wired Equivalent Privacy. It is a\nsecurity algorithm for IEEE 802.11 wireless networks.\nIntroduced as part of the original 802.11 standard\nratified in 1997, its intention was to provide data con-\nfidentiality comparable to that of a traditional wired\nnetwork. It was superseded by Wi-Fi Protected Ac-\ncess (WPA) in 2003.\n261. "
    },
    {
        "question": " A __________ is an agreement between the communicating parties on how communica- tion is to proceed. ",
        "option1": " Path ",
        "option2": " SLA ",
        "option3": " Bond ",
        "option4": " Protocol",
        "category": "computer",
        "answar": "4",
        "explain": " The kernel (also called nucleus) is a computer pro-\ngram that constitutes the central core of a comput-\ner’s operating system. It is the first program loaded\non startup, and then manages the remainder of the\nstartup, as well as input/output requests from soft-\nware, translating them into data processing instruc-\ntions for the central processing unit. Its failure is\ncalled crash.\n262. "
    },
    {
        "question": " The complete form of ‘IC’ in electronics is ",
        "option1": " Internal circuit ",
        "option2": " Independent circuit ",
        "option3": " Integrated circuit ",
        "option4": " Inbuilt circuit",
        "category": "computer",
        "answar": "3",
        "explain": " In information technology, a protocol is an agree-\nment between the communicating parties on how com-\nmunication is to proceed. Violating the protocol makes\ncommunication more difficult, if not impossible. A\nprotocol is the specialist set of rules that end points\nin a telecommunication connection.\n263. "
    },
    {
        "question": " In computer processing, ______ selects processes from the pool and loads them into memory for execution. ",
        "option1": " Job Scheduler ",
        "option2": " Resource Scheduler ",
        "option3": " CPU Scheduler ",
        "option4": " Process Scheduler",
        "category": "computer",
        "answar": "1",
        "explain": " IC stands for Integrated Circuit. It is a set of elec-\ntronic circuits on one small plate (“chip”) of semicon-\nductor material, normally silicon. Also known as chip\nor microchip, ICs are the heart and brains of most\ncircuits and are are a keystone of modern electron-\nics.\n264. "
    },
    {
        "question": " The UNIX operating system is suitable for ",
        "option1": " Multi user ",
        "option2": " Real-Time Processing ",
        "option3": " Distributed Processing ",
        "option4": " Single user",
        "category": "computer",
        "answar": "1",
        "explain": " A job scheduler, also known as long term schedul-\ner, determines which programs are admitted to the\nsystem for processing. It selects processes from the\nqueue and loads them into memory for execution.\nProcess loads into the memory for CPU scheduling.\n265. "
    },
    {
        "question": " In IT networking, which of the following device is used in phys- ical layer? ",
        "option1": " Repeater ",
        "option2": " Router ",
        "option3": " Transport Gateway ",
        "option4": " Bridge",
        "category": "computer",
        "answar": "1",
        "explain": " Unix is a family of multitasking, multiuser com-\nputer operating systems that derive from the original\nAT&T Unix, developed in the 1970s at the Bell Labs.\nIt provides separate logins for each user and sepa-\nrate storage space. Most importantly it supports sep-\narate security for users and groups.\n266. "
    },
    {
        "question": " In IT, associative memory is called as ",
        "option1": " Virtual memory ",
        "option2": " Cache memory ",
        "option3": " Content addressable memo- ry ",
        "option4": " Main memory",
        "category": "computer",
        "answar": "3",
        "explain": " In the seven-layer OSI model of computer net-\nworking, the physical layer or layer 1 is the first and\nlowest layer. Devices that operate at the physical lay-\ner include repeaters, hubs, network interface cards\n(NICs), cables and connectors. Repeaters are used to\nregenerate electrical signals that have attenuated (i.e.,\nweakened) as a result of distance.\n267. "
    },
    {
        "question": " In networks, a small message used to pass between one sta- tion to another is known as ",
        "option1": " Token ",
        "option2": " Byte ",
        "option3": " Word ",
        "option4": " Ring",
        "category": "computer",
        "answar": "1",
        "explain": " Associative memory in computer organization is\nwhen memory is accessed through content rather\nthanthrough a specific address. Associative memory\nis also known as associative storage, associative array\nor content-addressable memory, or CAM. Associative\nmemory is found on a computer hard drive and used\nonly in specific high-speed searching applications.\n268. "
    },
    {
        "question": " In the following list of devices which device is used in net- work layer? ",
        "option1": " Repeaters ",
        "option2": " Router ",
        "option3": " Application Gateway ",
        "option4": " Switch",
        "category": "computer",
        "answar": "2",
        "explain": " Token is an efficient form of message passing fre-\nquently used in ring networks. It consists of a very\nshort message that circulates around the ring in a\nlogical direction when devices are idle. To transmit,\nthe device must seize the token. Token provides fair\naccess for all stations, and eliminates the collisions\nof contention-based access methods.\n269. "
    },
    {
        "question": " Which of the following is not a weighted code? ",
        "option1": " Excess 3-Code ",
        "option2": " Binary Number System ",
        "option3": " Decimal Number System ",
        "option4": " BCD Number System",
        "category": "computer",
        "answar": "1",
        "explain": " The third-lowest layer of the OSI Reference Model\nis the network layer. It is responsible for packet for-\nwarding including routing through intermediate\nrouters.Routers forward data packets between com-\nputer networks. A data packet is forwarded from one\nrouter to another through the networks that consti-\ntute the internetwork until it reaches its destination\nnode.\n270. "
    },
    {
        "question": " Related to computers, what is ‘Wetware’ ? ",
        "option1": " Computer programs ",
        "option2": " Circuitory ",
        "option3": " Human brain ",
        "option4": " Chemical storage devices",
        "category": "computer",
        "answar": "3",
        "explain": " The weighted codes are those that obey the posi-\ntion weighting principle, which states that the posi-\ntion of each number represent a specific weight. In\nweighted codes, each digit is assigned a specific weight\naccording to its position. Non-weighted or un-weight-\ned codes are those codes in which the digit value\ndoes not depend upon their position i.e., each digit\nposition within the number is not assigned fixed val-\nue. Examples of non-weighted codes are: Un-weight-\ned BCD code, Excess-3 code and gray code.\n271. "
    },
    {
        "question": " In IT, the method for updating the main memory as soon as a word is removed from the cache is called ",
        "option1": " Write – through ",
        "option2": " Write – back ",
        "option3": " Protected – write ",
        "option4": " Cache – write",
        "category": "computer",
        "answar": "2",
        "explain": " Wetware is a term drawn from the computer-re-\nlated idea of hardware or software, but applied to\nbiological life forms. Here the prefix “wet” is a refer-\nence to the water found in living creatures. Wetware\nis used to describe the elements equivalent to hard-\nware and software found in a person, namely the\ncentral nervous system (CNS) and the human brain.\n272. "
    },
    {
        "question": " The Network is overloaded with enormous data sent by many computers within the network. The inability of the network to deliver the data is termed as __________ . ",
        "option1": " Access control ",
        "option2": " Congestion ",
        "option3": " Error propagation ",
        "option4": " Deadlock",
        "category": "computer",
        "answar": "2",
        "explain": " The write-back method involves updating only the\ncache location and to mark it as updated with an\nassociated flag bit, often called the dirty or modified\nbit. The main memory location of the word is updated\nlater, when the block containing this marked word is\nto be removed from the cache to make room for a\nnew block. The reason for the write back method is\nthat during the time a word resides in the cache, it\nmay be updated several times.\n273. "
    },
    {
        "question": " What is ‘net neutrality’? ",
        "option1": " Internet Service Providers and governments should treat all data on the internet equally ",
        "option2": " Piracy in internet must be curbed ",
        "option3": " Internet users must give out balanced opinions in social media sites ",
        "option4": " Internet should be kept free from malware and virus",
        "category": "computer",
        "answar": "1",
        "explain": " Network congestion in data networking and queue-\ning theory is the reduced quality of service that oc-\ncurs when a network node is carrying more data than\nit can handle. Typical effects include queueing delay,\npacket loss or the blocking of new connections. Con-\ngestion occurs when bandwidth is insufficient and\nnetwork data traffic exceeds capacity.\nSGAE–1050\n& IT\n274. "
    },
    {
        "question": " In which mode can the comput- ers that are associated send frames directly to each other? ",
        "option1": " Adhoc mode ",
        "option2": " Infrastructure mode ",
        "option3": " Structured mode ",
        "option4": " Anonymous mode",
        "category": "computer",
        "answar": "1",
        "explain": " Net neutrality is the principle that Internet service\nproviders and governments should treat all data on\nthe Internet the same, not discriminating or charging\ndifferentially by user, content, website, platform, ap-\nplication, type of attached equipment, or mode of com-\nmunication. The term was coined by Columbia Uni-\nversity media law professor Tim Wu in 2003 .\n275. "
    },
    {
        "question": " _____changes each time it is in- stalled to avoid detection by an- tivirus software. ",
        "option1": " Polymorphic virus ",
        "option2": " worm ",
        "option3": " logic bomb ",
        "option4": " trojan horse",
        "category": "computer",
        "answar": "1",
        "explain": " Adhoc mode is a framework in which devices or\nstations communicate directly with each other, with-\nout the use of an Access Point (AP). Ad-hoc mode is\nalso referred to as peer-to-peer mode or an Indepen-\ndent Basic Service Set (IBSS). Ad-hoc mode is useful\nfor establishing a network where wireless infrastruc-\nture does not exist or where services are not required.\n276. "
    },
    {
        "question": " In the following list of devices, which device is used in datalink layer? ",
        "option1": " Repeaters ",
        "option2": " Routers ",
        "option3": " Application gateway ",
        "option4": " Bridge",
        "category": "computer",
        "answar": "4",
        "explain": " Polymorphic virus changes each time it is installed\nto avoid detection by antivirus software. The changes\ndo not affect the virus’ functionality but rather change\nthe virus’ signature. A virus signature is a pattern\nthat can be used to identify a virus, typically a series\nof bytes that make up the virus code.\n277. "
    },
    {
        "question": " Which algorithm is used to de- cide the path to transfer the packets from source to destina- tion? ",
        "option1": " Routing ",
        "option2": " Pathing ",
        "option3": " Selecting ",
        "option4": " Directing",
        "category": "computer",
        "answar": "1",
        "explain": " The Data Link layer is the second layer of the\nseven-layer Open Systems Interconnection (OSI) model\nof computer networking at which meaning is assigned\nto the bits that are transmitted over the network.Two\ntypes of Data Link layer devices are commonly used\non networks: bridges and switches. A bridge is an\nintelligent repeater that is aware of the MAC address-\nes of the nodes on either side of the bridge and can\nforward packets accordingly. A switch is an intelli-\ngent hub that examines the MAC address of arriving\npackets in order to determine which port to forward\nthe packet to.\n278. "
    },
    {
        "question": " Which mechanism is used by the computer virus ‘worm’ to dupli- cate itself? ",
        "option1": " Swap ",
        "option2": " Increment ",
        "option3": " Spawn ",
        "option4": " Swarm",
        "category": "computer",
        "answar": "3",
        "explain": " In order to transfer packets from a sending host\nto the destination host, the network layer must de-\ntermine the path that the packets are to follow. Rout-\ning is the process by which systems decide where to\nsend a packet. It directs network packets from their\nsource toward their destination through intermediate\nnetwork nodes by specific packet forwarding mecha-\nnisms.\n279. "
    },
    {
        "question": " Which of the following uses the spawn mechanism to duplicate itself ? ",
        "option1": " Trojan horse ",
        "option2": " Worm ",
        "option3": " Keystroke logger ",
        "option4": " Logic bomb",
        "category": "computer",
        "answar": "2",
        "explain": " After a virus worm enters computer system, the\noperating system (OS) creates single thread for the\nworm’s execution. Next, the worm spawns or creates\nanother process that is an exact duplicate of the orig-\ninal process. In other words, the worm makes an\nexact duplicate of itself within the computer’s memo-\nCOMPUTERry. The worm continues to duplicate itself each time\nthe OS manages the worm’s process till it paralyzes\nthe OS completely and forces it to shut down.\n280.\n "
    },
    {
        "question": " Find the “odd one out”. ",
        "option1": " Linux ",
        "option2": " Windows 98 ",
        "option3": " C++ ",
        "option4": " Windows 7",
        "category": "computer",
        "answar": "3",
        "explain": " A worm is a process that uses the spawn mecha-\nnism to clobber system performance. The worm\nspawns copies of itself, using up system resources\nand perhaps locking out system use by all other pro-\ncesses. On computer networks, worms are particu-\nlarly potent, since they may reproduce themselves\namong systems and thus shut down the entire net-\nwork. Such an event occurred in 1988 to UNIX sys-\ntems on the internet.\n281.\n "
    },
    {
        "question": " Which scheduling service is used to handle traffic with dif- ferent priorities? ",
        "option1": " Traffic management ",
        "option2": " QoS traffic scheduling ",
        "option3": " QoS Scheduler ",
        "option4": " Qos Manager",
        "category": "computer",
        "answar": "2",
        "explain": " Linux, Windows 98 and Windows 7 are examples\nof operating system, the system software that man-\nages computer hardware and software resources and\nprovides common services for computer programs. C++\nis a middle-level programming language developed by\nBjarne Stroustrup starting in 1979 at Bell Labs.\n282.\n "
    },
    {
        "question": " Which country has the largest internet users? ",
        "option1": " USA ",
        "option2": " China ",
        "option3": " India ",
        "option4": " Russia",
        "category": "computer",
        "answar": "2",
        "explain": " In the field of computer networking and other\npacket-switched telecommunication networks, Qual-\nity of Service (QoS) traffic scheduling refers to traffic\nprioritization and resource reservation control mech-\nanisms that provides different priority to different ap-\nplications, users, or data flows, and guarantees a cer-\ntain level of performance to a data flow. It is particu-\nlarly important for the transport of traffic with spe-\ncial requirements.\n283.\n "
    },
    {
        "question": " ______ involves traversing the entire file system, marking ev- erything that can be accessed. ",
        "option1": " Index pointer ",
        "option2": " Garbage collection ",
        "option3": " File system ",
        "option4": " Stack pointer",
        "category": "computer",
        "answar": "2",
        "explain": " As per the latest data of International Telecommu-\nnications Union, China had the largest number of in-\nternet users in the world (721,434,547) as of 30 June,\n2016. India comes second with 462,124,989 inter-\nnet users.\n284.\n "
    },
    {
        "question": " Programs that duplicate the func- tionality of one system on an- other system is known as ",
        "option1": " Emulators ",
        "option2": " Simulators ",
        "option3": " Evaluators ",
        "option4": " PCB",
        "category": "computer",
        "answar": "1",
        "explain": " Garbage collection involves traversing the entire\nfile system, marking everything that can be access-\ned. Then, a second pass collects everything that is\nnot marked onto a list of free space. Garbage collec-\ntion for a disk-based file system, however, is extremely\ntime-consuming and is thus seldom attempted. Gar-\nbage collection is necessary only because of possible\ncycles in the graph.\n285.\n "
    },
    {
        "question": " Money transfer through mobile is called __________. ",
        "option1": " IFSC ",
        "option2": " ATM ",
        "option3": " IMPS ",
        "option4": " IFS",
        "category": "computer",
        "answar": "3",
        "explain": " In computing, an emulator is hardware or soft-\nware that enables one computer system (called the\nhost) to behave like another computer system (called\nthe guest). An emulator typically enables the host\nsystem to run software or use peripheral devices\ndesigned for the guest system.\n286.\n "
    },
    {
        "question": " Cache memory works on the principle of __________ . ",
        "option1": " Locality of data ",
        "option2": " Locality of reference ",
        "option3": " Locality of Memory ",
        "option4": " Locality of Memory & refer- ence",
        "category": "computer",
        "answar": "2",
        "explain": " Immediate Payment Service (IMPS) is an instant in-\nterbank electronic fund transfer service through mo-\nbile phones. The customer should have sufficient ac-\ncount balance to initiate a fund transfer through this\nmethod. Unlike NEFT and RTGS, the service is avail-\nable 24×7 throughout the year including bank holidays.\n287.\n "
    },
    {
        "question": " Which circuit is used to store one bit of data ? ",
        "option1": " Register ",
        "option2": " Flip Flop ",
        "option3": " Vector ",
        "option4": " Encoder",
        "category": "computer",
        "answar": "2",
        "explain": " A cache memory works on the principle of locality\nof reference, a term for the phenomenon in which the\nsame values, or related storage locations, are frequently\naccessed, depending on the memory access pattern.\nCaching improves access time and reduces data traf-\nfic to data sources that have limited throughput.\n288.\n "
    },
    {
        "question": " C. P. U. consists of ",
        "option1": " Arithmetic and Logical unit and Register ",
        "option2": " Arithmetic and Logical unit, Register and Control unit ",
        "option3": " System unit and Memory ",
        "option4": " Hard disk and Control unit",
        "category": "computer",
        "answar": "2",
        "explain": " In electronics, a flip-flop or latch is a circuit that\nhas two stable states and can be used to store state\ninformation.A flip-flop stores a single bit (binary digit)\nof data; one of its two states represents a “one” and\nthe other represents a “zero”. Such data storage can\nbe used for storage of state, and such a circuit is\ndescribed as sequential logic. When used in a finite-\nstate machine, the output and next state depend not\nonly on its current input, but also on its current state.\n289.\n "
    },
    {
        "question": " Constantly running system pro- gram processes are known as ",
        "option1": " Daemons ",
        "option2": " Processes ",
        "option3": " Process Block ",
        "option4": " Process Control Block",
        "category": "computer",
        "answar": "1",
        "explain": " Principal components of a central processing unit\n(CPU)include the arithmetic logic unit (ALU) that per-\nforms arithmetic and logic operations, processor reg-\nisters that supply operands to the ALU and store the\nresults of ALU operations, and a control unit that\norchestrates the fetching (from memory) and execu-\ntion of instructions by directing the coordinated op-\nerations of the ALU, registers and other components.\n290.\n "
    },
    {
        "question": " In IT, the technique of delaying outgoing acknowledgements tem- porarily is known as ",
        "option1": " AR Acknowledgement ",
        "option2": " AR request ",
        "option3": " Piggybacking ",
        "option4": " Piggyframing",
        "category": "computer",
        "answar": "2",
        "explain": " In multitasking computer operating systems, a\ndaemon is a computer program that runs as a back-\nground process, rather than being under the direct\ncontrol of an interactive user. Systems often start\ndaemons at boot time and serve the function of re-\nsponding to network requests, hardware activity, or\nother programs by performing some task.\n291.\n "
    },
    {
        "question": " UDP is a ",
        "option1": " connection oriented protocol ",
        "option2": " connectionless protocol ",
        "option3": " userdefined protocol ",
        "option4": " security protocol",
        "category": "computer",
        "answar": "2",
        "explain": " The technique of temporarily delaying outgoing ac-\nknowledgements so that they can be hooked onto\nthe next outgoing data frame is known as piggyback-\ning. The principal advantage of using piggybacking\nover having distinct acknowledgement frames is a bet-\nter use of the available channel bandwidth.\n292.\n "
    },
    {
        "question": " Which of the following is the op- eration executed on data stored in registers? ",
        "option1": " Bitoperation ",
        "option2": " Macrooperation ",
        "option3": " Microoperation ",
        "option4": " Byteoperation",
        "category": "computer",
        "answar": "3",
        "explain": " User Datagram Protocol (UDP) uses a simple con-\nnectionless transmission model with a minimum of\nprotocol mechanism. It provides checksums for data\nintegrity, and port numbers for addressing different\nfunctions at the source and destination of the\ndatagram.It is an alternative communications proto-\ncol to Transmission Control Protocol (TCP) used pri-\nmarily for establishing low-latency and loss tolerating\nconnections between applications on the Internet.\n293.\n "
    },
    {
        "question": " CPU Scheduler is also known as _____ . ",
        "option1": " Job Scheduler ",
        "option2": " Resource Scheduler ",
        "option3": " Short-term Scheduler ",
        "option4": " Process Scheduler",
        "category": "computer",
        "answar": "3",
        "explain": " The operations executed on data stored in regis-\nters are called Microoperations. Microoperation is an\nelementary operation performed (during one clock\npulse), on the information stored in one or more reg-\nisters. Examples of microoperation include: shift, load,\nclear, increment, count, etc.\n294. "
    },
    {
        "question": " Which of the following statement is true? ",
        "option1": " A Primary key is also a can- didate key ",
        "option2": " Each relation has at least one foreign key ",
        "option3": " Foreign keys can’t have null values ",
        "option4": " A Primary key is also an al- ternate key",
        "category": "computer",
        "answar": "3",
        "explain": " The short-term scheduler is also known as the\nCPU scheduler. Its main objective is to increase sys-\ntem performance in accordance with the chosen set\nof criteria. It decides which of the ready, in-memory\nprocesses is to be executed after a clock interrupt,\nan I/O interrupt, an operating system call or another\nform of signal. Thus, the short-term scheduler makes\nscheduling decisions much more frequently than the\nlong-term or mid-term schedulers.\n295. "
    },
    {
        "question": " In IT the technique that is used to increase the bandwidth is ",
        "option1": " Memory Management ",
        "option2": " Memory Interleaving ",
        "option3": " Memory Intraleaving ",
        "option4": " Memory Leaving",
        "category": "computer",
        "answar": "2",
        "explain": " Primary Key is a column or a combination of col-\numns that uniquely identify a record. Only one Can-\ndidate Key can be Primary Key. For a Candidate Key\nto qualify as a Primary Key, it should be unique and\nCOMPUTERnon-null. So, basically a primary key is just one of\nthe candidate keys, which is a just a minimal super\nkey.\n296.\n "
    },
    {
        "question": " When does a Page fault occur? ",
        "option1": " There is an error in a specif- ic page ",
        "option2": " A program accesses a page not currently in main memory ",
        "option3": " A program accesses a page of main memory ",
        "option4": " A program accesses a page belonging to another pro- gram",
        "category": "computer",
        "answar": "2",
        "explain": " Interleaving is commonly used in pipelined pro-\ncessors to increase the memory bandwidth beyond\nthe bandwidth of a single memory module (or bank).\nThe performance of interleaved memory systems de-\npends on the number of banks, the bank cycle time,\nthe number of processors and the pattern of requests\ngenerated. The design of such systems involves a\nnumber of trade-offs which are dominated by the\nnature of interrelationships between these factors.\n297.\n "
    },
    {
        "question": " Cache memory acts between ",
        "option1": " CPU and RAM ",
        "option2": " CPU and ROM ",
        "option3": " RAM and ROM ",
        "option4": " CPU and Hard disk",
        "category": "computer",
        "answar": "1",
        "explain": " When the page (data) requested by a program is\nnot available in the memory, it is called as a page\nfault. It occurs when a program accesses a page that\nhas been mapped in address space, but has not been\nloaded in its main memory (RAM).This usually results\nin the application being shut down.\n298.\n "
    },
    {
        "question": " _______ is a type of computing that performs computation, stor- age and even applications as a service across a network. ",
        "option1": " Cloud Computing ",
        "option2": " Distributed Computing ",
        "option3": " Parallel Computing ",
        "option4": " Virtual Computing",
        "category": "computer",
        "answar": "1",
        "explain": " Cache memory is a very high speed semiconduc-\ntor memory which can speed up the processor or\nCPU. It acts as a buffer between the CPU and main\nmemory (RAM). It is used to hold those parts of data\nand program which are most frequently used by CPU.\nThe parts of data and programs are transferred from\ndisk to cache memory by operating system, from where\nCPU can access them.\n299.\n "
    },
    {
        "question": " WIMAX stands for ",
        "option1": " Wireless Interoperability for Microwave Access ",
        "option2": " Wired Interoperability for Microwave Access ",
        "option3": " Worldwide Interoperability for Microwave Access ",
        "option4": " Worldwide Infrastructure for Microwave Access",
        "category": "computer",
        "answar": "3",
        "explain": " Cloud computing is a type of Internet-based com-\nputing that provides shared computer processing re-\nsources and data to computers and other devices on\ndemand. It enables convenient, on-demand network\naccess to a shared pool of networks, servers, stor-\nage, applications, and services that can be rapidly\nprovisioned with minimal effort or service provider\ninteraction.\n300. "
    },
    {
        "question": " One of the common forms of rep- resenting remote sensing data as information is in the form of ",
        "option1": " Thematic Maps ",
        "option2": " Political Maps ",
        "option3": " Distribution Maps ",
        "option4": " Land use Maps",
        "category": "computer",
        "answar": "1",
        "explain": " WIMAX stands for Worldwide Interoperability for\nMicrowave Access. It is a family of wireless commu-\nnication standards based on the IEEE 802.16 set of\nstandards, which provide multiple physical layer (PHY)\nand Media Access Control (MAC) options.WiMAX is\nsometimes referred to as “Wi-Fi on steroids” and can\nbe used for broadband connections, hotspots, etc.\n301. "
    },
    {
        "question": " The unit of measurement of a word length is ",
        "option1": " Metre ",
        "option2": " Byte ",
        "option3": " Bit ",
        "option4": " Millimetre",
        "category": "computer",
        "answar": "3",
        "explain": " One of the common forms of representing remote\nsensing data as information is in the form of thematic\nmaps, by means of visual or computer\nclassification.However, thematic maps are not an end\nin themselves and are only the starting point for a\nvariety of applications to which remote sensing data\ncan be potentially used.\nSGAE–1052\n& IT\n302. "
    },
    {
        "question": " Who invented E-Mail? ",
        "option1": " Tim Berners-Lee ",
        "option2": " James Gosling ",
        "option3": " Vinton Cerf ",
        "option4": " VA Shiva Ayyadurai",
        "category": "computer",
        "answar": "1",
        "explain": " The number of bits that a computer can process at\na time in parallel is called its word length. The com-\nmonly used word lengths are: 8, 16, 32 or 64 bits. It\nis a measure of the computer power of a computer.\nFor example, when we talk of a 32-bit computer, it\nmeans that its word length is 32 bits.\n303. "
    },
    {
        "question": " Which of the following errors are identified by the compiler? ",
        "option1": " Logical Errors ",
        "option2": " Hardware Errors ",
        "option3": " Language Errors ",
        "option4": " Image Errors",
        "category": "computer",
        "answar": "4",
        "explain": " V.A. Shiva Ayyadurai, an Indian-born American\nscientist and entrepreneur, developed a computer\nprogram in 1978, which replicated the features of\nthe interoffice, inter-organizational paper mail sys-\ntem. He named his program “EMAIL”. It was the\nworld’s first full-scale electronic emulation of mail\nsystem consisting of: Inbox, Outbox, Folders, the\nMemo, Attachments, etc.The US Copyright Office is-\nsued a Certificate of Registration to him on the pro-\ngram in 1982.\n304. (*) Syntax errors or diagnostic errors are identified by\nthe compiler. These errors occur when a program\ndoes not conform to the grammar of a programming\nlanguage, and the compiler cannot compile the source\nfile.A syntax error is an error in the syntax of a se-\nquence of characters or tokens that is intended to be\nwritten in a particular programming language. Com-\nmon syntax errors include missing or misplaced ; or\n}, missing return type for a procedure, missing or\nduplicate variable declaration, type mismatch on as-\nsignment, type mismatch between actual and formal\nparameters, etc.\nLogic errors occur when a program does not do what\nthe programmer expects it to do. Since these errors\nare due to wrong logic in the program, logic errors\ncannot be identified by the compiler; they are de-\ntected only when the program is executed.\n305. "
    },
    {
        "question": " Direct access of file is also known as ",
        "option1": " random access ",
        "option2": " relative access ",
        "option3": " file access ",
        "option4": " sequential access",
        "category": "computer",
        "answar": "1",
        "explain": " In computer storage, direct access is the ability to\nobtain data from a storage device by going directly to\nwhere it is physically located on the device rather than\nby having to sequentially look for the data at one phys-\nical location after another.Direct access is also called\nrandom access, because it allows equally easy and\nfast access to any randomly selected destination.\n306. "
    },
    {
        "question": " _____ is required to boot a com- puter. ",
        "option1": " Loader ",
        "option2": " Operating system ",
        "option3": " Assembler ",
        "option4": " Compiler",
        "category": "computer",
        "answar": "2",
        "explain": " Booting is a startup sequence that starts the oper-\nating system of a computer when it is turned on. To\nboot a computer is to load an operating system into\nthe computer’s main memory or random access mem-\nory (RAM). Once the operating system is loaded, it is\nready for users to run applications.\n307. "
    },
    {
        "question": " _____ is the part of the Central Processing Unit (CPU). ",
        "option1": " Monitor ",
        "option2": " Arithmetic and Logic Unit ",
        "option3": " Keyboard ",
        "option4": " Printer",
        "category": "computer",
        "answar": "2",
        "explain": " A central processing unit (CPU), also known as\nprocessor, consists of two main components: Arith-\nmetic Logic Unit (ALU), which performs arithmetic\nand logical operations and the Control Unit (CU), which\nextracts instructions from memory and decodes and\nexecutes them, calling on the ALU when\nnecessary.ALU is a fundamental building block of CPU.\n308. "
    },
    {
        "question": " Which of the following manages the computer resources ? ",
        "option1": " Boot ",
        "option2": " Programmes ",
        "option3": " Texts ",
        "option4": " Exit",
        "category": "computer",
        "answar": "2",
        "explain": " An operating system (OS) is a set of programs that\nmanages a computer’s resources, especially the allo-\ncation of those resources among other programs. It\ndoes so by interacting with computer’s software and\nhardware. Typical resources include the central pro-\ncessing unit (CPU), computer memory, file storage,\ninput/output (I/O) devices, and network connections.\nIt establishes a user interface, and executes and pro-\nvides services for applications software."
    },
    {
        "question": "what is the size of Floppy Dis- kette which is used normally ? ",
        "option1": " 31⁄2\" ",
        "option2": " 5\" ",
        "option3": " 4\" ",
        "option4": " 3\"",
        "category": "computer",
        "answar": "1",
        "explain": " A floppy disk is a thin magnetic-coated disk con-\ntained in a flexible or semi-rigid protective jacket. Data\nis stored in tracks and sectors. The floppy disks are\nusually 3.5\" in size. However, older floppy disks may\nbe in use; these would be 5.25\" in size. Double sided\nhigh density 3.5\" disks can hold 1.44 Mb of data.\n2. "
    },
    {
        "question": " compact disc (CD) is a data storage system of the type : ",
        "option1": " Magnetic ",
        "option2": " Optical ",
        "option3": " Electrical ",
        "option4": " Electromechanical",
        "category": "computer",
        "answar": "2",
        "explain": " The Compact Disc, or CD for short, is an optical\ndisc used to store digital data. It was originally de-\nveloped to store and play back sound recordings only,\nbut the format was later adapted for storage of data\n(CD-ROM). Standard CDs have a diameter of 12 mm\n(4.7 in) and can hold up to 80 minutes of uncom-\npressed audio or 700 MB (700 × 106 bytes) of data.\nThe encoding material sits atop a thicker substrate\n(usually polycarbonate) which makes up the bulk of\nthe disc and forms a dust defocusing layer. The en-\ncoding pattern follows a continuous, spiral path cov-\nering the entire disc surface and extending from the\ninnermost track to the outermost track. The data is\nstored on the disc with a laser or stamping machine.\n3. "
    },
    {
        "question": "where is the National Institute of Excellence in the field of In- formation Technology and Allied Sciences proposed to be set up? ",
        "option1": " Bangalore ",
        "option2": " Hyderabad ",
        "option3": " Pune ",
        "option4": " Allahabad",
        "category": "computer",
        "answar": "4",
        "explain": " The Indian Institute of Information Technology\nAllahabad (IIIT-A) was established in 1999, as a cen-\nter of excellence in Information Technology and al-\nlied areas. The mission of IIIT, Allahabad is to be a\nunique and world class nucleating “Apex Center of\nExcellence” in the area of Information Technology and\nAllied Sciences, so as to enhance India’s Technolog-\nical strength in IT and for become a pace-setting in-\nstitution for other similar institutes to be established\nin the future. IIIT seeks to derive its strength from a\nlinkage with sound Indian traditions of centuries past,\nand sets out to create knowledge-based resources in\nregional languages.\n4. "
    },
    {
        "question": "which of the following circuit is used as 'Memory device' in com- puters ? ",
        "option1": " Rectifier ",
        "option2": " Flip-Flop ",
        "option3": " Comparator ",
        "option4": " Attenuator",
        "category": "computer",
        "answar": "2",
        "explain": " A flip-flop is a circuit that has two stable states\nand can be used to store state information. The cir-\ncuit can be made to change state by signals applied\nto one or more control inputs and will have one or\ntwo outputs. It is the basic storage element in se-\nquential logic. Flip-flops and latches are a fundamental\nbuilding block of digital electronics systems used in\ncomputers, communications, and many other types\nof systems.\n5. "
    },
    {
        "question": "which of the following is not a role assigned to Science and Technology Entrepreneurship Parks ? ",
        "option1": " Training ",
        "option2": " Testing and Calibration ",
        "option3": " Technology development ",
        "option4": " Raising funds for entre-pre- neurs",
        "category": "computer",
        "answar": "4",
        "explain": " The Science and Technology Entrepreneurs’ Park\n(STEP) was established at IIT Kharagpur in Dec. 1986\nwith financial support from DST New Delhi, DST West\nBengal, IDBI, IFCI, ICICI. Approval was accorded by\nDST on Aug.14, 1987.the role of training, Testing\nand Calibration and Technology development has been\nassigned to it.\n6. "
    },
    {
        "question": "which of the following is not reckoned as a ‘value added’ tele- communication service? ",
        "option1": " Electronic Mail ",
        "option2": " STD ",
        "option3": " FAX ",
        "option4": " Radio-Paging Service",
        "category": "computer",
        "answar": "3",
        "explain": " Value-added telecommunication services are tele-\ncommunications for which suppliers “add value” to\nthe customer’s information by enhancing its form or\ncontent or by providing for its storage and retrieval.\nFAX is not considered to be a Value-added telecom-\nmunication services.\n7. "
    },
    {
        "question": "the basic application of an ‘AND’ gate in computers is for: ",
        "option1": " addition ",
        "option2": " subtraction ",
        "option3": " multiplication ",
        "option4": " division",
        "category": "computer",
        "answar": "3",
        "explain": " The ‘AND’ gate in computers has basic application\nof multiplication. It has two or more inputs and one\noutput. An ‘AND’ gate produces an output of 1 if all\nthe inputs are 1 if any of the inputs is zero then it\nproduces an output of zero.\n8. "
    },
    {
        "question": "who developed the concept of e- mail ? ",
        "option1": " Bill Gates ",
        "option2": " Arthur C. Clark ",
        "option3": " Ray Tomlinson ",
        "option4": " Sabir Bhatia",
        "category": "computer",
        "answar": "3",
        "explain": " Ray Tomlinson is credited with developing the\nfirst viable e-mail program in 1971 for use on the\nARPANET. Although text messages were occasional-\nly sent over the network, Tomlinson created the first\nprogram. it is a method of exchanging digital mes-\nsages from an author to one or more recipients. Mod-\nern email operates across the Internet or other com-\nputer networks. Some early email systems required\nthat the author and the recipient both be online at\nthe same time, in common with instant messaging.\nToday’s email systems are based on a store-and-for-\nward model.\n9. "
    },
    {
        "question": "what is an organisation’s intro- ductory web page called? ",
        "option1": " Portal ",
        "option2": " Vortal ",
        "option3": " Homepage ",
        "option4": " Web site",
        "category": "computer",
        "answar": "4",
        "explain": " The introductory web page of an organisation is\ncalled website. A website (also called an Internet site)\nis a group of HTML files connected by hypertext links\nand stored on a web server, i.e. a computer that\nhosts webpages and is permanently connected to the\nInternet."
    }

]