[
   {
        "question": "The great silk-route to the Indians was opened by : ",
        "option1": " Kanishka ",
        "option2": " Ashoka ",
        "option3": " Harsha ",
        "option4": " Fa-Hien",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) The Silk Road or Silk Route is a modern term referring to a historical network of interlinking trade routes across the Afro-Eurasian landmass that connected East, South, and Western Asia with the Mediterranean and European world, as well as parts of North and East Africa. Extending 6,500 km, the Silk Road gets its name from the lucrative Chinese silk trade along it, which began during the Han Dynasty (206 BC – 220 AD). The Kushan empire incorporated Samarkand, Bokhara and Fergana, bordering on the Silk Road towns of Kashgar, Yarkand and Khotan. The main route from Central Asia into India, connecting India with the Silk Roads and the Mediterranean, ran through Gandhara. Kanishka sought to promote the thriving trade with the Silk Road centres like Kashgar and beyond, sending an envoy to Ttajan in Rome. "
    },
    {
        "question": "The rulers of which dynasty started the practice of granting tax-free villages to Brahmanas and Buddhist Monks? ",
        "option1": " Satavahanas ",
        "option2": " Mauryas ",
        "option3": " Guptas ",
        "option4": " Cholas",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) Land grants formed an important feature of the Satavahana rural administration. Inscriptions show that the Satavahanas started the practice of granting fiscal and administrative immunities to Brahmins and Buddhist monks. Earlier, the grants to individuals were temporary but later grants to religious beneficiaries were permanent. Perhaps the earliest epigraphic grant of land is found in the Nanaghat Cave Inscription of naganika, who bestowed villages (grama) on priests for officiating at Vedic sacrifices, but it does not speak of any concessions in this context. These appear first in grants made by Gautamiputra Satakarni in the first quarter of the second century A.D. INDIAN HISTORY SGAE–84 "
    },
    {
        "question": "The most important text of vedic mathematics is : ",
        "option1": " Satapatha Brahman ",
        "option2": " Atharva Veda ",
        "option3": " Sulva Sutras ",
        "option4": " Chhandogya Upanishad",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) The Shulba Sutras are sutra texts belonging to the Strauta ritual and containing geometry related to firealtar construction. They are part of the larger corpus of texts called the Shrauta Sutras, considered to be appendices to the Vedas. They are the only sources of knowledge of Indian mathematics from the Vedic period. The four major Shulba Sutras, which are mathematically the most significant, are those composed by Baudhayana, Manava, Apastamba and Katyayana. "
    },
    {
        "question": "Yavanika or curtain was introduced in Indian theatre by which of the following? ",
        "option1": " Shakas ",
        "option2": " Parthians ",
        "option3": " Greeks ",
        "option4": " Kushans",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) The most interesting term in Indian drama with Greek connotation is yavanika, which means a stage curtain. For the first time in Panini’s grammar, there is a reference to Yavana and Yavanani writing. However, the theory is not only erroneous but ridiculous because there is no curtain in the Greek drama and also there is no word “yavanika” in Sanskrit language. There is Yavani meaning Greek woman. "
    },
    {
        "question": "Who started the Saka Era which is still used by the Government of India? ",
        "option1": " Kanishka ",
        "option2": " Vikramaditya ",
        "option3": " Samudra Gupta ",
        "option4": " Asoka",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) The mightiest of the Kushan rulers in India was Kanishka. He was in power from 78 AD to 120 AD. It was Kanishka who initiated the Saka Era in 78 AD. Through inheritance and conquest, Kanishka’s kingdom covered an area extending from Bukhara (now in Uzbekistan) in the west to Patna in the Ganges Valley in the east, and from the Pamirs (now in Tajikistan) in the north to central India in the south. His capital was Purushpura (Peshawar). "
    },
    {
        "question": "What inspired the paintings of Ajanta ? ",
        "option1": " Compassionate Buddha ",
        "option2": " Radha-Krishan Leela ",
        "option3": " Jain Thirthankaras ",
        "option4": " Mahabharata encounters",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) The Ajanta Caves in Aurangabad district of Maharashtra, India are 30 rock-cut cave monuments which date from the 2nd century BCE to the 600 CE. The caves include paintings and sculptures considered to be masterpieces of Buddhist religious art (which depict the Jataka tales) as well as frescos which are reminiscent of the Sigiriya paintings in Sri Lanka. The Ajanta cave paintings depict the life of Gautam Buddha. "
    },
    {
        "question": "Who among the following was the first to invade India ? ",
        "option1": " Xerxes ",
        "option2": " Alexander ",
        "option3": " Darius-I ",
        "option4": " Seleucus",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) In about 518 BCE, the Persians invaded India. They were led by King Darius I, who conquered the Indus Valley and the area that is now the state of Punjab. Darius-I was successful in maintaining power, and his descendants continued to rule the area when he died. Darius-I also began to collect a tribute tax, and spread news of India’s many natural resources to Europe. "
    },
    {
        "question": "Which among the following is the oldest dynasty ? ",
        "option1": " Maurya ",
        "option2": " Gupta ",
        "option3": " Kushan ",
        "option4": " Kanva",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) The Maurya Empire was a geographically extensive Iron Age historical power in ancient India, ruled by the Mauryan dynasty from 321 to 185 BC. Originating from the kingdom of Magadha in the IndoGangetic plains (modern Bihar, eastern Uttar Pradesh and Bengal) in the eastern side of the Indian subcontinent, the empire had its capital city at Pataliputra (modern Patna). The Empire was founded in 322 BC by Chandragupta Maurya. The Gupta Empire was an ancient Indian empire which existed from approximately 320 to 550 CE and covered much of the Indian Subcontinent. The Kushan Empire was originally formed in the early 1st century AD under Kujula Kadphises in the territories of ancient Bactria around the Oxus River (Amu Darya), and later based near Kabul, Afghanistan. The Kanva dynasty was a Brahman dynasty founded by Vasudeva Kanva, the minister of Devabhuti, the last Sunga king in 75 BCE "
    },
    {
        "question": "With which of the following is the classic “Jivaka Chintamani” in Tamil associated ? ",
        "option1": " Jainism ",
        "option2": " Buddhism ",
        "option3": " Hinduism ",
        "option4": " Christianity",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) Jivaka Chintamani (fabulous gem) is a classical epic poem, considered one of the five great Tamil epics according to later Tamil literary tradition, the others being Manimegalai, Silappadikaram, Valayapathi and Kundalakesi. It was composed during the 10th century CE by Thiruthakka Thevar, a Jain monk. It narrates the romantic exploits of Jeevaka and throws light on arts of music and dance of the era. It is reputed to have been the model for Kamba Ramayanam. The epic is based on Sanskrit original and contains the exposition of Jain doctrines and beliefs. "
    },
    {
        "question": "Where did Lord Buddha breathe his last? ",
        "option1": " Rajgir ",
        "option2": " Bodh Gaya ",
        "option3": " Sarnath ",
        "option4": " Kushinagar",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) Kushinagar is a town and a nagar panchayat in Kushinagar district in the Indian state of Uttar Pradesh. It is an important Buddhist pilgrimage site, where Gautama Buddha is thought to have attained Parinirvana after his death. It is one of the most important four holy sites for Buddhists. At this location, near the Hiranyavati River, Gautama Buddha attained Parinirvana (or ‘Final Nirvana’) after falling ill from eating a meal of a species of mushroom, or possibly pork. "
    },
    {
        "question": "Who were the first kings to issue gold coins in India? ",
        "option1": " Mauryas ",
        "option2": " Indo-Greeks ",
        "option3": " Guptas ",
        "option4": " Kushans",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) The Indo-Greek kings were the first to issue gold coins in India and their coins were special in the sense that each king had his own distinctive coins by which he could be definitely identified. The names of at least thirty Bactrian kings are known with the help of numerous coins, and they help in the reconstruction of the history of the kings. The coins carry legends in Greek and also in Kharosthi and Brahmi."
    },
    {
        "question": "Where is Brihadeshwar Temple situated ? ",
        "option1": " Kanchi ",
        "option2": " Madurai ",
        "option3": " Shri Shailan ",
        "option4": " Tanjore",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) The Brihadeshwar Temple at Thanjavur (Tanjore) in the Indian state of Tamil Nadu, is a Hindu temple dedicated to Shiva and a brilliant example of the major heights achieved by Cholas in Tamil architecture. It is a tribute and a reflection of the power of its patron Raja Raja Chola I. It remains India’s largest temple and is one of the greatest glories of Indian architecture. The temple is part of the UNESCO World Heritage Site “Great Living Chola Temples”. "
    },
    {
        "question": "In Tamil literature the glorious books ‘Shilppadikaram and Manimekhalai’ are related to ",
        "option1": " Jainism ",
        "option2": " Buddhism ",
        "option3": " Hindusim ",
        "option4": " Christianity",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) Shilppadikaram is one of the five Great Epics according to later Tamil literary tradition, the others being Manimegalai, Civaka Cintamani, Valayapathi and Kundalakesi. The poet prince Ilango Adigal is credited with this work. He is reputed to be the brother of Senguttuvan from Chera dynasty. Ilango Adigal was a Buddhist monk and Silappadhikaram and Manimekalai are Buddhist epics. Manimekalai, a purely Buddhist work of the 3rd Sangam period in Tamil literature is the most supreme and famous among the Buddhist work done in Tamil. It is a work expounding the doctrines and propagating the values of Buddhism.It also talks about the Tamil Buddhists in the island. (Source: L. Basam Page No. 475) "
    },
    {
        "question": "Who established Mahabalipuram? ",
        "option1": " Pallava ",
        "option2": " Pandya ",
        "option3": " Chola ",
        "option4": " Chalukya",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) Mahabalipuram, derived from ‘Mamallapuram’ is the prior and colloquial name of a town in Kancheepuram district in the Indian state of Tamil Nadu, now officially called Mamallapuram. Mahabalipuram was a 7th century port city of the South Indian dynasty of the Pallavas near the city of Chennai in Tamil Nadu. The name Mamallapuram is believed to have been given after the Pallava king Narasimhavarman I, who took on the epithet Maha-malla (great wrestler), as the favourite sport of the Pallavas was wrestling. It has various historic monuments built largely between the 7th and the 9th centuries, and has been classified as a UNESCO World Heritage Site. INDIAN HISTORY SGAE–85 "
    },
    {
        "question": "The Saka era commencing from A.D. 78, was founded by ",
        "option1": " Kanishka ",
        "option2": " Asoka ",
        "option3": " Chandragupta ",
        "option4": " Vikramaditya",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) The date of Kanishka’s accession is disputed, ranging from 78 to 248. The generally accepted date of 78 is also the basis for an era presumably started by the Shakas and used in addition to the Gregorian calendar by the present-day Indian government. "
    },
    {
        "question": "Ganhadra school of art came into existence in ",
        "option1": " Hinayana sect ",
        "option2": " Mahayana sect ",
        "option3": " Vaishnava sect ",
        "option4": " Shaiva sect",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) The Gandhara school of art is mainly related to Mahayana Buddhism which encouraged image worship. The Kushan kings, particularly Kanishka, encouraged the Gandhara artists. The Gandhara sculptures have been found in the ruins of Taxila and in various ancient sites in Afghanistan and in West Pakistan. They consist mostly of the images of the Buddha and relief sculptures presenting scenes from Buddhist texts. A number of Bodhisattva figures were carved out. A figure of Gandhara shows the first sermon in the deer park and the death of the Buddha. In all these figures there is a realistic treatment of the body although it is draped. In these sculptures there is a tendency to mould the human body in a realistic manner paying great attention to accuracy and physical details particularly in the presentation of muscles, moustaches, etc. Also the representation of the thick bold fold lines forms a distinct characteristic. Thus the Gandhara sculptures offer a striking contrast to what has been discovered elsewhere in India. "
    },
    {
        "question": "Out of the following remains excavated in Indus Valley, which one indicates the commercial and economic development ? ",
        "option1": " The Pottery ",
        "option2": " Seals ",
        "option3": " The boats ",
        "option4": " The houses",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) The seals of the Indus Valley Civilization have been one of the major sources for information about the period. Apart from giving plethora of informations about the social and religious life of the period, they give insight into the economic activities. The economy of the Indus civilization was based on a highly organized agriculture, supplemented by an active commerce, probably connected to that of the ancient civilizations of Mesopotamia. Trade amongst the civilizations is suggested by the finding of hundreds of small seals, supposedly produced by the Indus peoples, at the excavation sites of ancient Mesopotamian cities that were existent around the same time. Some of the seals mention the rulers of different countries. "
    },
    {
        "question": "Who, according to the Buddhists, is believed to be the next incarnation of Gautam Buddha ? ",
        "option1": " Atreya ",
        "option2": " Maitreya ",
        "option3": " Nagarjuna ",
        "option4": " Kalki",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) Maitreya is foretold as a future Buddha of this world in Buddhist eschatology. In some Buddhist literature, such as the Amitabha Sutra and the Lotus Sutra, he or she is referred to as Ajita Bodhisattva. Maitreya is a bodhisattva who in the Buddhist tradition is to appear on Earth, achieve complete enlightenment, and teach the pure dharma. According to scriptures, Maitreya will be a successor of the historic Sakyamuni Buddha. "
    },
    {
        "question": "Who among the following were contemporaries of Kanishka ? ",
        "option1": " Kamban, Banabhatta, Asvagosha ",
        "option2": " Nagarjuna, Asvagosha, Vasumitra ",
        "option3": " Asvagosha, Kalidasa, Banabhatta ",
        "option4": " Kalidasa, Kamban, Va-sumitra",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) The eminent Buddhist writers Nagarjuna, Asvaghosha, Parsva and Vasumitra flourished at the court of Kanishka. Nagarjuna was the great exponent of Mahayana doctrine and Asvaghosha, a multifaceted personality, was known as a poet, musician, scholar and zealous Buddhist monk. Charaka, the most celebrated authority on Ayurveda was the court physician of Kanishka and Mathara, a politician of rare merit, was his minister. Vasumitra presided over the fourth Buddhist Council. "
    },
    {
        "question": "Which rulers built the Ellora temples? ",
        "option1": " Chalukya ",
        "option2": " Sunga ",
        "option3": " Rashtrakuta ",
        "option4": " Pallava",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) These religious establishments could have received royal patronage from various dynasties, even though inscriptional evidences are lacking for most of them. The only definite inscriptional evidence is that of Rashtrakuta Dantidurga (c. 753-57 A.D.) The majority of the Brahmanical establishments and the remaining Buddhist ones can be attributed to the Rashtrakuta times which indicate the religious tolerance of the contemporary period. The Jaina caves definitely postdate the Rashtrakutas as indicated by the style of execution and fragmentary inscriptions. This region was under the control of Kalyani Chalukyas and Yadavas of Deogiri (Daulatabad) during this period. "
    },
    {
        "question": "Who amongst the following also had the name ‘Devanama Piyadassi’? ",
        "option1": " Mauryan King Ashoka ",
        "option2": " Mauryan King Chandra-gupta Maurya ",
        "option3": " Gautam Buddha ",
        "option4": " Bhagwan Mahavira",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) The Edicts of Ashoka are a collection of 33 inscriptions on the Pillars of Ashoka, as well as boulders and cave walls, made by the Emperor Ashoka of the Mauryan dynasty during his reign from 269 BCE to 231 BCE. These inscriptions are dispersed throughout the areas of modern-day Bangladesh, India, Nepal and Pakistan and represent the first tangible evidence of Buddhism. In these inscriptions, Ashoka refers to himself as “Beloved of the Gods” and “King Priya-darshi.” The identification of King Priya-darshi with Ashoka was confirmed by an inscription discovered in 1915 by C. Beadon at Maski, the village in Raichur district of Karnataka. Another minor rock edict is found at the village Gujarra in Datia district of Madhya Pradesh. This also shows the Name “Asoka” in addition to usual “Devanam Piyadasi”. "
    },
    {
        "question": "The subject-matter of Ajanta Paintings pertains to ",
        "option1": " Jainism ",
        "option2": " Buddhism ",
        "option3": " Vaishnavism ",
        "option4": " Shaivism",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) The Ajanta Caves are the treasure house of delicate paintings that portray scenes from Jataka tales and from the life of Lord Buddha. Celebrated for its archaic wonder and laced with the series of carved artistry, Ajanta Cave paintings echo the quality of Indian creativity in perhaps the subtlest way. In the Ajanta wall-paintings, there is a profound modification from the art of early Buddhism. The Ajanta paintings stresses on religious romanticism with lyric quality, a reflection of the view that every aspect of life has an equal value in the spiritual sense and as an aspect of the divine. "
    },
    {
        "question": "Which of the following Craftsmanship was not practised by the Aryans ? ",
        "option1": " Pottery ",
        "option2": " Jewellery ",
        "option3": " Carpentry ",
        "option4": " Blacksmith",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) Iron was a metal unknown to the Aryans during the early Vedic age. The advent of iron is generally associated with the late or post-Vedic ages. So blacksmith did not exist during this period. "
    },
    {
        "question": "Mohammed-bin-Qasim conquered Sind in the year ",
        "option1": " 712 A.D. ",
        "option2": " 812 A.D. ",
        "option3": " 912 A.D. ",
        "option4": " 1012 A.D.",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) The Arab conquest of Sindh by Muhammad Bin Qasim in 712 AD gave the Muslims a firm foothold on the sub-continent. Qasim’s conquest of Sindh and Punjab laid the foundations of Islamic rule in the Indian subcontinent. The description of Hiuen Tsang, a Chinese historian, leaves no doubt that the social and economic restrictions inherent in the caste differentiations of Hindu society had however, gradually sapped the inner vitality of the social system and Sindh fell without much resistance before the Muslim armies. "
    },
    {
        "question": "The words “Satyameva Jayate” in the State Emblem of India were taken from ",
        "option1": " Upanishads ",
        "option2": " Sama Veda ",
        "option3": " Rig Veda ",
        "option4": " Ramayana",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) “Satyameva Jayate” (Truth Alone Triumphs) is a mantra from the ancient Indian scripture Mundaka Upanishad. Upon independence of India, it was adopted as the national motto of India. It is inscribed in Devanagari script at the base of the national emblem. The emblem and words ‘Satyameva Jayate’ are inscribed on one side of all Indian currency. The emblem is an adaptation of the Lion Capital of Asoka which was erected around 250 BC at Sarnath, near Varanasi in the north Indian state of Uttar Pradesh. "
    },
    {
        "question": "The earliest city discovered in India was ",
        "option1": " Harappa ",
        "option2": " Punjab ",
        "option3": " Mohenjo Daro ",
        "option4": " Sindh",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) The ruins of Harrappa were first described in 1842 by Charles Masson in his Narrative of Various Journeys in Balochistan, Afghanistan, and the Punjab, INDIAN HISTORY SGAE–86 where locals talked of an ancient city extending “thirteen cosses” (about 25 miles), but no archaeological interest would attach to this for nearly a century. In 1856, General Alexander Cunningham, later director general of the archeological survey of northern India, visited Harappa where the British engineers John and William Brunton were laying the East Indian Railway Company line connecting the cities of Karachi and Lahore. In 1872–75 Alexander Cunningham published the first Harappan seal (with an erroneous identification as Brahmi letters). It was half a century later, in 1912, that more Harappan seals were discovered by J. Fleet, prompting an excavation campaign under Sir John Hubert Marshall in 1921–22 and resulting in the discovery of the civilization at Harappa by Sir John Marshall, Rai Bahadur Daya Ram Sahni and Madho Sarup Vats, and at Mohenjo-daro by Rakhal Das Banerjee, E. J. H. MacKay, and Sir John Marshall. "
    },
    {
        "question": "The famous rock-cut temple of Kailasa is at ",
        "option1": " Ajanta ",
        "option2": " Badami ",
        "option3": " Mahabalipuram ",
        "option4": " Ellora",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) Kailashnath Temple is a famous temple, one of the 34 monasteries and temples, extending over more than 2 km, that were dug side by side in the wall of a high basalt cliff in the complex located at Ellora, Maharashtra, India. Of these 34 monasteries and temples, the Kailasa (cave 16) is a remarkable example of Dravidian architecture on account of its striking proportion; elaborate workmanship architectural content and sculptural ornamentation of rock-cut architecture. It is designed to recall Mount Kailash, the abode of Lord Shiva. It is a megalith carved out of one single rock. It was built in the 8th century by the Rashtrakuta king Krishna I. "
    },
    {
        "question": "Epigraphy means ",
        "option1": " The study of coins ",
        "option2": " The study of inscriptions ",
        "option3": " The study of epics ",
        "option4": " The study of geography",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) Epigraphy is the study of inscriptions on rocks, pillars, temple walls, copper plates and other writing material. It is the study of inscriptions or epigraphs as writing; it is the science of identifying graphemes, clarifying their meanings, classifying their uses according to dates and cultural contexts, and drawing conclusions about the writing and the writers. It serves as primary documentary evidence to establish legal, socio-cultural, literary, archaeological, and historical antiquity on the basis of engravings. "
    },
    {
        "question": "Which among the following has not been found in the excavation of Harappan sites ? ",
        "option1": " Drains and well ",
        "option2": " Fort ",
        "option3": " Reservoirs ",
        "option4": " Temple with Shikhar",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) Sikhara, a Sanskrit word translating literally to “mountain peak”, refers to the rising tower in the Hindu temple architecture of North India. Sikhara over the sanctum sanctorum where the presiding deity is enshrined is the most prominent and visible part of a Hindu temple of North India. Sikhara was a major feature of the medieval times. "
    },
    {
        "question": "Which among the following ‘MATH’ is related with Buddhism? ",
        "option1": " Dakhma ",
        "option2": " Chaitya ",
        "option3": " Khangah ",
        "option4": " Angeri",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) A chaitya is a Buddhist or Jain shrine including a stupa. In modern texts on Indian architecture, the term chaitya-griha is often used to denote assembly or prayer hall that houses a stupa. Chaityas were probably constructed to hold large numbers of devotees and to provide shelter for them. "
    },
    {
        "question": "Where has the world’s largest monolithic statue of Buddha been installed ? ",
        "option1": " Bamiyan ",
        "option2": " Hyderabad ",
        "option3": " Kandy ",
        "option4": " Lhasa",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) The Buddhas of Bamiyan were two 6th century monumental statues of standing buddha carved into the side of a cliff in the Bamyan valley in the Hazarajat region of central Afghanistan. They were dynamited and destroyed in March 2001 by the Taliban, on orders from leader Mullah Mohammed Omar, after the Taliban government declared that they were idols. On 8 September 2008 archeologists searching for a legendary 300-metre statue at the site of the already dynamited Buddhas announced the discovery of an unknown 19-metre (62-foot) reclining Buddha, a pose representing Buddha’s passage into nirvana "
    },
    {
        "question": "The Harappan Civilisation was discovered in the year : ",
        "option1": " 1935 ",
        "option2": " 1942 ",
        "option3": " 1901 ",
        "option4": " 1922",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) In 1872–75 Alexander Cunningham published the first Harappan seal (with an erroneous identification as Brahmi letters). It was half a century later, in 1912, that more Harappan seals were discovered by J. Fleet, prompting an excavation campaign under Sir John Hubert Marshall in 1921–22 and resulting in the discovery of the civilization at Harappa by Sir John Marshall, Rai Bahadur Daya Ram Sahni and Madho Sarup Vats, and at Mohenjo-daro by Rakhal Das Banerjee, E. J. H. MacKay, and Sir John Marshall. "
    },
    {
        "question": "The title ‘Indian Napolean’ has been attached to ",
        "option1": " Chandra Gupta Maurya ",
        "option2": " Samudragupta ",
        "option3": " Chandragupta-I ",
        "option4": " Harshavardhana",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) Samudragupta (335-375 AD) of the Gupta dynasty is known as the Napoleon of India. Historian A V Smith called him so because of his great military conquests known from the ‘Prayag Prashati’ written by his courtier and poet Harisena, who also describes him as the hero of a hundred battles. But some leading Indian historians criticise Smith and feel that Samudragupta was a far greater warrior than Napoleon, as the former never lost any battle. "
    },
    {
        "question": "The ‘Ajivikas’ were a ",
        "option1": " sect contemporary to the Buddha ",
        "option2": " breakaway branch of the Buddhists ",
        "option3": " sect founded by Charvaka ",
        "option4": " sect founded by Shankaracharya",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) Ajivika (“living” in Sanskrit) was a system of ancient Indian philosophy and an ascetic movement of the Mahajanapada period in the Indian subcontinent. Ajivika was primarily a heterodox Hindu (Nastika) or atheistic system. The Ajivikas may simply have been a more loosely-organized group of wandering ascetics (shramanas or sannyasins). One of their prominent leaders was Makkhali Gosal. Ajivikas are is thought to be contemporaneous to other early Hindu nastika philosophical schools of thought, such as Charvaka, Jainism and Buddhism, and may have preceded the latter two systems."
    },
    {
        "question": "The organic relationship between the ancient culture of the indus Valley and Hinduism of today is proved by the worship of ",
        "option1": " Pashupati, Indra and the Mother Goddess ",
        "option2": " Stones, trees and animals ",
        "option3": " Vishnu and Lakshmi ",
        "option4": " Siva and Sakti",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) There has been evidence that the people of the Indus Valley Civilization believed in some form of animal and nature worship. The figure of deities on the seals indicates that they worshipped gods and goddesses in the human form. No major sculpture survives but for a bust thought to be of a major priest and the stunning bronze dancing girl. The Divine Mother appears to have been an important goddess, due to the countless terra-cotta statues of her that were found. It follows a school of thought that would become prevalent later as well, of the female energy being regarded as the source of all creation. What is most interesting is the existence of a male god which has been identified as a proto-type of an important God of the religion of Hinduism, lord Shiv. The fact that the same God is still worshipped today, and has been for the last five thousand years is one of the remarkable features of Indian culture. Even evidence of the Bhakti cult (loving devotion to a personal God) has been found at Indus Valley Civilization sites, and the Bhakti cult also has a large following even today. It can therefore be concluded that there is a close relationship between the beliefs of the Indus Valley Civilization and that of modern Hinduism. "
    },
    {
        "question": "How was Burma (now Myanmar) known to ancient Indians ? ",
        "option1": " Malayamandalam ",
        "option2": " Yavadwipa ",
        "option3": " Suvarnabhumi ",
        "option4": " Suvarnadwipa",
        "answar": "3",
        "category": "indian history",
        "explain": "  (3) Suvarnabhumi is a Sanskrit term meaning the “Golden Land” or “Land of Gold”, coined by the ancient Indians which refers broadly to Southeast Asian region across Gulf of Bengal and Eastern Indian Ocean; Lower Burma, Lower Thailand, Lower Malay Peninsula, and Sumatra. Although it seems to cover vast region in Southeast Asia, it is generally accepted that the name Suvarnabhumi was first used to refer more specifically to Lower Burma. Another term which was used by the ancient Indians is Suvarnadvipa which means the “Golden Peninsula/Island”. Suvarnabhumi may have been used primarily as a vague general designation of an extensive region in Southeast Asia, but, over time, different parts of it came to be designated by the additional epithets of island, peninsula or city. "
    },
    {
        "question": "With whom is ‘Junagarh Rock Inscription’ associated ? ",
        "option1": " Rudradaman ",
        "option2": " Bimbisara ",
        "option3": " Chandragupta II ",
        "option4": " Gautamiputra Satakarni",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) The Junagadh rock inscription, found in Junagadh, was carved under the orders of King Rudradaman, who had obtained the title of Mahakshatrapa. He was the grandson of the famous Mahakshatrapa Chastana and was a Saka ruler from the Western Kshatrapa dynasty. The inscription is a chronicle about the rebuilding of a dam named Urjayat around the lake Sudarshana. The dam lay in the region of Saurashtra and the closest town appears to have been a place called Girinagar. It was fed by the rivers Suvarnasikata and Palasini, along with other smaller streams. The dam was originally built by Vaishya Pushyagupta who was the governor of the region under Chandragupta Maurya. Conduits from the dam were later built under orders of his grandson; Emperor Asoka. "
    },
    {
        "question": "Nalanda University was a great centre of learning, especially in ",
        "option1": " Buddhism ",
        "option2": " Jainism ",
        "option3": " Vaishnavism ",
        "option4": " Tantra",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) Nalanda was an ancient centre of higher learning in Bihar, India. It was a Buddhist centre of learning from the fifth or sixth century CE to 1197 CE. Nalanda flourished between the reign of the Sakraditya (whose identity is uncertain and who might have been either Kumara Gupta-I or Kumara Gupta-II) and 1197 CE, supported by patronage from the Hindu Gupta rulers as well as Buddhist emperors like Harsha and later emperors from the Pala Empire. "
    },
    {
        "question": "The Rathas of Mahabalipuram was built during the reign of the ",
        "option1": " Palas ",
        "option2": " Cholas ",
        "option3": " Rashtrakutas ",
        "option4": " Pallavas",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) The city of Mahabalipuram was largely developed by the Pallava king Narasimhavarman I in the 7th century AD. The mandapa or pavilions and the rathas or shrines shaped as temple chariots are hewn from the granite rock face, while the famed Shore Temple, erected half a century later, is built from dressed stone. The Pancha Rathas shrines were carved during the reign of King Mahendravarman I and his son Narasimhavarman I. The purpose of their construction is not known, structures are not completed. "
    },
    {
        "question": "Who is hailed as the “God of Medicine” by the practitioners of Ayurveda ? ",
        "option1": " Susruta ",
        "option2": " Chyavana ",
        "option3": " Dhanwantari ",
        "option4": " Charaka",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) Dhanvantri is an Avatar of Vishnu from the Hindu tradition. He appears in the Vedas and Puranas as the physician of the gods (devas), and the god of Ayurvedic medicine. It is common practice in Hinduism for worshipers to pray to Dhanvantri seeking his blessings for sound health for themselves and/or others. Dhanvantri is depicted as Vishnu with four hands, holding medical herbs in one hand and a pot containing rejuvenating nectar called amrita in another. The Puranas state that Dhanvantri emerged from the ‘Ocean of Milk’ and appeared with the pot of nectar during the story of the Samudra or Sagar manthan whilst the ocean was being churned by the devas and asuras, using the Mandara mountain and the serpent Vasuki. one who rules the Ellai (boundary). Elara is a peculiar figure in the history of Sri Lanka and one with particular resonance given the ongoing ethnic strife in the country. Although he was an invader, he is often regarded as one of Sri Lanka’s wisest and most just monarchs, as highlighted in the ancient Sinhalese chronicle Mahavamsa. 55. (2) After the Kannauj Assembly was concluded, Hiuen-Tsang was making preparations to go to his home, but Harsha invited him to attend another Assembly at Prayag which he used to hold after ever five years on the confluence of Ganga and Yamuna. Five such assemblies had already taken place and this was the sixth Assembly in which Hiuen-Tsang was invited. This ceremony was attended by the kings of eighteen kingdoms and about 5, 00,000 people including Sramanas. Hercetics, Nigranthas, the poor, the orphans etc, attended this assembly. The Prayag Assembly is a glorious example of the generosity of Harshavardhana as he gave all his personal wealth and belongings in charity during the assembly. 56. (3) The Indus Valley Civilization made sculptures mainly in stone, metal and terra-cotta. Ranging in size from slightly larger than a human thumb to almost 30 cm. (one foot) in height, the anthropomorphic and animal terracotta figurines from Harappa and other Indus Civilization sites offer a rich reflection of some of the Harappan ideas about representing life in the Bronze Age. From the terracotta figurines, we come to know that the people of Harappa domesticated animals like oxen, buffaloes, pigs, goats and sheep. Camels and asses were used as means of transport. Dogs and cats were kept as pets. The humped bull was considered a great asset in the farming community. 57. (3) Tripitaka is a traditional term used by various Buddhist sects to describe their various canons of scriptures. As the name suggests, a Tripitaka traditionally contains three “baskets” of teachings: a Sutra Pitaka (Sanskrit; Pali: Sutta Pitaka), a Vinaya Pitaka (Sanskrit & Pali) and an Abhidharma Pitaka (Sanskrit; Pali: Abhidhamma Pitaka). 58. (2) The Kushanas were great patrons of art. It was under the rule of the Kushans that principles were formed for making sculptural images, which continued to influence making of sculptures ever after. During this time, Buddha was first shown in human form (earlier he was represented by symbols like lotus and footsteps). Other Hindu and Jain deities also began to be shown in human form. Mathura and Gandhara were the two main centers of art during the time of the Kushanas. The Gandhara School of Art and the Mathura School of Art developed their own distinct styles. The Gandhara School was highly influenced by Greco-Roman philosophies and mainly concentrated on depicting the image of the Buddha and the legends associated with his life, while the Mathura School drew inspiration from local folk deities and themes from day to day life. 59. (1) Sri Gupta (240–280) was a pre-imperial Gupta king in northern India and start of the Gupta dynasty. The first evidence of Sri Gupta comes from the writings of I-tsing around 690 CE who describes that the Poona copper inscription of Prabhavati Gupta, a daughter of Chandra Gupta, describes “Maharaja Sri-Gupta” as the founder of the Gupta dynasty 60. (4) Excavations at Chanhudaro have revealed three different cultural layers from lowest to the top being Indus culture, the Jhukar culture and the Jhangar culture. The site is especially important for providing evidences about different Harappan factories. These factories produced seals, toys and bone implements. It was the only Harappan city without a citadel. 61. (1) The Third Buddhist council was convened in about 250 BCE at Asokarama in Pataliputra, supposedly under the patronage of Emperor Asoka. The traditional reason for convening the Third Buddhist Council is reported to have been to rid the Sangha of corruption and bogus monks who held heretical views. It was presided over by the Elder Moggaliputta Tissa and one thousand monks participated in the Council. 62. (4) Aristotle was a Greek philosopher and polymath, a student of Plato and teacher of Alexander the Great. Together with Plato and Socrates (Plato’s teacher), Aristotle is one of the most important founding figures in Western philosophy. Aristotle’s writings were the first to create a comprehensive system of Western philosophy, encompassing morality, aesthetics, logic, science, politics, and metaphysics. Aristotle was invited by Philip II of Macedon to become the tutor to his son Alexander in 343 BC. Aristotle was appointed as the head of the royal academy of Macedon. During that time he gave lessons not only to Alexander, but also to two other future kings: Ptolemy and Cassander. Aristotle encouraged Alexander toward eastern conquest. 63. (3) Meghadutam (cloud messenger) is a lyric poem written by Kalidasa, considered to be one of the greatest Sanskrit poets. In Sanskrit literature, the poetic conceit used in the Meghadutam spawned the genre of sandesha kavya or messenger poems, most of which are modeled on the Meghaduta (and are often written in the Meghaduta’s mandakranta metre) 64. (2) The Noble Eightfold Path is one of the principal teachings of the Buddha, who described it as the way leading to the cessation of suffering (dukkha) and the achievement of self-awakening. It is used to develop insight into the true nature of phenomena (or reality) and to eradicate greed, hatred, and delusion. The Noble Eightfold Path is the fourth of the Buddha’s Four Noble Truths; the first element of the Noble Eightfold Path is, in turn, an understanding of the Four Noble Truths. It is also known as the Middle Path or Middle Way. 65. (2) The concept of zero as a number and not merely a symbol for separation is attributed to India, where, by the 9th century AD, practical calculations were carried out using zero, which was treated like any other number, even in case of division. The credit for inventing ‘zero (0)’ goes to Indian mathematicians and the number zero first appears in a book about ‘arithmetic’ written by an Indian mathematician ‘Brahamagupta’. Zero signifies ‘nothing’ and the current definition calls it an ‘additive identity’. The Indian mathematicians Bhaskara, Mahavira and Brahamagupta worked on this new number and they tried to explain its properties. It wasn’t that somebody suddenly came up with the idea of the zero and the mathematicians throughout the world accepted it. Around 500 AD, Aryabhatta, an Indian mathematician, devised a numbers system and the symbol he used for the number zero was also the number used to represent an unknown element (x). 66. (4) Charaka was one of the principal contributors to the ancient art and science of Ayurveda, a system of medicine and lifestyle developed in Ancient India. He is referred to as the Father of Medicine. The life and times of Charaka are not known with certainty. Some Indian scholars have stated that Charaka of Charaka Samhita existed before Panini, the grammarian, who is said to have lived before the sixth century B. C. Another school argues that Patanjali wrote a commentary on the medical work of Charaka. They say that if Patanjali lived around 175 B.C., Charaka must have lived some time before him. Another source about the identity of Charaka and his times is provided by the French orientalist Sylvan Levi. He discovered in the Chinese translation of the Buddhist Tripitaka, a per-on named Charaka who was a court physician to the Indo-Scythian king Kanishka, who in all probability reigned in the second century A.D. From the above discussion, it would seem that Charaka may have lived between the second century B.C. to the second century A.D. 67. (4) Buddha was against caste. His religion was open to all, to shudras, women and even repentant criminals. The Buddhist scriptures were available to all men and women. Buddhism encouraged abolition of distinctions in society and strengthened the principle of social equality."
    },
    {
        "question": "Which was the only Indus site with an artificial brick dockyard? ",
        "option1": " Lothal ",
        "option2": " Kalibangan ",
        "option3": " Harappa ",
        "option4": " Mohenjo Daro",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) Lothal was one of the most prominent cities of the ancient Indus valley civilization. Located in Bhal region of the modern state of Gujarat and dating from 2400 BCE, it was discovered in 1954 . Lothal was excavated from February 13, 1955 to May 19, 1960 by the Archaeological Survey of India (ASI). Lothal’s dock—the world’s earliest known, connected the city to an ancient course of the Sabarmati river on the trade route between Harappan cities in Sindh and the peninsula of Saurashtra when the surrounding Kutch desert of today was a part of the Arabian Sea.It was a vital and thriving trade centre in ancient times, with its trade of beads, gems and valuable ornaments reaching the far corners of West Asia and Africa. "
    },
    {
        "question": "Which dynasty succeeded the Chalukyas in the Western India? ",
        "option1": " Cholas ",
        "option2": " Kakatiyas ",
        "option3": " Pallavas ",
        "option4": " Rashtrakutas",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) The Chalukya dynasty was an Indian royal dynasty that ruled large parts of southern and central India between the 6th and the 12th centuries. The earliest dynasty, known as the “Badami Chalukyas”, ruled from Vatapi (modern Badami) from the middle of the 6th century. The Badami Chalukyas began to assert their independence at the decline of the Kadamba kingdom of Banavasi and rapidly rose to prominence during the reign of Pulakesin II. After the death of Pulakesin II, the Eastern Chalukyas became an independent kingdom in the eastern Deccan. They ruled from Vengi until about the 11th century. In the western Deccan, the rise of the Rashtrakutas in the middle of the 8th century eclipsed the Chalukyas of Badami before being revived by their descendants, the Western Chalukyas, in the late 10th century. "
    },
    {
        "question": "Upto where did Chandragupta Maurya’s empire extend in the north-west ? ",
        "option1": " Ravi river ",
        "option2": " Indus river ",
        "option3": " Satluj river ",
        "option4": " Hindukush range",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) Prior to Chandragupta’s consolidation of power, small regional kingdoms dominated the northwestern subcontinent, while the Nanda Dynasty dominated the middle and lower basin of the Ganges. After Chandragupta’s conquests, the Maurya Empire extended from Bengal and Assam in the east, to Afghanistan and Balochistan, some part of the eastern and southeast Iran in the west, to Kashmir and Nepal in the north, and to the Deccan Plateau in the south. The vast empire extended from the Bay of Bengal in the east, to the Indus River in the west. "
    },
    {
        "question": "Prince Ellara conquered Sri Lanka in the second century BC. With which of the following dynasties of Dravida ruler was he associated ? ",
        "option1": " Chera ",
        "option2": " Chola ",
        "option3": " Pandya ",
        "option4": " Pallava",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) Elara (235 BC – 161 BC), also known as Manu Needhi Cholan was a Chola king from the Chola Kingdom, in present day South India, who ruled Sri Lanka from 205 BC to 161 BC from the ancient capital of Anuradhapura. Often referred to as ‘the Just King’. The Tamil name Elalan means, ‘the one who rules the Ellai (boundary). Elara is a peculiar figure in the history of Sri Lanka and one with particular resonance given the ongoing ethnic strife in the country. Although he was an invader, he is often regarded as one of Sri Lanka’s wisest and most just monarchs, as highlighted in the ancient Sinhalese chronicle Mahavamsa. "
    },
    {
        "question": "Harshavardhana organised his religious assembly at ",
        "option1": " Mathura ",
        "option2": " Prayag ",
        "option3": " Varanasi ",
        "option4": " Tamralipt",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) After the Kannauj Assembly was concluded, Hiuen-Tsang was making preparations to go to his home, but Harsha invited him to attend another Assembly at Prayag which he used to hold after ever five years on the confluence of Ganga and Yamuna. Five such assemblies had already taken place and this was the sixth Assembly in which Hiuen-Tsang was invited. This ceremony was attended by the kings of eighteen kingdoms and about 5, 00,000 people including Sramanas. Hercetics, Nigranthas, the poor, the orphans etc, attended this assembly. The Prayag Assembly is a glorious example of the generosity of Harshavardhana as he gave all his personal wealth and belongings in charity during the assembly. "
    },
    {
        "question": "Which of the following domesticated animals was absent in the terracottas of the Indus civilisation ? ",
        "option1": " Buffalo ",
        "option2": " Sheep ",
        "option3": " Cow ",
        "option4": " Pig",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) The Indus Valley Civilization made sculptures mainly in stone, metal and terra-cotta. Ranging in size from slightly larger than a human thumb to almost 30 cm. (one foot) in height, the anthropomorphic and animal terracotta figurines from Harappa and other Indus Civilization sites offer a rich reflection of some of the Harappan ideas about representing life in the Bronze Age. From the terracotta figurines, we come to know that the people of Harappa domesticated animals like oxen, buffaloes, pigs, goats and sheep. Camels and asses were used as means of transport. Dogs and cats were kept as pets. The humped bull was considered a great asset in the farming community. "
    },
    {
        "question": "Which among the following is the sacred book of the Buddhists ? ",
        "option1": " Upanishad ",
        "option2": " Vedas ",
        "option3": " Tripitaka ",
        "option4": " Jatakas",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) Tripitaka is a traditional term used by various Buddhist sects to describe their various canons of scriptures. As the name suggests, a Tripitaka traditionally contains three “baskets” of teachings: a Sutra Pitaka (Sanskrit; Pali: Sutta Pitaka), a Vinaya Pitaka (Sanskrit & Pali) and an Abhidharma Pitaka (Sanskrit; Pali: Abhidhamma Pitaka). "
    },
    {
        "question": "The greatest development in the Kushana period was in the field of ",
        "option1": " religion ",
        "option2": " art ",
        "option3": " literature ",
        "option4": " architecture",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) The Kushanas were great patrons of art. It was under the rule of the Kushans that principles were formed for making sculptural images, which continued to influence making of sculptures ever after. During this time, Buddha was first shown in human form (earlier he was represented by symbols like lotus and footsteps). Other Hindu and Jain deities also began to be shown in human form. Mathura and Gandhara were the two main centers of art during the time of the Kushanas. The Gandhara School of Art and the Mathura School of Art developed their own distinct styles. The Gandhara School was highly influenced by Greco-Roman philosophies and mainly concentrated on depicting the image of the Buddha and the legends associated with his life, while the Mathura School drew inspiration from local folk deities and themes from day to day life. "
    },
    {
        "question": "Who was the first known Gupta ruler ? ",
        "option1": " Sri Gupta ",
        "option2": " Chandragupta I ",
        "option3": " Ghatotkacha ",
        "option4": " Kumaragupta I",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) Sri Gupta (240–280) was a pre-imperial Gupta king in northern India and start of the Gupta dynasty. The first evidence of Sri Gupta comes from the writings of I-tsing around 690 CE who describes that the Poona copper inscription of Prabhavati Gupta, a daughter of Chandra Gupta, describes “Maharaja Sri-Gupta” as the founder of the Gupta dynasty "
    },
    {
        "question": "Which was the only Indus city without a citadel ? ",
        "option1": " Kalibangan ",
        "option2": " Harappa ",
        "option3": " Mohenjodaro ",
        "option4": " Chanhudaro",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) Excavations at Chanhudaro have revealed three different cultural layers from lowest to the top being Indus culture, the Jhukar culture and the Jhangar culture. The site is especially important for providing evidences about different Harappan factories. These factories produced seals, toys and bone implements. It was the only Harappan city without a citadel."
    },
    {
        "question": "Ashoka called the Third Buddhist Council at ",
        "option1": " Pataliputra ",
        "option2": " Magadha ",
        "option3": " Kalinga ",
        "option4": " Sarnath",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) The Third Buddhist council was convened in about 250 BCE at Asokarama in Pataliputra, supposedly under the patronage of Emperor Asoka. The traditional reason for convening the Third Buddhist Council is reported to have been to rid the Sangha of corruption and bogus monks who held heretical views. It was presided over by the Elder Moggaliputta Tissa and one thousand monks participated in the Council. "
    },
    {
        "question": "The tutor of Alexander, the Great was ",
        "option1": " Darius ",
        "option2": " Cyrus ",
        "option3": " Socrates ",
        "option4": " Aristotle",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) Aristotle was a Greek philosopher and polymath, a student of Plato and teacher of Alexander the Great. Together with Plato and Socrates (Plato’s teacher), Aristotle is one of the most important founding figures in Western philosophy. Aristotle’s writings were the first to create a comprehensive system of Western philosophy, encompassing morality, aesthetics, logic, science, politics, and metaphysics. Aristotle was invited by Philip II of Macedon to become the tutor to his son Alexander in 343 BC. Aristotle was appointed as the head of the royal academy of Macedon. During that time he gave lessons not only to Alexander, but also to two other future kings: Ptolemy and Cassander. Aristotle encouraged Alexander toward eastern conquest. "
    },
    {
        "question": "Which of the following literary works belongs to classical Sanskrit literature? ",
        "option1": " Dhammapada ",
        "option2": " Vedas ",
        "option3": " Meghadutam ",
        "option4": " Dighanikaya",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) Meghadutam (cloud messenger) is a lyric poem written by Kalidasa, considered to be one of the greatest Sanskrit poets. In Sanskrit literature, the poetic conceit used in the Meghadutam spawned the genre of sandesha kavya or messenger poems, most of which are modeled on the Meghaduta (and are often written in the Meghaduta’s mandakranta metre) "
    },
    {
        "question": "Who propounded the ‘Eight-Fold Path’ for the end of misery of mankind ? ",
        "option1": " Mahavir ",
        "option2": " Gautam Buddha ",
        "option3": " Adi Shankaracharya ",
        "option4": " Kabir",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) The Noble Eightfold Path is one of the principal teachings of the Buddha, who described it as the way leading to the cessation of suffering (dukkha) and the achievement of self-awakening. It is used to develop insight into the true nature of phenomena (or reality) and to eradicate greed, hatred, and delusion. The Noble Eightfold Path is the fourth of the Buddha’s Four Noble Truths; the first element of the Noble Eightfold Path is, in turn, an understanding of the Four Noble Truths. It is also known as the Middle Path or Middle Way. "
    },
    {
        "question": "The number system ‘Zero’ was invented by ",
        "option1": " Ramanujam ",
        "option2": " Aryabhatta ",
        "option3": " Patanjali ",
        "option4": " An unknown person",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) The concept of zero as a number and not merely a symbol for separation is attributed to India, where, by the 9th century AD, practical calculations were carried out using zero, which was treated like any other number, even in case of division. The credit for inventing ‘zero (0)’ goes to Indian mathematicians and the number zero first appears in a book about ‘arithmetic’ written by an Indian mathematician ‘Brahamagupta’. Zero signifies ‘nothing’ and the current definition calls it an ‘additive identity’. The Indian mathematicians Bhaskara, Mahavira and Brahamagupta worked on this new number and they tried to explain its properties. It wasn’t that somebody suddenly came up with the idea of the zero and the mathematicians throughout the world accepted it. Around 500 AD, Aryabhatta, an Indian mathematician, devised a numbers system and the symbol he used for the number zero was also the number used to represent an unknown element (x). "
    },
    {
        "question": "‘Charak’ was the famous court physician of ",
        "option1": " Harsha ",
        "option2": " Chandra Gupta Maurya ",
        "option3": " Ashoka ",
        "option4": " Kanishka",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) Charaka was one of the principal contributors to the ancient art and science of Ayurveda, a system of medicine and lifestyle developed in Ancient India. He is referred to as the Father of Medicine. The life and times of Charaka are not known with certainty. Some Indian scholars have stated that Charaka of Charaka Samhita existed before Panini, the grammarian, who is said to have lived before the sixth century B. C. Another school argues that Patanjali wrote a commentary on the medical work of Charaka. They say that if Patanjali lived around 175 B.C., Charaka must have lived some time before him. Another source about the identity of Charaka and his times is provided by the French orientalist Sylvan Levi. He discovered in the Chinese translation of the Buddhist Tripitaka, a per- INDIAN HISTORY SGAE–89 son named Charaka who was a court physician to the Indo-Scythian king Kanishka, who in all probability reigned in the second century A.D. From the above discussion, it would seem that Charaka may have lived between the second century B.C. to the second century A.D. "
    },
    {
        "question": "Buddhism made an important impact by allowing two sections of society into its fold. They were ",
        "option1": " Merchants and Priests ",
        "option2": " Moneylenders and Slaves ",
        "option3": " Warriors and Traders ",
        "option4": " Women and Sudras",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) Buddha was against caste. His religion was open to all, to shudras, women and even repentant criminals. The Buddhist scriptures were available to all men and women. Buddhism encouraged abolition of distinctions in society and strengthened the principle of social equality."
    },
    {
        "question": "The language used to write source materials in ancient time was ",
        "option1": " Sanskrit ",
        "option2": " Pali ",
        "option3": " Brahmi ",
        "option4": " Kharosthi",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) Pali is a Middle Indo-Aryan language (of Prakrit group) of the Indian subcontinent. It is best known as the language of many of the earliest extant Buddhist scriptures, as collected in the Pali Canon or Tipitaka, and as the liturgical language of Theravada Buddhism. T. W. Rhys Davids in his book Buddhist India, and Wilhelm Geiger in his book Pali Literature and Language, suggested that Pali may have originated as a form of lingua franca or common language of culture among people who used differing dialects in North India, used at the time of the Buddha and employed by him. "
    },
    {
        "question": "India’s trade with the Roman Empire came to an end with the invasion of Rome by the ",
        "option1": " Arabs ",
        "option2": " Hungarians ",
        "option3": " Hunas ",
        "option4": " Turks",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) Roman trade with India started around the beginning of the Common Era following the reign of Augustus and his conquest of Egypt. Following the RomanPersian Wars Khosrow I of the Persian Sassanian Dynasty captured the areas under the Roman Byzantine Empire. The Arabs, led by ‘Amr ibn al-’As, crossed into Egypt in late 639 or early 640 C.E. That advance marked the beginning of the Islamic conquest of Egypt and the fall of ports such as Alexandria, used to secure trade with India by the Greco Roman world since the Ptolemaic dynasty. The decline in trade saw Southern India turn to Southeast Asia for international trade, where it influenced the native culture to a greater degree than the impressions made on Rome. The Hunas invaded the Roman Empire under Attila the Hun in 454 C.E. "
    },
    {
        "question": "Most of the chola temples were dedicated to ",
        "option1": " Ganesh ",
        "option2": " Shiva ",
        "option3": " Durga ",
        "option4": " Vishnu",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) Most of the Chola temples were dedicated to Shiva. The great living Chola temples are important Hindu kovils that were built during the 10th-12th centuries in the South India. In all these temples, the chief deity who has been depicted and worshipped is Lord Shiva. "
    },
    {
        "question": "‘Bull’ in Buddhism is associated with which event of Buddha’s life ? ",
        "option1": " Birth ",
        "option2": " Great departure ",
        "option3": " Enlightenment ",
        "option4": " Mahaparinirvan",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) The five great events in Buddha’s life are represented by symbols as under: (a) Birth by Lotus and Bull, (b) Great Renunciation by Horse, (c) Nirvana by Bodhi Tree, (d) First Sermon by Dharmachakra or Wheel and (e) Parinirvana or death by the stupa. "
    },
    {
        "question": "Which of the following would be the most accurate description of the Mauryan Monarchy under Ashoka ? ",
        "option1": " Enlightened despotism ",
        "option2": " Centralised autocracy ",
        "option3": " Oriental despotism ",
        "option4": " Guided democracy",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) Despotism is a form of government in which a single entity rules with absolute power. However, in enlightened absolutism (also known as benevolent despotism), absolute monarchs used their authority to institute a number of reforms in the political systems and societies of their countries. During Ashoka’s reign, the Mauryan Empire was indeed the first attempt in India to secure administrative centralization on an extended scale. Within its framework it united a number of people and tribes. Tha nature of the Mauryan government was enlightened despotism. The centralized monarchy became a paternal despotism under the able guidance of Ashoka. "
    },
    {
        "question": "The illustrious names of Aryabhatta and Varahamihir are associated with the age of the ",
        "option1": " Guptas ",
        "option2": " Kushanas ",
        "option3": " Mauryas ",
        "option4": " Palas",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) The Gupta Empire was an ancient Indian empire which existed from approximately 320 to 550 CE and covered much of the Indian Subcontinent. Scholars of this period include Varahamihira and Aryabhatta, who is believed to be the first to come up with the concept of zero, postulated the theory that the Earth moves round the Sun, and studied solar and lunar eclipses. The most famous works of Aryabhatta are the Aryabhatiya and the Arya-siddhanta. Varahamihira was an Indian astronomer, mathematician, and astrologer who lived in Ujjain. He is considered to be one of the nine jewels (Navaratnas) of the court of legendary ruler Vikramaditya (thought to be the Gupta emperor Chandragupta II Vikramaditya). "
    },
    {
        "question": "Lothal is a site where dockyards of which of the following civilization were found ? ",
        "option1": " Indus Valley ",
        "option2": " Mesoptamian ",
        "option3": " Egyptian ",
        "option4": " Persian",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) Lothal is one of the most prominent cities of the ancient Indus valley civilization. Lothal’s dock—the world’s earliest known, connected the city to an ancient course of the Sabarmati river on the trade route between Harappan cities in Sindh and the peninsula of Saurashtra when the surrounding Kutch desert of today was a part of the Arabian Sea. It was a vital and thriving trade centre in ancient times, with its trade of beads, gems and valuable ornaments reaching the far corners of West Asia and Africa. "
    },
    {
        "question": "‘Buddha’ means ",
        "option1": " The Enlightened one ",
        "option2": " The Religious Preacher ",
        "option3": " The Genius ",
        "option4": " The Powerful",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) The word Buddha is a title for the first awakened being in an era. “Buddha” is also sometimes translated as “The Enlightened One”. As Gautam fully comprehended the Four Noble Truths and as he arose from the slumbers of ignorance he is called a Buddha. Before His Enlightenment he was a bodhisattva which means one who is aspiring to attain Buddhahood. He was not born a Buddha, but became a Buddha by his own efforts. Every aspirant to Buddhahood passes through the bodhisattva period — a period comprising many lives over a vast period of time. "
    },
    {
        "question": "Where do you find the temple of Angkor Wat ? ",
        "option1": " In Thailand ",
        "option2": "In Malaysia ",
        "option3": " In Cambodia ",
        "option4": "In Myanmar",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) The temple of Angor Vat is located in Angkor, Siem Reap Province, in Cambodia. It is the largest Hindu temple complex in the world. The temple was built by King Suryavarman II in the early 12th century in Yasodharapura, the capital of the Khmer Empire, as his state temple and eventual mausoleum. Breaking from the Shaivism tradition of previous kings, Angkor Wat was instead dedicated to Vishnu. As the best-preserved temple at the site, it is the only one to have remained a significant religious centre since its foundation – first Hindu, dedicated to the god Vishnu, then Buddhist. It has become a symbol of Cambodia, appearing on its national flag, and it is the country’s prime attraction for visitors. "
    },
    {
        "question": "Whose achievements are recorded in the Allahabad Pillar inscription ? ",
        "option1": " Chandra Gupta Maurya ",
        "option2": " Samudra Gupta ",
        "option3": " Vikramaditya ",
        "option4": " Skand Gupta",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) Allahabad Stone Pillar Inscription of Samudra Gupta is writings in stone pillar during the term of King Samudra Gupta located in Allahabad which mentioned events during his tenure in and around his empire. It is one of the most important epigraphic evidences of the Imperial Guptas. Composed by Harisena, it delineates the reign of the Guptas in ancient India. Achievements of different rulers of the Gupta lineage are also mentioned in the Allahabad Pillar Inscription. Harisena was the court poet and minister of Samudragupta. "
    },
    {
        "question": "The essential feature of the Indus Valley Civilisation was ",
        "option1": " worship of forces of nature ",
        "option2": " organised city life ",
        "option3": " pastoral farming ",
        "option4": " caste society",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) Among all the Bronze Age cultures, the Indus Valley civilization was the most urbanized. A sophisticated and technologically advanced urban culture is evident in the Indus Valley Civilization making them the INDIAN HISTORY SGAE–90 first urban centres in the region. The quality of municipal town planning suggests the knowledge of urban planning and efficient municipal governments. By 2600 BCE, the Early Harappan communities had been turned into large urban centres. Such urban centres include Harappa, Ganeriwala, Mohenjo-Daro in modern day Pakistan, and Dholavira, Kalibangan, Rakhigarhi, Rupar, and Lothal in modern day India. "
    },
    {
        "question": "Name the capital of the Pallavas ",
        "option1": " Kanchi ",
        "option2": " Vatapi ",
        "option3": " Trichnapalli ",
        "option4": " Mahabalipuram",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) Pallavas ruled regions of northern Tamil Nadu and southern Andhra Pradesh between the second to the ninth century CE. Kanchipuram served as the capital city of the Pallava Kingdom from the 4th to the 9th century. It is also known by its former names Kanchiampathi, Conjeevaram, and the nickname “The City of Thousand Temples’. Kanchipuram was mentioned in the Mahabhasya, written by Patanjali in the 2nd century BC. "
    },
    {
        "question": "The word ‘Veda’ means ",
        "option1": " knowledge ",
        "option2": " wisdom ",
        "option3": " skill ",
        "option4": " power",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) The Vedas (“knowledge”) are a large body of texts originating in ancient India. Composed in Vedic Sanskrit, the texts constitute the oldest layer of Sanskrit literature and the oldest scriptures of Hinduism. The Vedas are apauruveya (“not of human agency”). They are supposed to have been directly revealed, and thus are called sruti (“what is heard”), distinguishing them from other religious texts, which are called smriti (“what is remembered”). "
    },
    {
        "question": "Which metal was first used by the Vedic people ? ",
        "option1": " Silver ",
        "option2": " Gold ",
        "option3": " Iron ",
        "option4": " Copper",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) The Rig Veda mentions such artisans as the carpenter, the chariot-maker, the weaver, the leather worker, the potter, etc. This indicates that they practiced all these crafts. The term, ayas used for copper or bronze shows that metal working was known. Gold was known as ‘hiranya’. "
    },
    {
        "question": "Arabs were defeated in 738 A.D. by ",
        "option1": " Pratiharas ",
        "option2": " Rashtrakutas ",
        "option3": " Palas ",
        "option4": " Chalukyas",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) The Battle of Rajasthan is a battle (or series of battles) where the Hindu alliance defeated the Arab invaders in 738 CE and removed the Arab invaders and pillagers from the area east of the Indus River and protected whole India. The main Indian kings who contributed to the victory over the Arabs were the north Indian ruler Nagabhata of the Pratihara Dynasty and the south Indian Emperor Vikramaditya- II of the Chalukya dynasty in the 8th century. "
    },
    {
        "question": "In Mauryan dynasty Kalinga war took place in the year— ",
        "option1": " 260 BC ",
        "option2": " 261 BC ",
        "option3": " 126 BC ",
        "option4": " 232 BC",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) In the Mauryan dynasty, Kalinga war took place in the year 261 BC. The Kalinga war fought between the Mourya Empire under Ashoka the Great and the state of Kalinga (Odisha). It was fought in 262-261 BC. The Kalinga war is one of the major and bloodiest battles in the history of India. "
    },
    {
        "question": "The caves and rock-cut temples at Ellora are ",
        "option1": " Hindu and Buddhist ",
        "option2": " Buddhist and Jain ",
        "option3": " Hindu and Jain ",
        "option4": " Hindu, Buddhist and Jain",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) Ellora represents the epitome of Indian rock-cut architecture. The 34 “caves” – actually structures excavated out of the vertical face of the Charanandri hills. Buddhist, Hindu and Jain rock-cut temples and viharas and mathas were built between the 5th century and 10th century. The 12 Buddhist (caves 1– 12), 17 Hindu (caves 13–29) and 5 Jain (caves 30– 34) caves, built in proximity, demonstrate the religious harmony prevalent during this period of Indian history. "
    },
    {
        "question": "The Seven Pagodas of Mahabalipuram are a witness to the art patronised by the ",
        "option1": " Pallavas ",
        "option2": " Pandyas ",
        "option3": " Cholas ",
        "option4": " Cheras",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) “Seven Pagodas” has served as a nickname for the south Indian city of Mahabalipuram, also called Mamallapuram, since the first European explorers reached it. The phrase “Seven Pagodas” refers to a myth that has circulated in India, Europe, and other parts of the world for over eleven centuries. Mahabalipuram’s Shore Temple, built in the 8th century CE under the reign of Pallava king Narasimhavarman II, stands at the shore of the Bay of Bengal. Legend has it that six other temples once stood with it. "
    },
    {
        "question": "Name the clan Buddha belonged to ",
        "option1": " Gnathrika ",
        "option2": " Maurya ",
        "option3": " Sakya ",
        "option4": " Kuru",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) Shakya was an ancient tribe (janapada) of the Indian Subcontinent in the 1st millennium BCE. In Buddhist texts the Shakyas, the inhabitants of Shakya janapada, are mentioned as a Kshatriya clan of Gotama gotra. The most famous Shakya was Gautama Buddha, a member of the ruling Gautama clan of Lumbini, who is also known as Shakyamuni Buddha, “sage of the Shakyas”, due to his association with this ancient kingdom. The Puranas mention Shakya as a king of Ikshvaku dynasty "
    },
    {
        "question": "Who was the author of the Kadambari, a great romantic play ? ",
        "option1": " Banabhatta ",
        "option2": " Harshavardhana ",
        "option3": " Baskaravardhana ",
        "option4": " Bindusara",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) Kadambari is a romantic novel in Sanskrit. It was substantially composed by Banabhatta in the first half of the 7th century, who did not survive to see it through completion. The novel was completed by Banabhatta’s son Bhushanabhatta, according to the plan laid out by his late father. It is conventionally divided into Purvabhaga (earlier part) written by Banabhatta, and Uttarabhaga (latter part) by Bhushanabhatta. "
    },
    {
        "question": "During which Gupta King’s reign did the Chinese traveller Fa-hien visit India ? ",
        "option1": " Chandra Gupta I ",
        "option2": " Samudra Gupta ",
        "option3": " Chandra Gupta II ",
        "option4": " Kumara Gupta",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) Chandragupta II The Great (was one of the most powerful emperors of the Gupta empire in northern India. His rule spanned c. 380–413/415 CE, during which the Gupta Empire achieved its zenith, art, architecture, and sculpture flourished, and the cultural development of ancient India reached its climax. Fa Hsien was the first of three great Chinese pilgrims who visited India from the fifth to the seventh centuries CE, in search of knowledge, manuscripts and relics. Faxian arrived during the reign of Chandragupta II and gave a general description of North India at that time. Among the other things, he reported about the absence of capital punishment, the lack of a polltax and land tax. Most citizens did not consume onions, garlic, meat, and wine. "
    },
    {
        "question": "St. Thomas is said to have come to India to propagate Christianity during the reign of the ",
        "option1": " Cheras ",
        "option2": " Parthians ",
        "option3": " Pandyas ",
        "option4": " Cholas",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) St. Thomas is traditionally believed to have sailed to India in 52AD to spread the Christian faith among the Jews, the Jewish diaspora present in Kerala at the time. He is supposed to have landed at the ancient port of Muziris near Kodungalloor. He then went to Palayoor (near present-day Guruvayoor), which was a Hindu priestly community at that time. He left Palayoor in AD 52 for the southern part of what is now Kerala State, where he established the Ezharappallikal, or “Seven and Half Churches”. Thomas landed in Cranganoor (Kodungallur, Muziris) and took part in the wedding of Cheraman Perumal and proceeded to the courts of Gondophorus in North India. Gundaphorus was indeed a historical figure and he belonged to the Parthian Dynasty from Takshasila (Taxila). "
    },
    {
        "question": "The people of the Indus Valley Civilization usually built their houses of ",
        "option1": " Pucca bricks ",
        "option2": " Stone ",
        "option3": " Wood ",
        "option4": " All of the above",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) The Indus Valley Civilization, marked by its remarkable level of urbanization despite being a Bronze Age culture, is noted for its cities built of brick, roadside drainage system, and multistoried houses. Houses were one or two stories high, made of baked brick, with flat roofs, and were just about identical. Each was built around a courtyard, with windows overlooking the courtyard. The outside walls had no windows. Each home had its own private drinking well and its own private bathroom."
    },
    {
        "question": "Who started the Saka Era and when ? ",
        "option1": " Kadphises in 58 BC ",
        "option2": " Rudradaman I in AD 78 ",
        "option3": " Vikramaditya in 58 BC ",
        "option4": " Kanishka in AD 78",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) Most of what is known about Kanishka derives from Chinese sources, particularly Buddhist writings. When Kanishka came to the throne is uncertain. His accession has been estimated as occurring between his reign is believed to have lasted 23 years. The year 78 marks the beginning of the Saka era, a system of dating that Kanishka might have initiated. "
    },
    {
        "question": "In which state was the Nalanda University located in India? ",
        "option1": " Bengal ",
        "option2": " Bihar ",
        "option3": " Orissa ",
        "option4": " Uttar Pradesh",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) Nalanda was an ancient center of higher learning in Bihar, India. It was a Buddhist center of learning from the fifth or sixth century CE to 1197 CE. Nalanda flourished between the reign of the Chakraditya (whose identity is uncertain and who might have been either Kumara Gupta I or Kumara Gupta II) and 1197 CE, supported by patronage from the Hindu Gupta rulers as well as Buddhist emperors like Harsha and later emperors from the Pala Empire "
    },
    {
        "question": "Which event brought about a profound change in Ashoka’s administrative policy? ",
        "option1": " The third Buddhist Council ",
        "option2": " The Kalinga War ",
        "option3": " His embracing of Buddhism ",
        "option4": " His sending of missionary to Ceylon",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) Kalinga War was the only major war Ashoka fought after his accession to throne. It is one of the major and bloodiest battles in the history of India. Kalinga put up a stiff resistance, but they were no match for Ashoka’s brutal strength. The bloodshed of this war is said to have prompted Ashoka to adopt Buddhism. "
    },
    {
        "question": "The monk who influenced Ashoka to embrace Buddhism was ",
        "option1": " Vishnu Gupta ",
        "option2": " Upagupta ",
        "option3": " Brahma Gupta ",
        "option4": " Brihadratha",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) Upagupta was a Buddhist monk. According to some stories in the Sanskrit Avadana he was the spiritual teacher of Asoka the great Mauryan emperor. Upagupta’s teacher was Sanavasi who was a disciple of Ananda, the Buddha’s attendant. Due to the absence of his name in Theravada literature it is assumed that Upagupta was a Sarvadin monk. "
    },
    {
        "question": "Harshvardhana was defeated by ",
        "option1": " Prabhakaravardhana ",
        "option2": " Pulakesin II ",
        "option3": " Narasimhasvarma Pallava ",
        "option4": " Sasanka",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) In 630 BC, Harshavardhana faced defeat at the hands of Pulakesin II, the Chalukya King of Vatapi, in Northern Karnataka. The defeat resulted in a truce between the two kings, with Harsha accepting River Narmada as the southern boundary for his kingdom. "
    },
    {
        "question": "Which of the following statements about the Guptas is NOT true ? ",
        "option1": " They ruled mainly over parts of north and central India ",
        "option2": " Kingship was hereditary and the throne always went to the eldest son ",
        "option3": " The judicial system was far more developed than in earlier times ",
        "option4": " Land taxes increased and taxes on trade and commerce decreased",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) Kingship was hereditary. Though succession to the throne was generally decided by law of primogeniture, that is, the eldest son succeeding his father, there were many exceptions to this rule. Sometimes kings were even elected by nobles and councillors. As head of the government, the King was overseer of all administrative activities of his realm. He was the supreme judge, and he usually led his army to the battlefields. "
    },
    {
        "question": "Which of the following was NOT composed by Harshavadhana? ",
        "option1": " Harshacharita ",
        "option2": " Ratnavali ",
        "option3": " Priyadarshika ",
        "option4": " Nagananda",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) The Harshacharita, is the biography of Indian Emperor Harsha by Banabhatta, also known as Bana, who was a Sanskrit writer of 7th century in India. He was the ‘Asthana Kavi’, meaning ‘Court Poet’, of King Harsha. "
    },
    {
        "question": "Which of the following is not one of the animals carved on the Sarnath Pillar ? ",
        "option1": " Humped Bull ",
        "option2": "Deer ",
        "option3": " Elephant ",
        "option4": " Horse",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) Ashoka built the Sarnath pillar to commemorate the site of the first preaching of Lord Buddha, where he taught the Dharma to five monks. The Lion Capital of Ashoka comprises four lions, standing back to back, mounted on a cylindrical abacus. The abacus features the sculptures of an elephant, a galloping horse, a bull, and a lion, separated by intervening 24-spoked Dharma wheels over a bell-shaped lotus. The four animals in the Sarnath capital are believed to symbolize different phases in Lord Buddha’s life. The Elephant is a representation of Queen Maya’s conception of Buddha when she saw a white elephant entering her womb in dream. The Bull represents desire during the life of the Buddha as a prince. The Horse symbolizes Buddha’s departure from palatial life while the Lion represents the attainment of Nirvana by Lord Buddha. "
    },
    {
        "question": "The ‘Kannauj assembly’ organised by Harsha was held in honour of ",
        "option1": " Fa-Hien ",
        "option2": " Itsing ",
        "option3": " Hieun-Tsang ",
        "option4": " Megasthenes",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) The convocation of an assembly at Kannauj was one of the most significant events of the reign of Harsha. The purpose of this assembly was to simplify the doctrines of Mahayanism. This assembly was convened in 643 A.D. It was attended by kings of eighteen countries, 3000 Brahmanas and Jains, 3000 Buddhist monks of Mahayana and Hinayana sects and 1000 Buddhist monks of Nalanda Vihara. The famous Chinese traveler, Hiuen Tsang was also present and presided the assembly."
    },
    {
        "question": " The first metal used by man was ",
        "option1": " Aluminium ",
        "option2": " Copper ",
        "option3": " Iron ",
        "option4": " Silver",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) The first two metals to be used widely were gold and copper. The use of copper in antiquity is of more significance than gold as the first tools, implements and weapons were made from copper. From 4,000 to 6,000 BC was the Chalcolithic period which was when copper came into common use. By 3600 BC the first copper smelted artifacts were found in the Nile valley and copper rings, bracelets, chisels were found. By 3000 BC weapons, tools etc. were widely found. Tools and weapons of utilitarian value were now within society, however, only kings and royalty had such tools; it would take another 500 years before they reached the peasants. "
    },
    {
        "question": " Satvahanas minted their coins predominantly in ",
        "option1": " Lead ",
        "option2": " Silver ",
        "option3": " Gold ",
        "option4": " Copper",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) The Satavahana kings mostly used lead as the material for their coins. Most of their coins are in that metal. Silver coins are very rare. Next to lead they used an alloy of silver and copper, called “potin”. Many copper coins are also available. Although the Satavahana coins are devoid of any beauty or artistic merit, they constitute a valuable source-material for the dynastic history of the Satavahanas. "
    },
    {
        "question": " The headquarters of the Ghadar Party was at ",
        "option1": " Karachi ",
        "option2": " Moscow ",
        "option3": " Berlin ",
        "option4": " San Francisco",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) The Ghadar Party, initially the Pacific Coast Hindustan Association, was formed in 1913 in the United States under the leadership of Har Dayal, with Sohan Singh Bhakna as its president. The members of the party were Indian immigrants, largely from Punjab. Many of its members were students at University of California at Berkeley including Dayal, Tarak Nath Das, Maulavi Barkatullah, Kartar Singh Sarabha and V.G. Pingle. The party quickly gained support from Indian expatriates, especially in the United States, Canada and Asia. The party was built around the weekly paper The Ghadar, which carried the caption on the masthead: Angrezi Raj Ka Dushman (an enemy of the British rule). The first issue of The Ghadar was published from San Francisco on November 1, 1913. "
    },
    {
        "question": " Where did Lord Budha breathe his last ? ",
        "option1": " Bodh Gaye ",
        "option2": " Sarnath ",
        "option3": " Kushinagar ",
        "option4": " Varanasi",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) At the time of the Buddha, Kushinagar was the capital of the Mallas, and the scene of the Buddha’s death. The Buddha died of old age, when he was eighty years old. The death was triggered by his body reaction to a dish of wild mushroom. "
    },
    {
        "question": " Fa-hien visited India during the reign of ",
        "option1": " Chandragupta II ",
        "option2": " Samudragupta ",
        "option3": " Ramagupta ",
        "option4": " Kumaragupta",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) Chandra Gupta II was the third, and most significant of the Gupta kings. During his reign the famous Chinese pilgrim Fa-Hsien visited India and wrote a detailed account of his kingdom. The celebrated Chinese pilgrim was struck with admiration by the famous royal palace and the houses for dispensing charity and medicine at Pataliputra. He speaks highly of the system of government in the Madhya-desa and the benevolence of the people, especially the moneyed classes. INDIAN HISTORY SGAE–92 "
    },
    {
        "question": " Mention the place where Buddha attained enlighten-ment. ",
        "option1": " Sarnath ",
        "option2": " Bodh Gaya ",
        "option3": " Kapilavastu ",
        "option4": "Rajgriha",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) Bodh Gaya is a religious site and place of pilgrimage associated with the Mahabodhi Temple Complex in Gaya district in the Indian state of Bihar. It is famous for being the place where Gautama Buddha is said to have obtained Enlightenment (Bodhimandala). According to Buddhist traditions, circa 500 BC Prince Gautama Siddhartha, wandering as an ascetic, reached the sylvan banks of Falgu River, near the city of Gaya. There he sat in meditation under a bodhi tree (Ficus religiosa). After three days and three nights of meditation, Siddharta claimed to have attained enlightenment and insight, and the answers that he had sought. "
    },
    {
        "question": " The Greek ambassador sent to Chandragupta Maurya's Court was : ",
        "option1": " Kautilya ",
        "option2": " Seleucus Nicator ",
        "option3": " Megasthenes ",
        "option4": " Justin",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) Megasthenes was a Greek ethnographer and explorer in the Hellenistic period, author of the work Indica. He was born in Asia Minor (modern day Turkey) and became an ambassador of Seleucus I of the Seleucid dynasty possibly to Chandragupta Maurya in Pataliputra. Megasthenes’ Indica is the first wellknown Western account of India and he is regarded as one of the founders of the study of Indian history in the West. He is also the first foreigner Ambassador to be mentioned in the Indian history. "
    },
    {
        "question": " Hiuen Tsang visited India during the reign of ",
        "option1": " Chandragupta I ",
        "option2": " Chandragupta II ",
        "option3": " Harshavardhana ",
        "option4": " Rudradaman",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) It was during Harsha’s reign that Hiuen Tsang came to India. He has given a vivid description of the social, economic and religious conditions, under the rule of Harsha spoke highly of the king. "
    },
    {
        "question": " Which one of the following was the last Buddhist text produced In India ? ",
        "option1": " Divya Vandana, ",
        "option2": " Dohakosa ",
        "option3": " Vajrachedika ",
        "option4": " Vamsathapakasini",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) Vamsathapakasini is among the last Buddhist texts produced in India. It gives us information about the origin of the Mauryas. "
    },
    {
        "question": " Arthasastra was written by ",
        "option1": " Dhanananda ",
        "option2": " Kautilya ",
        "option3": " Bimbisara ",
        "option4": "Pushyamitra",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) The Arthasastra is an ancient Indian treatise on statecraft, economic policy and military strategy which identifies its author by the names ‘Kautilya’ and ‘Vishnaugupta’, both names that are traditionally identified with Chanakya (c. 350–283 BC), who was a scholar at Takshashila and the teacher and guardian of Emperor Chandragupta Maurya, the founder of Mauryan Empire. Because of its harsh political pragmatism, the Arthasastra has often been compared to Machiavelli’s The Prince. "
    },
    {
        "question": " Worship of Mother Goddess was associated with ",
        "option1": " Aryan Civilization ",
        "option2": " Mediterranean Civilization ",
        "option3": " Indus Valley Civilization ",
        "option4": " Later Vedic Civilization",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) In view of the large number of figurines found in the Indus valley, some scholars believe that the Harappan people worshipped a Mother goddess symbolizing fertility, a common practice among rural Hindus even today. "
    },
    {
        "question": " Alexander and Porus fought a battle at ",
        "option1": " Hydaspes ",
        "option2": " Jhelum ",
        "option3": " Panipat ",
        "option4": " Tarain",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) The Battle of the Hydaspes River was fought by Alexander the Great in 326 BC against King Porus of the Hindu Paurava kingdom on the banks of the Hydaspes River (Jhelum River) in the Punjab near Bhera in what is now modern-day Pakistan. The battle resulted in a complete Macedonian victory and the annexation of the Punjab, which lay beyond the confines of the defeated Persian Empire, into the Alexandrian Empire. The battle is historically significant for opening up India for Greek political (Seleucid Empire, Indo-Greeks) and cultural influence (Greco-Buddhist art) which was to continue for many centuries. "
    },
    {
        "question": " Identify the Buddhist Literature from the following : ",
        "option1": " Tripitakas ",
        "option2": " Upanishads ",
        "option3": " Angas ",
        "option4": " Aranyakas",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) Tripitaka is a traditional term used by various Buddhist sects to describe their various canons of scriptures. As the name suggests, a Tripitaka traditionally contains three “baskets” of teachings: a Sutra Pitaka, a Vinaya Pitaka and an Abhidharma Pitaka. Tripitaka is the three main categories of texts that make up the Buddhist canon"
    },
    {
        "question": " Seleucus Nicator was defeated by ",
        "option1": " Asoka ",
        "option2": " Chandragupta Maurya ",
        "option3": " Bindu Sara ",
        "option4": " Brihadratha",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) Seleucus I Nicator was a leading officer of Alexander the Great’s League of Corinth and one of the Diadochi. In the Wars of the Diadochi that took place after Alexander’s death, Seleucus established the Seleucid dynasty and the Seleucid Empire. He was defeated by the emperor of India, Chandragupta Maurya and accepted a matrimony alliance for 500 elephants after ceding the territories considered as part of India. "
    },
    {
        "question": " The striking feature of the Indus Valley Civilization was ",
        "option1": " Urban Civilization ",
        "option2": " Agrarian Civilization ",
        "option3": " Mesolithic Civilization ",
        "option4": " Paleolithic Civilization",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) The most characteristic feature of the Harappan Civilization was its urbanization. The cities show evidence of an advanced sense of planning and organization. The town was extremely well planned. The street ran straight and at right angles to each other following the grid system. The rectangular town planning was unique to the Harappans and was not known in Mesopotamia or Egypt. The streets were very wide and the houses built of burnt bricks lined both sides of the street. In Egypt and Mesopotamia dried or baked bricks were used. "
    },
    {
        "question": " After Alexander’s death the Eastern part of his empire came under ",
        "option1": " Seleucus Nicator ",
        "option2": " Menander ",
        "option3": " Rudradaman ",
        "option4": " Kanishka",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) Seleucus I was a leading officer of Alexander the Great’s League of Corinth and one of the Diadochi. In the Wars of the Diadochi that took place after Alexander’s death, Seleucus established the Seleucid dynasty and the Seleucid Empire. His kingdom would be one of the last holdouts of Alexander’s former empire to Roman rule. They were only outlived by the Ptolemaic Kingdom in Egypt by roughly 34 years. "
    },
    {
        "question": " The early Buddhist scriptures were composed in : ",
        "option1": " Prakrit texts ",
        "option2": " Pali texts ",
        "option3": " Sanskrit texts ",
        "option4": " Pictographical texts",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) Pali is the language in which the texts of the Theravada school of Buddhism are preserved. The Pali texts are the oldest collection of Buddhist scriptures preserved in the language in which they were written down. "
    },
    {
        "question": " In Mohanjadaro, the largest building is : ",
        "option1": " the great bath ",
        "option2": " a granary ",
        "option3": " the Pillared Hall ",
        "option4": " a two storeyed house",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) The Great Granary of Harappa was the largest building of the Indus Valley Civilization. It was about 45 meters long and 15 meters wide. It was meant to store food grains. It had lines of circular brick platforms for pounding grain. There were barrack like quarters for workmen. The granary also had smaller halls and corridors. It was used to store surplus food grains. There were two rows of granaries. Each row had six granaries. A similar granary has been found in Mohanjodaro. All the granaries were built close to the river bank so that grains could be easily transported with the help of boats. "
    },
    {
        "question": " The caste system of India was created for : ",
        "option1": " immobility of labour ",
        "option2": " recognition of the dignity of labour ",
        "option3": " economic uplift ",
        "option4": " occupational division of labour",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) The caste system is a system of division of labour and power in human society. It is a system of social stratification, and a basis for affirmative action. Historically, it defined communities into thousands of endogamous hereditary groups called Jatis. The Jatis were grouped by the Brahmanical texts under the four well-known caste categories (the varnas): viz Brahmins, Kshatriyas, Vaishyas, and Shudras. "
    },
    {
        "question": " Gautama Buddha was born at ",
        "option1": " Kusinagar ",
        "option2": " Sarnath ",
        "option3": " Bodh Gaya ",
        "option4": " Lumbini",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) Lumbini is a Buddhist pilgrimage site in the Rupandehi district of Nepal. It is the place where Queen Mayadevi gave birth to Siddhartha Gautama, who as the Buddha Gautama founded the Buddhist tradition. The Buddha lived between roughly 563 and 483 BC. INDIAN HISTORY SGAE–93 "
    },
    {
        "question": " Who was the mother of Mahavira? ",
        "option1": " Yasoda ",
        "option2": " Anojja ",
        "option3": " Chetaka ",
        "option4": " Devanandi",
        "answar": "*",
        "category": "indian history",
        "explain": " (*) Trishala was the Mother of Mahavira, the 24th Tirthankara of Jainism, and wife of the Jain monarch, Siddartha of Kundgraam. She finds mention in the classical Jain Agamas, the Kalpa sutra, written by Acharya Bhadrabahu (433 - 357 BC), which is primarily a biography of the Tirthankaras. "
    },
    {
        "question": " Off the following scholars, who was the first to discovr the traces of the Harappan Civilisation? ",
        "option1": " Sir John Marshall ",
        "option2": " R. D. Baneji ",
        "option3": " A. Cunningham ",
        "option4": " Daya Ram Sahani",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) The ruins of Harrappa were first described in 1842 by Charles Masson in his Narrative of Various Journeys in Balochistan, Afghanistan. In 1856, General Alexander Cunningham, later director general of the archeological survey of northern India, visited Harappa. In 1872–75 Alexander Cunningham published the first Harappan seal. The excavation campaign under Sir John Hubert Marshall in 1921–22 resulted in the discovery of the civilization at Harappa by Sir John Marshall, Rai Bahadur Daya Ram Sahni and Madho Sarup Vats, and at Mohenjo-daro by Rakhal Das Banerjee, E. J. H. MacKay, and Sir John Marshall. "
    },
    {
        "question": " “Monolithic Rathas” of the Pallavas are found at ",
        "option1": " Kanchipuram ",
        "option2": " Puri ",
        "option3": " Mahabalipuram ",
        "option4": " Agra",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) Mahabalipuram, derived from 'Mamallapuram' is the prior and colloquial name of a town in Kancheepuram district in the Indian state of Tamil Nadu, now officially called Mamallapuram. The monuments here are constituted by cave temples, monolithic rathas (chariots), sculpted reliefs and structural temples which are excellent examples of Pallava art. "
    },
    {
        "question": " The paintings of Ajanta depict the stories of ",
        "option1": " Ramayana ",
        "option2": " Mahabharta ",
        "option3": " Jataka ",
        "option4": " Panchatantra",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) The scenes depicted in the Ajanta paintings are mostly didactic, devotional, and ornamental, with scenes from the Jataka stories of the Buddha's former existences as a bodhisattva), the life of the Gautama Buddha, and those of his veneration. The two most famous individual painted images at Ajanta are the two over-life size figures of the protective bodhisattvas Padmapani and Vajrapani on either side of the entrance to the Buddha shrine on the wall of the rear aisle. "
    },
    {
        "question": " Which is the port-town of Indus valley civilisation? ",
        "option1": " Kalibangan ",
        "option2": " Lothal ",
        "option3": " Ropar ",
        "option4": " Mohenjodaro",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) Lothal is one of the most prominent cities of the ancient Indus valley civilization. It was the most important port of this civilization and was one of the most important centres of export of beads, unguent vessels, chank shells, ladles and inlays. Lothal engineers accorded high priority to the creation of a dockyard and a warehouse to serve the purposes of naval trade. "
    },
    {
        "question": " Poet Kalidasa lived in the court of ",
        "option1": " Chandragupta Maurya ",
        "option2": " Samudragupta ",
        "option3": " Chandragupta Vikramaditya ",
        "option4": " Harsha",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) Kalidasa is generally associated with Chandragupta II who was one of the most powerful emperors of the Gupta empire in northern India. It was during his reign that the Gupta Empire achieved its zenith, art, architecture, and sculpture flourished, and the cultural development of ancient India reached its climax. Culturally, the reign of Chandragupta II marked a Golden Age. This is evidenced by later reports of the presence of a circle of poets known as the Nine Gems in his court. The greatest among them was Kalidasa. "
    },
    {
        "question": " Which was the oldest University? ",
        "option1": " Gandhara ",
        "option2": " Kanauj ",
        "option3": " Nalanda ",
        "option4": " Vaishali",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) Nalanda was an ancient center of higher learning in Bihar which was a religious center of learning from the fifth or sixth century CE to 1197 CE. At its peak, the university attracted scholars and students from as far away as Tibet, China, Greece, and Persia. Nalanda was ransacked and destroyed by an army under Bakhtiyar Khilji in 1193. "
    },
    {
        "question": " Who is called as the ‘Second Ashoka’? ",
        "option1": " Samudra Gupta ",
        "option2": " Chandra Gupta Maurya ",
        "option3": " Kanishka ",
        "option4": " Harshavardhana",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) Kanishka worked for preaching of Buddhism. He spread Buddhism to China, Japan, Central Asia and Tibet; and convened the 4th Buddhist Council at Kundalvana in Kashmir. Due to his works he is often called 'Second Asoka'. "
    },
    {
        "question": " The famous Kailasanath Temple at Kanchi was built by— ",
        "option1": " Mahendravarman I ",
        "option2": " Narasimhavarman II ",
        "option3": " Nandivarman II ",
        "option4": " Dantivarman",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) The Kailasanath temple is the oldest temple of Kanchipuram. It was built by the Pallavas in the early 8th century CE. This temple was built by Pallava King Narasimhavarman II (Rajasimhan), and is also called Rajasimha Pallaveswaram. "
    },
    {
        "question": " Kalibangan is situated in ",
        "option1": " Uttar Pradesh ",
        "option2": " Sindh ",
        "option3": " Rajasthan ",
        "option4": " Gujarat",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) Kalibangan is a town located on the left or southern banks of the Ghaggar (Ghaggar-Hakra River), identified by some scholars with Sarasvati River in Tehsil Pilibangan, between Suratgarh and Hanumangarh in Hanumangarh district, Rajasthan, near Bikaner. It was a major provincial capital of the Indus Valley Civilization. Kalibangan is distinguished by its unique fire altars and \"world's earliest attested ploughed field.\" "
    },
    {
        "question": " Bindusara sent Asoka to quell the rebellion in— ",
        "option1": " Swarnagiri ",
        "option2": " Taxila ",
        "option3": " Ujjain ",
        "option4": " Tosali",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) Because of his reputation as a frightening warrior and a heartless general, Ashoka was sent by Bindusara to curb the riots in the Avanti province (Ujjain) of the Mauryan empire. The Buddhist text Divyavadana talks of Ashoka putting down a revolt due to activities of wicked ministers. He was twice to pacify the Taxilans. "
    },
    {
        "question": " Mahabalipuram is an important city that reveals the interest in arts of ",
        "option1": " Pallavas ",
        "option2": " Cheras ",
        "option3": " Pandyas ",
        "option4": " Chalukyas",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) Mahabalipuram was a 7th century port city of the South Indian dynasty of the Pallavas around 60 km south from the city of Chennai in Tamil Nadu. The name Mamallapuram is believed to have been given after the Pallava king Narasimhavarman I, who took on the epithet Maha-malla (great wrestler), as the favourite sport of the Pallavas was wrestling. It has various historic monuments built largely between the 7th and the 9th centuries, and has been classified as a UNESCO World Heritage Site. "
    },
    {
        "question": " Lord Mahavira died at ",
        "option1": " Saravana Belagola ",
        "option2": " Lumbini Garden ",
        "option3": " Kalugumalai ",
        "option4": " Pavapuri",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) Pawapuri is a holy site for Jains located in the Nalanda district in Bihar. Around 500 BC, Lord Mahavira, the last of the 24 Tirthankaras achieved Moksha or Nirvana. He was cremated at Pawapuri, also known as Apapuri (the sinless town). "
    },
    {
        "question": " The Indus people knew the use of Weights and Measures, which is proved by the discovery of the seal at— ",
        "option1": " Kalibangan ",
        "option2": " Harappa ",
        "option3": " Chanhudaro ",
        "option4": " Lothal",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) The people of the Indus Civilization achieved great accuracy in measuring length, mass, and time. They were among the first to develop a system of uniform weights and measures. Their smallest division, which is marked on an ivory scale found in Lothal, was approximately 1.704 mm, the smallest division ever recorded on a scale of the Bronze Age. "
    },
    {
        "question": " Which language was mostly used for the propagation of Buddhism? ",
        "option1": " Sanskrit ",
        "option2": " Prakrit ",
        "option3": " Pali ",
        "option4": " Sauraseni",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) Pali is a Middle Indo-Aryan language (of Prakrit group) of the Indian subcontinent. It is best known as the language of many of the earliest extant Buddhist scriptures, as collected in the Pali Canon or Tipitaka, and as the liturgical language of Theravada Buddhism. Pali is a literary language of the Prakrit language family and was first written down in Sri Lanka in the first century BCE. "
    },
    {
        "question": " The Hoyasala’s capital was ",
        "option1": " Warangal ",
        "option2": " Devagiri ",
        "option3": " Dwarasamudra ",
        "option4": " Krishnagiri",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) Halebidu (literally \"ruined city\"), also known as Dwarasamudra, was the regal capital of the Hoysala Empire in the 12th century. It is home to one of the best examples of Hoysala architecture in the ornate Hoysaleswara and Kedareswara temples. This name is given because this city was ruined two times by Bahmani Sultanate. "
    },
    {
        "question": " Who, among the following, was not a part of the Mauryan dynasty? ",
        "option1": " Ajatsatru ",
        "option2": " Bindusara ",
        "option3": " Chandragupta Maurya ",
        "option4": " None of these",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) Ajatasatru (491 BC – c. 461 BC) was a king of the Magadha empire in north India. He was the son of King Bimbisara, the great monarch of Magadha. He was contemporary to Mahavira and Buddha. INDIAN HISTORY SGAE–94 "
    },
    {
        "question": " Sangam Age is associated with the history of ",
        "option1": " Benaras ",
        "option2": " Allahabad ",
        "option3": " Tamil Nadu ",
        "option4": " Khajuraho",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) Sangam period is the period in the history of ancient southern India (known as the Tamilakam) spanning from c. 30th century BC to c. 4th century CE. It is named after the famous Sangam academies of poets and scholars centered in the city of Madurai. In old Tamil language, the term Tamilakam referred to the whole of the ancient Tamil-speaking area, corresponding roughly to the present-day Indian states of Tamil Nadu, Kerala, parts of Andhra Pradesh, parts of Karnataka and northern Sri Lanka."
    },
    {
        "question": " Who was the court poet of Harsha? ",
        "option1": " Bhani ",
        "option2": " Ravi Kirti ",
        "option3": " Banabhatta ",
        "option4": " Vishnu Sharma",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) Banabhatta was a Sanskrit prose writer and poet of India. He was the Asthana Kavi in the court of King Harshavardhana, who reigned in the years century. 606–647 CE in north India. "
    },
    {
        "question": " Where is the Lingaraja Temple located ? ",
        "option1": " Madurai ",
        "option2": " Tiruchendur ",
        "option3": " Bhubaneswar ",
        "option4": " Ujjain",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) Lingaraj Temple is a Hindu temple dedicated to Harihara, another name for Shiva and is one of the oldest temples of Bhubaneswar, a revered pilgrimage center and the capital of Odisha. Shiva is here worshipped as Tribhuvaneshwara (Master of three worlds, i.e. Heaven, Earth and Netherworld). His consort is called Bhuvaneshvari. The temple is traditionally believed to be built by the Somavanshi king Jajati Keshari, in 11th century CE. "
    },
    {
        "question": " Who wrote the grammatical work Ashtadhyayi? ",
        "option1": " Charvaka ",
        "option2": " Kautilya ",
        "option3": " Panini ",
        "option4": " Kapila",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) Panini is known for his Sanskrit grammar, particularly for his formulation of the 3,959 rules of Sanskrit morphology, syntax and semantics in the grammar known as Ashtadhyayi (\"eight chapters\"), the foundational text of the grammatical branch of the Vedanga, the auxiliary scholarly disciplines of Vedic religion. "
    },
    {
        "question": " Beetapala and Dhiman, the two great artists that India had produced, belonged to the ",
        "option1": " Pala Age ",
        "option2": " Gupta Age ",
        "option3": " Maurya Age ",
        "option4": " Pathan Age",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) Both Beetapala and Dhiman were the artists during the Pala rule in Bengal who flourished in the 9th century A.D. The artistic centre of gravity was displaced after the decline of the Buddhist kings of Bengal when decadence in the style of Dhiman became apparent. "
    },
    {
        "question": " Buddha gave his first religious message at ",
        "option1": " Rajagriha ",
        "option2": " Pataliputra ",
        "option3": " Gaya ",
        "option4": " Sarnath",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) Sarnath is the deer park where Gautama Buddha first taught the Dharma, and where the Buddhist Sangha came into existence through the enlightenment of Kondanna. It is located to the north-east of Varanasi, in Uttar Pradesh. "
    },
    {
        "question": " The origins of Indian music could be traced to ",
        "option1": " Rigvedic Samhita ",
        "option2": " Yajurvedic Samhita ",
        "option3": " Samavedic Samhita ",
        "option4": " Atharvavedic Samhita",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) The Sama Veda is the third of the four Vedas, the ancient core Hindu scriptures, along with the Rig Veda, Yajur Veda, and Atharva Veda which consists of a collection (samhita) of hymns, portions of hymns, and detached verses, all but 75 taken from the Sakala Sakha of the Rigveda, to be sung, using specifically indicated melodies called Samagana, by Udgatar priests at sacrifices. The origins of Indian music is traced from this veda. Samaveda's Upaveda (technical manual) is Gandharva-veda that deals not only with the topics of music but also of dance and theatre. "
    },
    {
        "question": " Who amongst the following is associated with the study of the Harappan Civilisation? ",
        "option1": " Charles Mason ",
        "option2": " Cunningham ",
        "option3": " M. Wheeler ",
        "option4": " M.S. Vats",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) M.S. Vats’ ‘Excavations at Harappa,’ gives an account of archaeological excavations at Harappa carried out between the years 1920-1921 and 1933-34. M.S. Vats first excavated the \"Granary,\" and published the results of his and Sahni's excavations in 1940. "
    },
    {
        "question": " The Gupta era was started by whom? ",
        "option1": " Ghatotkacha ",
        "option2": " Srigupta ",
        "option3": " Chandragupta - 1 ",
        "option4": " Samudragupta",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) The Gupta Empire was an ancient Indian empire which existed from approximately 320 to 550 CE and covered much of the Indian Subcontinent. It was founded by Maharaja Sri Gupta. The first evidence of Sri Gupta comes from the writings of I-tsing around 690 CE who describes that the Poona copper inscription of Prabhavati Gupta, a daughter of Chandra Gupta, describes \"Maharaja Sri-Gupta\" as the founder of the Gupta dynasty. "
    },
    {
        "question": " Which Chola king founded the city of Puhar? ",
        "option1": " Rajendra Chola ",
        "option2": " Ellara ",
        "option3": " Senguttavan ",
        "option4": " Karikala",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) Karikala was a very popular Chola ruler who founded the city of 'Puhar' (Kaveripatnam) in 1st century B.C. Today is a town in the Nagapattinam district in the southern Indian state of Tamil Nadu which for a while served as the capital of the early Chola kings in Tamilakkam. "
    },
    {
        "question": " Which Rashtrakuta ruler built the famous Kailash temple of Siva at Ellora? ",
        "option1": " Dantidurga ",
        "option2": " Amoghvarsha - I ",
        "option3": " Krishan-I ",
        "option4": " Vatsraja",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) Kailashnath Temple is a famous temple, one of the 34 monasteries and temples, known collectively as the Ellora Caves located at Ellora, Maharashtra. It is designed to recall Mount Kailash, the abode of Lord Shiva. It is a megalith carved out of one single rock. It was built in the 8th century by the Rashtrakuta king Krishna-I. "
    },
    {
        "question": " Which museum houses the largest collection of Kushan sculptures? ",
        "option1": " Mathura Museum ",
        "option2": " Bombay Museum ",
        "option3": " Madras Museum ",
        "option4": " Delhi Museum",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) The Mathura Museum is famous for ancient sculptures of the Mathura school dating from 3rd century BC to 12th century AD which attained the pinnacle of glory during the reign of Great Kushan and Gupta Emperors. Mathura school represents cultural syncretism between the Classical Greek culture and Buddhism, which developed over a period of close to 1000 years in Central Asia, between the conquests of Alexander the Great in the 4th century BCE, and the Islamic conquests of the 7th century CE. "
    },
    {
        "question": " Mahavira was born in a Kshatriya clan by the name of ",
        "option1": " Shakya ",
        "option2": " Janatrika ",
        "option3": " Mallas ",
        "option4": " Lichhavis",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) Born into the kshatriya (warrior) caste Mahavira's father was chief of the Jnatrika clan, an indigenous oligarchical tribe. Mahavira's tribal affiliation is reflected in one of his later epithets, Nigantha Nataputta, which means literally \"the naked ascetic of the Jnatrika clan.\" "
    },
    {
        "question": " The Virupaksha Temple was built by the ",
        "option1": " Chalukyas ",
        "option2": " Pallavas ",
        "option3": " Vakatakas ",
        "option4": " Satavahanas",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) The Virupaksha Temple is located in Hampi near Bangalore, in the state of Karnataka in southern India. Virupaksha is a form of Shiva and has other temples dedicated to him. The temple's history is uninterrupted from about the 7th century when it was built by the Chalukyas. Evidence indicates there were additions made to the temple in the late Chalukyan and Hoysala periods, though most of the temple buildings are attributed to the Vijayanagar period. "
    },
    {
        "question": " Taxila was a famous site of ",
        "option1": " Early Vedic art ",
        "option2": " Mauryan art ",
        "option3": " Gandhara art ",
        "option4": " Gupta art",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) Taxila dates back to the Gandhara period when it was an important Hindu and Buddhist centre, and is still considered a place of religious and historical sanctity in those traditions. Gandhara art was a style of Buddhist visual art that developed in what is now northwestern Pakistan and eastern Afghanistan between the 1st century B.C and the 7th century A.D. The style, of Greco-Roman origin, seems to have flourished largely during the Kushana dynasty "
    },
    {
        "question": " The gold coins were introduced first in India by ",
        "option1": " The Kushanas ",
        "option2": " The Greeks ",
        "option3": " The Sakas ",
        "option4": " The Parthians",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) The Indo-Greek kings were the first to issue gold coins in India and their coins were special in the sense that each king had his own distinctive coins by which he could be definitely identified. The names of at least thirty Bactrian kings are known with the help of numerous coins, and they help in the reconstruction of the history of the kings. The coins carry legends in Greek and also in Kharosthi and Brahmi. "
    },
    {
        "question": " Which of the following dynasties conquered Sri Lanka and SouthEast Asian countries? ",
        "option1": " The Pandyas ",
        "option2": " The Chalukyas ",
        "option3": " The Cholas ",
        "option4": " The Rashtrakutas",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) The Chola navy played a vital role in the expansion of the Chola Empire, including the conquest of the Ceylon islands and Sri Vijaya (present day Indonesia), the spread of Hinduism, Dravidian architecture and Dravidian culture to South east Asia and in curb- INDIAN HISTORY SGAE–95 ing the piracy in Southeast Asia in the 900 CE. Inscriptions and historical sources assert that the Medieval Chola king Rajendra Chola I sent a naval expedition to Indo-China, the Malay peninsula and the Indonesian archipelago in 1025 in order to subdue the Srivijaya Empire. "
    },
    {
        "question": " The art style which combines Indian and Greek features is called ",
        "option1": " Sikhara ",
        "option2": " Verna ",
        "option3": " Nagara ",
        "option4": " Gandhara",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) Gandhara art is the style of Buddhist visual art that developed in what is now northwestern Pakistan and eastern Afghanistan between the 1st century B.C and the 7th century A.D. The style, of Greco-Roman origin, seems to have flourished largely during the Kushan dynasty and was contemporaneous with an important but dissimilar school of Kushan art at Mathura. "
    },
    {
        "question": " The Harappans were the earliest people to produce ",
        "option1": " Seals ",
        "option2": " Bronze implements ",
        "option3": " Cotton ",
        "option4": " Barely",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) The Harappans were the earliest known people to grow cotton. They produced cotton cloth hundreds of years before anyone else. In fact, the Greek word for cotton is sindon, a word derived from Sind which is a part of the Indus Valley Civilization region. "
    },
    {
        "question": " The Megalithic culture (500 B.C. - A.D. 100) brings us to the historical period in South India. The Megaliths used ",
        "option1": " weapons made of stone ",
        "option2": " tools & implements made of stone. ",
        "option3": " graves encircled by big pieces of stones. ",
        "option4": " articles of daily use made of stone.",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) A megalith is a large stone that has been used to construct a structure or monument, either alone or together with other stones. Many of these, though by no means all, contain human remains, but it is debatable whether use as burial sites was their primary function. Though generally known as dolmens, the correct term accepted by archaeologists is portal tomb.. "
    },
    {
        "question": " Chinese pilgrim who visited India during Harsha Vardhan’s period was- ",
        "option1": " Fa-hien ",
        "option2": " I’tsing ",
        "option3": " Nishka ",
        "option4": " Hiuen Tsang",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) Hiuen Tsang was a Chinese pilgrim who came to India in the first half of the seventh century A.D. during the time of Harshavardhan in order to visit the places of pilgrimage associated with Buddha. His object was to secure authentic Buddhist scriptures and visit places of Buddhist interest. On returning to China, he put down all his impressions in a book called Si- yu-ki or 'The Records of the Western World' which proved to be an invaluable source of information to historians about Harsha and the political, social, economic and religious conditions in India during his reign. "
    },
    {
        "question": " Chalukya king Pulakesin-Il was defeated by ",
        "option1": " Mahendra Varman-I ",
        "option2": " Narasimha Varman-I ",
        "option3": " Parameswara Varman-I ",
        "option4": " Jatila Parantaka",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) Narasimhavarman-I, son of Mahendravarman-I, was a Tamil king of the Pallava dynasty who ruled South India from 630–668 A.D. He avenged his father's defeat at the hands of the Chalukya king, Pulakesin II in the year 642 CE. Narasimhavarman was also known as Mamallan (great wrestler) and Mamallapuram (Mahabalipuram) was named after him. It was during his reign that the Chinese traveller Hieun Tsang visited Kanchipuram."
    },
    {
        "question": " Greek-Roman Art has found a place in ",
        "option1": " Ellora ",
        "option2": " Gandhara ",
        "option3": " Kalinga ",
        "option4": " Buddhist Art.",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) Greco-Buddhist art is the artistic manifestation of Greco-Buddhism, a cultural syncretism between the Classical Greek culture and Buddhism, which developed over a period of close to 1000 years in Central Asia, between the conquests of Alexander the Great in the 4th century BCE, and the Islamic conquests of the 7th century CE. Under the Indo-Greeks and then the Kushans, the interaction of Greek and Buddhist culture flourished in the area of Gandhara, in today’s northern Pakistan, before spreading further into India, influencing the art of Mathura, and then the Hindu art of the Gupta empire, which was to extend to the rest of South-East Asia. "
    },
    {
        "question": " The Ajanta pantings belong to the ",
        "option1": " Harappan period ",
        "option2": " Mauryan period ",
        "option3": " Buddhist period ",
        "option4": " Gupta period",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) The Ajanta Caves in Aurangabad district of Maharashtra are about 30 rock-cut Buddhist cave monuments which date from the 2nd century BCE to about 480 or 650 A.D. The caves include paintings and sculptures are masterpieces of Buddhist religious art, with figures of the Buddha and depictions of the Jataka tales. Most of the paintings belong to the VakatakaGupta period. "
    },
    {
        "question": " The Harappans were ",
        "option1": " rural ",
        "option2": " urban ",
        "option3": " nomadic ",
        "option4": " tribal",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) The Harappan cities were planned to serve these functional, social and economic requirements of their inhabitants. The urbanism of the Harappan civilization is associated with its mature phase. Many scholars have called the Harappan urbanization as 'The Urban Revolution', which could not have been possible without the strong central authority, specialized economic organization and socio-cultural unity. "
    },
    {
        "question": " The crop which was not known to Vedic people is ",
        "option1": " barley ",
        "option2": " wheat ",
        "option3": " rice ",
        "option4": " tobacco",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) Dantidurga (735–756 CE), also known as Dantivarman or Dantidurga II was the founder of the Rashtrakuta Empire of Manyakheta. His capital was based in Gulbarga region of Karnataka. He was succeeded by his uncle Krishna I who extended his kingdom to all of Karnataka. "
    },
    {
        "question": " The Rashtrakuta kingdom was founded by ",
        "option1": " Dandi Durga (Danti Durga) ",
        "option2": " Amoghavarsha ",
        "option3": " Govinda III ",
        "option4": " Indra III",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) The Indus Valley Civilization was noted for its cities built of brick, roadside drainage system, and multistoried houses. The buildings were made of burnt bricks, which have been preserved even to this day. Sun-dried bricks were used for the foundation of the buildings and the roofs were flat and made of wood. "
    },
    {
        "question": " The paintings in the Ajanta and Ellora caves are indicative of development of art under the ",
        "option1": " Rashtrakutas ",
        "option2": " Pallavas ",
        "option3": " Pandyas ",
        "option4": " Chalukyas",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) The Ellora caves were patronized mainly by the Chalukya and the Rashtrakuta Dynasty rulers between the middle of sixth century and the eleventh century A.D. Ajanta Caves in Maharashtra are 28-30 rock-cut cave monuments created during the first century BC and 5th century AD, containing paintings and sculptures considered to be masterpieces of both Buddhist religious art and universal pictorial art. "
    },
    {
        "question": " Gupta Dynasty was famous for ",
        "option1": " art and architecture ",
        "option2": " imperialism ",
        "option3": " revenue and land reform ",
        "option4": " None of these",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) The peace and prosperity created under the leadership of the Guptas enabled the pursuit of scientific and artistic endeavors. This period is called the Golden Age of India and was marked by extensive inventions and discoveries in science, technology, engineering, art, dialectic, literature, logic, mathematics, astronomy, religion and philosophy that crystallized the elements of what is generally known as Hindu culture. "
    },
    {
        "question": " The last Buddhist king who was a great Sanskrit scholar and a writer was ",
        "option1": " Kanishka ",
        "option2": " Ashoka ",
        "option3": " Bimbisara ",
        "option4": " Harshavardhana",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) Harshavardhana was a good scholar and a noted author. He wrote three plays in Sanskrit namely Ratnavali, Priyadarsika and Nagananda. We can find welldocumented record of his reign in the work of his court poet Banabhatta. "
    },
    {
        "question": " Who built Brihadeshwara Temple at Tanjore ? ",
        "option1": " Aditya Chola ",
        "option2": " Raja Raja Chola ",
        "option3": " Rajendra Chola ",
        "option4": " Karikala Chola",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) The famous Chola temple built at Tanjavur (Tanjore) is known as the Brihadeshvara temple. It is also called the Rajarajeshwara temple after the name of king Rajaraja who built it in honour of Lord Shiva in about 1009 A.D. It is a tribute and a reflection of the power of its patron Raja Raja Chola I. It remains India's largest temple. "
    },
    {
        "question": " Who among the following foreigners was the first to visit India ? ",
        "option1": " Hiuen Tsang ",
        "option2": " Magasthenese ",
        "option3": " I-Tsing ",
        "option4": " Fahien",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) Megasthenes was a Greek ethnographer and explorer in the Hellenistic period, author of the work Indica. He became an ambassador of Seleucus I of the Seleucid dynasty possibly to Chandragupta Maurya in Pataliputra, India. Scholars place it before 298 BC, the date of Chandragupta's death. Hiuen Tsang came during the reign of Harshavardhana; while ITsing and Fa Hien came during the Gupta times. INDIAN HISTORY SGAE–96 "
    },
    {
        "question": " The Third Buddhist Council was patronised by ",
        "option1": " Kanishka ",
        "option2": " Ashoka ",
        "option3": " Mahakashyap Upali ",
        "option4": " Sabakarni",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) The Third Buddhist council was convened in about 250 BCE at Asokarama in Pataliputra, supposedly under the patronage of Emperor Asoka. It was presided over by the Elder Moggaliputta Tissa and one thousand monks participated in the Council. The council is recognized and known to both the Theravada and Mahayana schools, though its importance is central only to the Theravada school. "
    },
    {
        "question": " Carving in the famous Ajanta caves was first started during the reign of the ",
        "option1": " Kadambas ",
        "option2": " Satavahanas ",
        "option3": " Rashtrakutas ",
        "option4": " Marathas",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) The earlier phase of Ajanta falls between third century BCE to second century BC. In this phase, just five caves were excavated: Caves 9, 10, 12, 13 and 15A. The region during this time was ruled by the Satavahana dynasty (230 BC – c. 220 A.D). Therefore, they may be called the Satavahana-period caves. This phase is also widely known as the Hinayana phase. "
    },
    {
        "question": " The official court language of the Guptas was ",
        "option1": " Pali ",
        "option2": " Prakrit ",
        "option3": " Hindi ",
        "option4": " Sanskrit",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) The Sanskrit language, once ignored under the Buddhist and Jain influence, was patronised during the Gupta period. It was recognised as the court language and was used in their inscriptions. Gradually it became the lingua franca of India. Some of the wellknown scholars who flourished during this period were: Kalidasa, Vishakhadutta, Shudraka, Bharavi, Dandin, Subandhu, etc. "
    },
    {
        "question": " Which of the following option is match? ",
        "option1": " Alora – Shakas ",
        "option2": " Mahabalipuram– Rashtrakuta ",
        "option3": " Meenakshi Temple –Pallavas ",
        "option4": " Khjuraho – Chandelas",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) Khajuraho was the cultural capital of Chandel Rajputs, a Hindu dynasty that ruled this part of India from the 10-12th centuries. The political capital of the Chandelas was Kalinjar. The Khajuraho temples were built over a span of 200 years, from 950 to 1150. The Chandela capital was moved to Mahoba after this time, but Khajuraho continued to flourish for some time. Khajuraho has no forts because the Chandel Kings never lived in their cultural capital. "
    },
    {
        "question": " The most distinguished ruler of the Chalukyan dynasty was ",
        "option1": " Jayasimha II ",
        "option2": " Vikramaditya VI ",
        "option3": " Somesvara II ",
        "option4": " Pulakesin II",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) Pulakesin-II was the most famous ruler of the Chalukya dynasty. In his reign the Chalukyas of Badami saw their kingdom extend over most of the Deccan. Pulikeshi-II routed the Pallava king Mahendravarman-I in the battle of Pullalur. In a decisive battle fought on the banks of the river Narmada, Pulakesin defeated Harshavardhana. "
    },
    {
        "question": " “Harsha Charita” was written by ",
        "option1": " Kalidasa ",
        "option2": " Banabhatta ",
        "option3": " Valmiki ",
        "option4": " Vyasa",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) The Harshacharita, is the biography of Indian Emperor Harsha by Banabhatta, also known as Bana, who was a Sanskrit writer of 7th century in India. He was the 'Asthana Kavi', meaning 'Court Poet', of King Harsha. "
    },
    {
        "question": " The capital of Kanishka was : ",
        "option1": " Purushapura ",
        "option2": " Benares ",
        "option3": " Allahabad ",
        "option4": " Sarnath",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) The Kushan king Kanishka, who reigned from at least 127 AD, moved the capital from Pushkalavati (now called Charsadda in the Peshawar valley) to Purushapura (Peshawar) in the 2nd century AD. Following this move by the Kushans, Peshawar became a great center of Buddhist learning even though Zoroastrianism, Hindusim and animism seem to have survived in the majority population. "
    },
    {
        "question": " In which language were the Buddhist-texts ‘Pitakas’ composed ? ",
        "option1": " Sanskrit ",
        "option2": " Ardhamagadhi ",
        "option3": " Pali ",
        "option4": " Prakrit",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) Tripitaka is the collection of the teachings of the Buddha over 45 years in the Pali language, and it consists of Sutta - conventional teaching, Vinaya - disciplinary code, and Abhidhamma - moral psychology. Tripitaka is the main categories of texts that make up the Buddhist canon. "
    },
    {
        "question": " Who was called India’s Napoleon because of his victories ? ",
        "option1": " Skandagupta ",
        "option2": " Chandragupta ",
        "option3": " Brahmagupta ",
        "option4": " Samudragupta",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) Samudragupta, ruler of the Gupta Empire, and successor to Chandragupta-I, is considered to be one of the greatest military geniuses in Indian history according to Historian V. A. Smith. He was called the Napoleon of India because he wanted to conquer more and more. "
    },
    {
        "question": " Buddhism in Nepal was introduced during the reign of ",
        "option1": " Samudragupta ",
        "option2": " Ashoka ",
        "option3": " Chandragupta ",
        "option4": " Harshavardhana",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) As a Buddhist emperor, Ashoka sent many prominent Buddhist monks (bhikshus) Sthaviras like Madhyamik Sthavira to modern Kashmir and Afghanistan; Maharaskshit Sthavira to Syria, Persia / Iran, Egypt, Greece, Italy and Turkey; and Massim Sthavira to Nepal. He built a number of stupas, Sangharama, viharas, chaitya, and residences for Buddhist monks all over South Asia and Central Asia. The Asokan pillar at Lumbini, Nepal speaks about Asoka and his works. "
    },
    {
        "question": " The Pallavas ruled from ",
        "option1": " Kanchipuram ",
        "option2": " Madurai ",
        "option3": " Tanjore ",
        "option4": " Tiruchendur",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) The Pallavas ruled regions of northern Tamil Nadu and southern Andhra Pradesh between the second to the ninth century A.D. Their capital was Kanchipuram. Located on the banks of river Vegavathy, it served as the capital city of the Pallava Kingdom during the 4th to 9th century A.D. "
    },
    {
        "question": " The Gandhara style of sculpture, during the Kushan period is a combination of ",
        "option1": " Indo-Islamic style ",
        "option2": " Indo-Persian style ",
        "option3": " Indo-China style ",
        "option4": " Indo-Greek style",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) Gandhara sculpture was an amalgamation of IndoGreek styles. The distinguishing Gandhara sculpture is the standing or seated Buddha. The western classical factor rests in the style, in the handling of the robe, and in the physiognomy of Buddha. The cloak, which covers all but the appendages is dealt like in Greek and Roman sculptures."
    },
    {
        "question": " The greatest Kushan leader who got converted to Buddhism was ",
        "option1": " Kujala ",
        "option2": " Vima ",
        "option3": " Kanishka ",
        "option4": " Kadphises",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) Kanishka's reputation in Buddhist tradition is based mainly that he convened the 4th Buddhist Council in Kashmir. Images of the Buddha based on 32 physical signs were made during his time. He provided encouragement to both the Gandhara school of GrecoBuddhist Art and the Mathura school of Hindu art. Kanishka personally seems to have embraced both Buddhism and the Persian cult of Mithra. "
    },
    {
        "question": " The Gupta king who assumed the title of ‘Vikramaditya’ was ",
        "option1": " Skandagupta ",
        "option2": " Samudragupta ",
        "option3": " Chandragupta-II ",
        "option4": " Kumaragupta",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) Chandragupta-II was one of the most powerful emperors of the Gupta empire in northern India. His rule spanned c. 380–413/415 A.D, during which the Gupta Empire achieved its zenith, art, architecture, and sculpture flourished, and the cultural development of ancient India reached its climax. He adopted the title of Vikramaditya which holds a semi-mythical status in India. "
    },
    {
        "question": " Which ruler murdered his father, Bimbisara to ascend the throne ? ",
        "option1": " Ashoka ",
        "option2": " Ajatasatru ",
        "option3": " Kanishka ",
        "option4": " Simukha",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) Ajatasatru was a king of the Magadha empire in north India. He was the son of King Bimbisara, the great monarch of Magadha. He was contemporary to Mahavira and Buddha. According to the Jain tradition Bimbisara committed suicide while according to Buddhist tradition he was brutally murdered by his own son. "
    },
    {
        "question": " Which ruler founded the famous Vikramshila University for the Buddhists ? ",
        "option1": " Mahipala ",
        "option2": " Devapala ",
        "option3": " Gopala ",
        "option4": " Dharampala",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) The Vikramasila University was one of the two most important centers of Buddhist learning in India during the Pala dynasty, along with Nalanda University. It was established by King Dharmapala (783 to 820) in response to a supposed decline in the quality of scholarship at Nalanda. Atisha, the renowned pandita, is sometimes listed as a notable abbot. "
    },
    {
        "question": " A great astronomer and mathematician during the Gupta period was ",
        "option1": " Bhanugupta ",
        "option2": " Vagabhatta ",
        "option3": " Aryabhatta ",
        "option4": " Varahamihira",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) Aryabhatta was the first in the line of great mathematician-astronomers from the classical age of Indian mathematics and Indian astronomy who belonged to the Gupta era. His period was 476–550 A.D. His most famous works are the Aryabhatiya (499 A.D) and the Arya-Siddhanta. INDIAN HISTORY SGAE–97 "
    },
    {
        "question": " Which of the following Gupta kings stopped the Huns from invading India? ",
        "option1": " Kumaragupta ",
        "option2": " Samudragupta ",
        "option3": " Skandagupta ",
        "option4": " Chandragupta",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) Skandagupta was a Gupta Emperor of northern India. He is generally considered the last of the great Gupta Emperors who faced some of the greatest challenges in the annals of the empire having to contend with the Pushyamitras and the Hunas (a name by which the \"White Huns\" were known in India). He crushed the Hun invasion in 455, and managed to keep them at bay; however, the expense of the wars drained the empire's resources and contributed to its decline. "
    },
    {
        "question": " Alexander and the army of Porus camped on the opposite banks of this river ",
        "option1": " Ravi ",
        "option2": " Jhelum ",
        "option3": " Sutlej ",
        "option4": " Chenab",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) The Battle of the Hydaspes River was fought by Alexander the Great in 326 BC against King Porus of the Hindu Paurava kingdom on the banks of the Hydaspes River (Jhelum River) in the Punjab. The battle resulted in a complete Macedonian victory and the annexation of the Punjab. The battle is historically significant for opening up India for Greek political (Seleucid Empire, Indo-Greeks) and cultural influence (Greco-Buddhist art) which was to continue for many centuries. "
    },
    {
        "question": " Who were the first to issue gold coins in India? ",
        "option1": " Kushans ",
        "option2": " Tatars ",
        "option3": " Mughals ",
        "option4": " Aryans",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) The Indo-Greek kings were the first to issue gold coins in India and their coins were special in the sense that each king had his own distinctive coins by which he could be definitely identified. However, some scholars contend that this credit should go to the Khushan kings. Vima Kadphises is said to be the first to introduce gold coinage in India, in addition to the existing copper and silver coinage. "
    },
    {
        "question": " Who among the following were the first to invade India? ",
        "option1": " Afghans ",
        "option2": " Mongols ",
        "option3": " Arabs ",
        "option4": " Turks",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) The advent of Muslims in India was marked by the Arab conquest of Sind, though long before that the Arabs already had settlements on the western coast of India. Muhammad Bin Qasim, under the order of Hajjaj, advanced in 710 A.D., at the head of a considerable army, subdued Mukran, pushed on through Baluchistan and in 711-12 reduced Sind, the lower valley and delta of the Indus. "
    },
    {
        "question": " Who amidst the following was a wife of emperor Ashoka who influenced him? ",
        "option1": " Chandalika ",
        "option2": " Charulata ",
        "option3": " Gautami ",
        "option4": " Karuwaki",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) Maharani Kaurwaki was Empress consort of the Maurya Empire as the first wife of Emperor Ashoka. Legends says that Kaurwaki was the daughter of a fisher man. It is said that she led an army of females against Ashoka in Kalinga after Kalinga had no males left to defend it. "
    },
    {
        "question": " The famous Kailasa temple cut out of the solid rock at Ellora was built under the patronage of the ",
        "option1": " Cholas ",
        "option2": " Kadambas ",
        "option3": " Pallavas ",
        "option4": " Rashtrakutas",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) Kailashnath Temple is a famous temple, one of the 34 monasteries and temples, known collectively as the Ellora Caves which was built in the 8th century by the Rashtrakuta king Krishna-I. "
    },
    {
        "question": " ‘Purushapura’ is the other name for ",
        "option1": " Patna ",
        "option2": " Pataliputra ",
        "option3": " Peshawar ",
        "option4": " Punjab",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) The Kushan king Kanishka , moved the capital from Pushkalavati to Purushapura (Peshawar) in the 2nd century AD. Following this move by the Kushans, Peshawar became a great center of Buddhist learning. "
    },
    {
        "question": " Which of the following was the capital of the Chola Kings? ",
        "option1": " Kanchi ",
        "option2": " Tanjore ",
        "option3": " Madurai ",
        "option4": " Trichirapally",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) Thanjavur, formerly Tanjore, first rose to prominence during the reign of the Medieval Cholas when it served as the capital of the Chola empire. After the fall of the Cholas, the city was ruled by various dynasties like Pandyas, Vijayanagar Empire, Madurai Nayaks, Thanjavur Nayaks, Thanjavur Marathas and the British. "
    },
    {
        "question": " ‘Tripitaka’ is the religious book of ",
        "option1": " Jains ",
        "option2": " Buddhists ",
        "option3": " Sikhs ",
        "option4": " Hindus",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) Tripitaka is the three main categories of texts that make up the Buddhist canon. As the name suggests, a Tripitaka traditionally contains three \"baskets\" of teachings: a Sutra Pitaka, a Vinaya Pitaka and an Abhidharma Pitaka. "
    },
    {
        "question": " Which of the following materials was mainly used in the manufacture of Harappan seals? ",
        "option1": " Terracota ",
        "option2": " Bronze ",
        "option3": " Copper ",
        "option4": " Iron",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) Seals are an impressive part of surviving art of Harappan culture. Of these the great majority have animals engraved on them and a short inscription. They are mainly made of terracotta which is a type of earthenware, or clay-based unglazed or glazed ceramic, where the fired body is porous. "
    },
    {
        "question": " The capital of Pallavas was ",
        "option1": " Arcot ",
        "option2": " Kanchi ",
        "option3": " Malkhed ",
        "option4": " Banavasi",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) Located on the banks of river Vegavathy, Kanchipuram served as the capital city of the Pallava Kingdom during the 4th to 9th century A.D. "
    },
    {
        "question": " Who defeated Harshavardhan on the banks of Narmada ? ",
        "option1": " Pulakesin I ",
        "option2": " Pulakesin II ",
        "option3": " Vikramaditya ",
        "option4": " Nandivarman",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) Harsha's ambition of extending his power to the Deccan and Southern India were stopped by the great Chalukya Emperor of South India Pulakeshini-II, the Chalukya king of Vatapi in Northern Karnataka along the banks of river Narmada. Pulakeshi defeated Harsha's army on the banks of the river Narmada in 620. A truce was agreed upon and the river Narmada was marked as the southern boundary of Harsha's kingdom. "
    },
    {
        "question": " During whose reign did the Gandhara School of Art blossom ? ",
        "option1": " Harsha ",
        "option2": " Ashok ",
        "option3": " Kanishka ",
        "option4": " Chandragupta II",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) The Kushan period is considered the Golden Period of Gandhara. Peshawar Valley and Taxila are littered with ruins of stupas and monasteries of this period. Gandharan art flourished and produced some of the best pieces of Indian sculpture. Many monuments were created to commemorate the Jataka tales. The Gandhara civilization peaked during the reign of the great Kushan king Kanishka (128–151). The cities of Taxila (Takshasila) at Sirsukh and Peshawar were built. "
    },
    {
        "question": " Both Jainism and Buddhism had no faith in ",
        "option1": " yajnas ",
        "option2": " salvation ",
        "option3": " caste system ",
        "option4": " rituals",
        "answar": "*",
        "category": "indian history",
        "explain": " (*) Jainism and Buddhism arose us a protest against the ritualism of the Hindu religion. Gautam Buddha and Vardhaman Mahavir both belonged to ruling families of Kshatriyas. Buddhism, as well as, Jainism had no faith in Vedic religion. Besides, both these heterodox sects had no faith in caste distinctions and opposed the caste-system vehemently. "
    },
    {
        "question": " The Gupta Saka was founded by ",
        "option1": " Chandra Gupta, the First ",
        "option2": " Chandra Gupta, the Second ",
        "option3": " Samudra Gupta ",
        "option4": " Kumara Gupta",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) Chandra Gupta was a major king in the Gupta Empire around 320 C.E. and is generally considered as the founder of the Gupta dynasty. As the ruler of the Gupta Empire, he is known for forging alliances with many powerful families in the Ganges region. The well known Gupta era which commenced on February 26, 320 AD is generally attributed to Chandragupta I. Hence it is surmised that the Gupta era began on the occasion of the coronation of Chandragupta I. "
    },
    {
        "question": " The language from which the term ‘India’ is derived is ",
        "option1": " English ",
        "option2": " Greek ",
        "option3": " Persian ",
        "option4": " Arabic",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) The name India is derived from Indus, which originates from the Old Persian word Hindu. The latter term stems from the Sanskrit word Sindhu, which was the historical local appellation for the Indus River. The ancient Greeks referred to the Indians as Indoi which translates as \"the people of the Indus\". "
    },
    {
        "question": " Vaishakha Poornima has a great significance because it was on this day ",
        "option1": " Buddha was born ",
        "option2": " Buddha got enlightened ",
        "option3": " Buddha died ",
        "option4": " All of the above",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) The day of Vaisakh Purnima, which usually falls in the month of May, is considered most sacred by Buddhists all over the world. Buddha attained Supreme Enlighten or Buddha hood, beneath the Bodhi-tree at Boddha Gaya. Forty-five years later at the age of eighty, he finally passed away in Parinivana on the same day of the year at Kushinagar. Vaisaka Purnima is celebrated especially in Boddha Gaya, Lumbini and in Kushinara as they are the holy places that were connected with the blessed ones birth, enlighten and the Parinirvana. INDIAN HISTORY SGAE–98 "
    },
    {
        "question": " The staple food of the Vedic Aryans was ",
        "option1": " barley and rice ",
        "option2": " milk and its products ",
        "option3": " rice and pulses ",
        "option4": " vegetables and fruits",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) The Vedic economy revolved around cow and dairy products which is clear from the references found in the Rig Veda. The economy was primarily pastoral. The staple diet of the people was milk, ghee (clarified butter), vegetables, fruit and barley. On special occasions like a religious feast or the arrival of a guest, a more elaborate meal was organized. "
    },
    {
        "question": " With which of the following centres of learning, Chanakya the famous teacher of Chandragupta Maurya, was associated ? ",
        "option1": " Takshashila ",
        "option2": " Nalanda ",
        "option3": " Vikramashila",
        "option4": " Vaishali",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) Takshashila, (later corrupted as Taxila), was Chanakya’s breeding ground of acquiring knowledge in the practical and theoretical aspect. He served there as a teacher also before becoming the chief advisor and mentor of Chandragupta Maurya. During the reign of Chandragupta's grandson Asoka, Taxila became a great Buddhist centre of learning."
    },
    {
        "question": " Rath temples at Mahabalipuram were built in the reign of which Pallava ruler ? ",
        "option1": " Mahendravarman I ",
        "option2": " Narasinghavarman I ",
        "option3": " Parameshwarvarman I ",
        "option4": " Nandivarman I",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) Pancha Rathas is an example of monolith Indian rock-cut architecture dating from the late 7th century, located at Mahabalipuram. The Pancha Rathas shrines were carved during the reign of King Mahendravarman-I and his son Narasimhavarman-I. The purpose of their construction is not known, structures are not completed. "
    },
    {
        "question": " Which one of the following Chola Kings conquered Ceylon (Singhal) first ? ",
        "option1": " Aditya-I ",
        "option2": " Rajaraja-I ",
        "option3": " Rajendra ",
        "option4": " Vijayalya",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) Rajaraja began his conquests by attacking the confederation between the rulers of the Pandya and Krala kingdoms and of Ceylon. Rajendra Chola I, the son of Rajaraja, invaded the island in 1018 A.D. As a result of the campaign, Rajendra captured the crown of the Sinhala king, his Queen and daughter. The Sinhala king Mahinda-V was taken prisoner and transported to the Chola country\". The naval supremacy of the Colas continued under the immediate successors of Rajendra. Rajadhiraja, not only defeated and destroyed the Chera fleet at Kandalur but sent out his squadrons on an expedition against Ceylon "
    },
    {
        "question": " Most of the Chola temples were dedicated to ",
        "option1": " Vishnu ",
        "option2": " Shiva ",
        "option3": " Brahma ",
        "option4": " Durga",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) The Great Living Chola Temples are important Hindu Kovils that were built during the 10th through 12th centuries CE in the south of India, and together have been designated a UNESCO World Heritage Site. The kovils are the Brihadeeswarar Temple at Thanjavur, Brihadeeswarar kovil at Gangaikonda Cholapuram and the Airavatesvarar Kovil at Darasuram. In all these temples, the chief deity who has been depicted and worshipped is Lord Shiva. The Cholas were followers of Saiva pantheon. "
    },
    {
        "question": " In the Gupta period, the largest number of coins were issued in ",
        "option1": " gold ",
        "option2": " silver ",
        "option3": " copper ",
        "option4": " iron",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) Coins minted in the Gupta Age were mostly made in gold. These coins consisted of the depiction of Indian deities and legends in Brahmi. Events like the Asvamedha Yagya and the accomplishments of the kings were also depicted on the coins. "
    },
    {
        "question": " The tax which the kings used to collect from the people in the Vedic period was called– ",
        "option1": " Bali ",
        "option2": " Vidatha ",
        "option3": " Varman ",
        "option4": " Kara",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) The Vedic state derived its revenue from people's contribution, technically known as ‘Bali'. Of all the terms used in connection with the items of revenue to the state, it is 'bali' which is mentioned most in the Vedic texts. Its use is, however, not restricted exclusively to the fiscal sense but also to \"offerings to a god\" and to tributes paid by hostile tribes to the king. A man is depicted in the Rig Veda as presenting oblation (bali) to Agni. "
    },
    {
        "question": " Buddha preached his first sermon at– ",
        "option1": " Gaya ",
        "option2": " Sarnath ",
        "option3": " Pataliputra ",
        "option4": " Vaishali",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) Sarnath is the deer park where Gautama Buddha first taught the Dharma, and where the Buddhist Sangha came into existence through the enlightenment of Kondanna. Sarnath is located 13 kilometres north-east of Varanasi, in Uttar Pradesh."
    },
    {
        "question": " ‘Charak’ was the famous court physician of ",
        "option1": " Harsha ",
        "option2": " Chandra Gupta Maurya ",
        "option3": " Ashoka ",
        "option4": " Kanishka",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) Galaxies of great scholars like Asvaghosa (the Buddhist Writer), Nagarjuna (the philosopher), Samgharaksha (the chaplain), Mathara (the politician), Vasumitra (the Buddhist scholar), Charaka (the physician) and Agisala (the engineer) adorned the court of Kanishka. There were two important physicians in Kanishka's time namely Charaka and Susruta. Charaka was one of the principal contributors to the ancient art and science of Ayurveda, who is referred to as the Father of Medicine. "
    },
    {
        "question": " Great Stupa at Sanchi is in ",
        "option1": " Uttar Pradesh ",
        "option2": " Madhya Pradesh ",
        "option3": " Arunachal Pradesh ",
        "option4": " Andhra Pradesh",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) The 'Great Stupa' at Sanchi is the oldest stone structure in India and was originally commissioned by the emperor Ashoka the Great in the 3rd century BC. It is located in Raisen District of the state of Madhya Pradesh. Sanchi is the location of several Buddhist monuments dating from the 3rd century BC to the 12th century AD. "
    },
    {
        "question": " Which inscription mentions about the village administration under the Cholas ? ",
        "option1": " Junagarh ",
        "option2": "Uttaramerur ",
        "option3": " Aihole ",
        "option4": "Nasik",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) A tenth century inscription on a temple wall of the brahman village of Uttaramerur gives the details of village administration under Cholas. "
    },
    {
        "question": " Who among the following, propounded the theory of zero ? ",
        "option1": " Charak ",
        "option2": " Chanakya ",
        "option3": " Aryabhatta ",
        "option4": " Varahamihira",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) Aryabhatta was an Indian astronomer and mathematician. He is credited with the invention of Algebra and the theory of zero. India’s first satellite, Aryabhatta was named after him. "
    },
    {
        "question": " The school of arts developed during the Kushan Period with the mixture of Indian and Greek style is known as ",
        "option1": " Kushan art ",
        "option2": " Persian art ",
        "option3": " Gandhara art",
        "option4": " Mughal art",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) Gandhara School of art shows Greek influence, therefore, it is known as Indo-Greek art. The important features of this school are : (i) Buddha is shown as Roman and Greek gods (ii) Moustache and beard are added to Buddha’s face (iii) The figures of this school follow a given ratio between the size of the face and rest of the body. During first and second century blue grey schist stone was used to make idols. "
    },
    {
        "question": " Where was the first Buddhist Council held ? ",
        "option1": " Vaishali ",
        "option2": "Kashmir ",
        "option3": " Rajagriha ",
        "option4": " Pataliputra",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) The first Buddhist Council was held at Rajgir in 483 BC during the reign of Ajatasatru. It was presided by Mahakassapa. "
    },
    {
        "question": " Which of the following ruler was a contemporary of Buddha ? ",
        "option1": " Udayin ",
        "option2": " Bimbisara ",
        "option3": " Ajatshatru ",
        "option4": " Mahapadma Nanda",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) King of Magadha Bimbisara was contemporary of Lord Buddha. He was a great friend and protector of the Buddha. Bimbisara was born in 558 B.C. He was the emperor of the Magadha empire from 543 BC to his death in 491 B.C. Budhha was born in 563 B.C and died in 483 B.C. 102. "
    },
    {
        "question": " During the reign of which Pallava ruler began the long drawn struggle between the Pallavas and the Chalukyas ? ",
        "option1": " Mahendravarman I ",
        "option2": " Simhavishnu ",
        "option3": " Narasimhavarman I ",
        "option4": " Mahendravarman II",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) During the reign of Mahendravarman I (590-630) began the long drawn out struggle between the Pallavas and the Chalukyas. He was defeated by Pulakesin II and a part of his kingdom was occupied. "
    },
    {
        "question": " How many spokes are there in the Dharma Chakra of the National flag ? ",
        "option1": " 22 ",
        "option2": " 18 ",
        "option3": " 24 ",
        "option4": " 14",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) The National Flag of India has design of Ashoka Chakra in navy blue colour with 24 equally spaced spokes. The 24 spokes represent the twelve laws of dependent origination and the twelve laws of dependent termination. "
    },
    {
        "question": " From which modern State did the Alwar saints originate ? ",
        "option1": " Tamil Nadu ",
        "option2": "Kerala ",
        "option3": " Karnataka ",
        "option4": "Maharashtra",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) In South India, the Bhakti movement originated in Tamil Nadu sometime after the 7th century AD with the Alwars (Vaishnava saints) and the Adiyars (Shaiva saints). "
    },
    {
        "question": " What is ‘Milindapanho’ ? - ",
        "option1": " A Buddhist place ",
        "option2": " One of the names of Buddha ",
        "option3": " A Buddhist Specimen of Art ",
        "option4": " A Buddhist text",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) The Milinda Panha (Questions of Milinda) is a Buddhist text which dates from approximately 100 BC. It purports to record a dialogue in which the Indo-Greek king Menander I of Bactria, who reigned in the 2nd century BC, poses questions on Buddhism to the sage Nagasena. "
    },
    {
        "question": " Well preferred tree fossil supposed to be from Jurasic Age in India is reported from : ",
        "option1": " Pithauragarh ",
        "option2": " Chhattisgarh ",
        "option3": " Ramgarh ",
        "option4": " Bahadurgarh",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) In a discovery that might excite geologists the world over, researchers of the State Forest Research and Training Institute (SFRTI) in Chhattisgarh, in November 2012, announced to have discovered tree fossils that date back about 250 million years - or the Jurassic age. The discovery could be a precursor to more such findings in the Sarguja region, known for its rich fossil reserves. "
    },
    {
        "question": " Which one of the following is not a sect of Buddhism ? ",
        "option1": " Mahayana ",
        "option2": " Hinayana ",
        "option3": " Digambar ",
        "option4": " Theravad",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) Digambara “sky-clad” is one of the two main sects of Jainism, the other being Svetambara. Generally, Digambara monks wear no clothes whereas Svetambara “white-clad” monks usually wear white clothes. "
    },
    {
        "question": " What is the first sermon of Buddha called as ? ",
        "option1": " Brahmajalasutta ",
        "option2": " Dhammachakkapabattanasutta ",
        "option3": " Kachchayanagottasutta ",
        "option4": " Mahaparinirvansutta",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) The first sermon Buddha gave to the five monks was called the Dhammacakkappavattana Sutta. It is also called the Setting in Motion of the Wheel of Dharma. "
    },
    {
        "question": " Buddha, Dhamma and Sangha together are known as ",
        "option1": " Triratna ",
        "option2": " Trivarga ",
        "option3": " Trisarga ",
        "option4": " Trimurti",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) The Three Jewels (triratna) are the three things that Buddhists take refuge in, and look toward for guidance, in the process known as taking refuge. The Three Jewels are: Buddha, Dhamma and Sangha. "
    },
    {
        "question": " Who was called Lichchavi Dauhitra ? ",
        "option1": " Chandragupta I ",
        "option2": " Skandagupta ",
        "option3": " Kumaragupta ",
        "option4": " Samudragupta",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) Chandragupta I was known as ‘Lichchavidauhitra.’ His marriage with the Lichchavi Princess Kumaradevi was one of the significant events in the Gupta rule. The importance of this marriage can be known further from Samudragupta’s Allahabad inscription in which he has described himself as “Lichchhavis-dauhitra or daughter’s son of the Lichchavis. "
    },
    {
        "question": " Mahavira’s first disciple was ",
        "option1": " Bhadrabahu ",
        "option2": " Sthulabhadra ",
        "option3": " Charvaka ",
        "option4": " Jamali",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) Jamali, who was husband of Anonja Priyadarshini, was the first disciple of Mahavira. He was Mahavira’s son-in-law. INDIAN HISTORY SGAE–101 "
    },
    {
        "question": " Vardhman Mahavir is also known as ",
        "option1": " Jena ",
        "option2": " Great teacher ",
        "option3": " Great preacher ",
        "option4": " Jain",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) Vardhamana Mahavira was also known as ‘Jina’ which literally means the ‘conqueror’. Jina refers to the one who has conquered love and hate, pleasure and pain, attachment and aversion, and has thereby freed `his’ soul from the karmas obscuring knowledge, perception, truth, and ability. It was from this word that Jainism was derived. "
    },
    {
        "question": " Which one of the following is not included in the ‘Eight Fold Path’ of Buddhism ? ",
        "option1": " Right Speech ",
        "option2": " Right Contemplation ",
        "option3": " Right Desire ",
        "option4": " Right Conduct",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) The Noble Eightfold Path is one of the principal teachings of the Buddha, who described it as the way leading to the cessation of suffering (dukkha) and the achievement of self-awakening. The path comprises right view, right aspiration, right speech, right action, right livelihood, right effort, right mindfulness, right concentration. "
    },
    {
        "question": " Which of the following dynasty succeeded the Mauryas ? ",
        "option1": " Satavahanas ",
        "option2": " Sungas ",
        "option3": " Yavanas ",
        "option4": " Pandya",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) The Sunga Empire was an ancient Indian dynasty from Magadha that controlled vast areas of the Indian Subcontinent from around 187 to 78 BCE. The dynasty was established by Pusyamitra Sunga, after the fall of the Maurya Empire. "
    },
    {
        "question": " The Buddhist monk who spread Buddhism in Tibet was ",
        "option1": " Nagarjuna ",
        "option2": " Ananda ",
        "option3": " Asanga ",
        "option4": " Padmasambhava",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) The most important event in the history of Tibetan Buddhism was the arrival of sage Padmasambhava in the 8th century. Padmasambhava translated numerous Buddhist texts into Tibetan language and combined tantric Buddhism with the local Bon religion to create what is today widely known as the Tibetan Buddhism. "
    },
    {
        "question": " King Kharvela was the greatest ruler of the Chedi Dynasty of ",
        "option1": " Cholamandalam ",
        "option2": " Kalinga ",
        "option3": " Kannauj ",
        "option4": " Purushpur",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) Kharvela was the third and greatest emperor of the Chedi dynasty of Kalinga (present-day Odisha). The main source of information about Kharavela is his famous Hanthigumpha inscription. During his reign, the Chedi dynasty ascended to eminence, which had been subdued since the devastating war with Ashoka. "
    },
    {
        "question": " Pulakesin II was the greatest ruler of the ",
        "option1": " Cholas of Tamil Nadu ",
        "option2": " Chalukyas of Badami ",
        "option3": " Chalukyas of Kalyani ",
        "option4": " Pallavas of Kanchi",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) Pulakesin II (610–642 AD) was the most famous ruler of the Chalukya dynasty. In his reign the Chalukyas of Badami saw their kingdom extend over most of the Deccan. "
    },
    {
        "question": " The Uttaramerur inscription provides information on the administration of the ",
        "option1": " Chalukyas ",
        "option2": " Satavahanas ",
        "option3": " Pallavas ",
        "option4": " Cholas",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) An inscription of the 8th century AD at Uttaramerur temple describes the constitution of the local council, eligibility and disqualifications for the candidates, the method selection, their duties and delimits their power in Chola dynasty. "
    },
    {
        "question": " Match the following (a) Chalukyas (b) Hoysalas (c) Rashtrakutas (d) Kakatiyas (i) Malkhed (ii) Vatapi (iii) Warangal (iv) Dwarasamudra ",
        "option1": " (a)-(ii), (b)-(iv), (c)-(i), (d)-(iii) ",
        "option2": " (a)-(iv), (b)-(iii), (c)-(i), (d)-(ii) ",
        "option3": " (a)-(i), (b)-(ii), (c)-(iii), (d)-(iv) ",
        "option4": " (a)-(iii), (b)-(ii), (c)-(iv),(d)-(i)",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) Chalukyas : Vatapi (Badami) ; Hoysalas : Dwarasamudra ; Rashtrakutas : Malkhed; and Kakatiyas: Warangal."
    },
    {
        "question": " Which one of the following is the principal source of information on Asoka’s campaign against Kalinga ? ",
        "option1": " Pillar Edict VII ",
        "option2": " Mahavamsa ",
        "option3": " Divyavadana ",
        "option4": " Rock Edict XIII",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) The vivid description of Kalinga war is given in 13th Rock Edict of Asoka. The edict gives description of the devastation caused to Kalinga due to war and how the Mauryan emperor felt remorse for it. "
    },
    {
        "question": " The Gandhara art flourished under : ",
        "option1": " the Kushanas ",
        "option2": " the Satavahanas ",
        "option3": " the Guptas ",
        "option4": " the Mauryas",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) Gandhara style flourished and achieved its peak during the Kushan period, from the 1st to the 5th centuries. It declined and suffered destruction after invasion of the White Huns in the 5th century. "
    },
    {
        "question": " Which one of the following inscriptions relate to the Chalukya king, Pulakesin II ? ",
        "option1": " Maski ",
        "option2": " Hathigumpha ",
        "option3": " Aihole ",
        "option4": " Nasik",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) The Aihole inscription were written by the Ravikirti, court poet of Chalukya King, Pulakesin II who reigned from 610 to 642 CE. This inscription gives information about the conquests of Pulakesin, especially how he defeated Harshavardhana. "
    },
    {
        "question": " Which dynasty immediately succeeded the Maurya dynasty and ruled Magadha Kingdom? ",
        "option1": " Satavahana ",
        "option2": " Sunga ",
        "option3": " Nanda ",
        "option4": " Kanva",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) The Sunga Dynasty, established by Pusyamitra Sunga, after the fall of the Maurya Empire. The last Mauryan emperor Brihadratha was assassinated by the then commander-in-chief of the Mauryan armed forces, Pusyamitra Sunga in 185 B.C. "
    },
    {
        "question": " The capital of the ancient Chola kingdom was ",
        "option1": " Uraiyur ",
        "option2": " Kaveripoompattinam ",
        "option3": " Thanjavur ",
        "option4": " Madurai",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) The Early Cholas of the pre and post Sangam period (300 BCE – 200 CE) were one of the three main kingdoms of the ancient Tamil country. Uraiyur, now Tiruchchirappalli was the ancient capital of the Chola Dynasty. "
    },
    {
        "question": " The script of the Indus Valley Civilization is ",
        "option1": " Kharosthi ",
        "option2": " Undeciphered ",
        "option3": " Brahmi ",
        "option4": " Tamil",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) Although these seals and samples of Indus writing have been floating around the scholastic world for close to 70 years, little progress has been made on deciphering this elegant script. The Indus script is an un-deciphered script. "
    },
    {
        "question": " Name the famous King of Kushan dynasty. ",
        "option1": " Kanishka ",
        "option2": " Pulakeshin ",
        "option3": " Harsha ",
        "option4": " Vikramaditya",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) Kanishka was the most famous emperor of the Kushan dynasty (127–151) who ruled an empire extending from Turfan in the Tarim Basin to Pataliputra on the Gangetic plain and famous for his military, political, and spiritual achievements. He convened the 4th Buddhist Council in Kashmir and provided encouragement to both the Gandhara school of GrecoBuddhist Art and the Mathura school of Hindu art. "
    },
    {
        "question": " Which of the following does not have a Stupa ? ",
        "option1": " Ranchi ",
        "option2": " Sanchi ",
        "option3": " Barhut ",
        "option4": " Dhamek",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) The Great Stupa at Sanchi was built by Mauryan emperor Ashoka. Dhamek Stupa in Sarnath is thought to be the oldest Stupa in existence. The stupa of Bharhut is between Allahabad and Jabalpur situated in the erstwhile Nagod state of Madhya Pradesh. "
    },
    {
        "question": " The site of birth [nativity] of Gautam Buddha is marked by : ",
        "option1": " a monastery ",
        "option2": " a “Rummindei Pillar” of Ashok Maurya ",
        "option3": " a statue ",
        "option4": " a Peepal Tree",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) Lumbini, the birthplace of Lord Buddha, is marked by a commemorative pillar erected by Mauryan Emperor Ashoka of India during his pilgrimage to the holy site in 249 BC. The inscription on the Ashoka Pillar indentifies the Sacred Garden – spread over 9 sq. km – as the spot where the Enlightened One was born. Lumbini was known as Rummindei in Asoka’s time. "
    },
    {
        "question": " Which one of the following tribal assemblies was normally involved in the election of the tribal chief ? ",
        "option1": " Samiti ",
        "option2": " Sabha ",
        "option3": " Gana ",
        "option4": " Vidata",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) Several tribal assemblies, such as sabha, samiti, vidatha, and gana mentioned in the Rig Veda exercised deliberative, military and religious functions. But from the political point of view important were the sabha and Samiti. We have also some traces of the election of tribal chiefs by the tribal assembly called the samiti. "
    },
    {
        "question": " During which of the following periods of Indian History did the Kshatriyas have a distinct identity ? ",
        "option1": " Age of the Buddha ",
        "option2": " Maurya period ",
        "option3": " Post-Maurya age ",
        "option4": " Gupta period",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) The Kshatriyas as the ‘khattiyas’ of Buddhist literature had a distinct identity at the time of the Buddha, but later their actual identity becomes vague. The same is also true of the Vaishyas. Of the three dvija castes, the Brahmin is the most easily identifiable as a concrete social group. "
    },
    {
        "question": " Chinese travellers visited India primarily because ",
        "option1": " they were interested in Buddhism ",
        "option2": " they were invited by the Indian kings ",
        "option3": " they were interested to study Indian culture ",
        "option4": " they were interested to stay in India",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) After the spread of the Buddhist religion, Chinese travelers came to India in big numbers to collect religious books and to visit holy places of Buddhism. Notable among those travellers included I-tsing, HaHsien and Hiuen Tsang. "
    },
    {
        "question": " The term ‘Upanishad’ literally implies ",
        "option1": " Knowledge ",
        "option2": " Wisdom ",
        "option3": " Sitting near ",
        "option4": " Recitation",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) Upanishad means “sitting down near”, referring to the student sitting down near the teacher while receiving esoteric knowledge. Monier-Williams’ Sanskrit Dictionary adds that, “Upanishad means ‘setting to rest ignorance by revealing the knowledge of the supreme spirit.’” "
    },
    {
        "question": " The Sage who is said to have Aryanised South India, was ",
        "option1": " Yagnavalkya ",
        "option2": " Vashistha ",
        "option3": " Agastya ",
        "option4": " Vishwamitra",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) Sage Agastya, often considered the father of traditional Indian Medicine, is also associated with the Aryanization of South India. The Yadavas of South India were the first to be aryanized. Agastya compiled the first Tamil grammar called Agathiyam. INDIAN HISTORY SGAE–102 "
    },
    {
        "question": " The origin of Indian music can be traced to which of the following Vedic Samhitas ? ",
        "option1": " Rigveda ",
        "option2": " Samaveda ",
        "option3": " Yajurveda ",
        "option4": " Atharvaveda",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) Organized Indian music owes its origin to the Sama Veda which was a collection (samhita) of hymns and detached verses from other Vedas, meant for recital. These hymns were sung by Udgatar priests at sacrifices in which the Soma ritual drink was offered in libation to various deities. "
    },
    {
        "question": " Ashok spread Buddhism all over India and Ceylon by ",
        "option1": " Teaching the Triratnas ",
        "option2": " Sending the Dharma Mahamatras ",
        "option3": " Waging wars ",
        "option4": " Becoming a Buddhist Monk",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) For the spread of Buddhism, Asoka sent missionaries (dharma mahamatras) all over India and beyond. The missionaries sent by Ashoka to the other countries were well received by them and the conversions took place easily because of the influence and the personal power Ashoka exercised. "
    },
    {
        "question": " In which Rock Edict Ashoka mentions about the casualities of Kalinga War and declares the renunciation of war ? ",
        "option1": " Maski Edict ",
        "option2": " Rock Edict XIII ",
        "option3": " Rock Edict XI ",
        "option4": " Rock Edict X",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) Rock Edict XIII and Minor Rock Edict I states that the human sufferings and mass killings due to the Kalinga War prompted Ashoka to take Buddhist religion and to adopt the path of ‘Dhamma Vijaya’ (win through religion) and ‘Ahimsa’ (non-violence). "
    },
    {
        "question": " The Earliest Settlements of Aryan tribes were at ",
        "option1": " Uttar Pradesh ",
        "option2": " Bengal ",
        "option3": " Sapta Sindhu ",
        "option4": " Delhi",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) The region where the Aryans settled in India around 1500 B.C. was called Sapta Sindhu (Seven Rivers), also referred to as the Brahmavarta. They spread to Indo-Gangetic plains in the later Vedic Period and this region came to be known as Aryavarta (1000 BC to 600 BC). "
    },
    {
        "question": " Pancha siddhantham of Varaha mihira deals with ",
        "option1": " Astrology ",
        "option2": " Astronomy ",
        "option3": " Medicine ",
        "option4": " Anatomy",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) The most famous work by Varahamihira is the treatise on mathematical astronomy called the Pancha Siddhantika (“Five Astronomical Treatises”). It is dated 575 AD. It is a summary of five earlier astronomical systems, namely the Surya, Romaka, Paulisa, Vasistha and Paitamaha. "
    },
    {
        "question": " Which one of the following coins was issued in silver during the Gupta period ? ",
        "option1": " Kakini ",
        "option2": " Nishka ",
        "option3": " Rupyaka ",
        "option4": " Dinar",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) The silver coins issued during the Gupta period were called ‘Rupaka.’ These coins were based on Sakas of Ujjaini weighing 32-36 grains. However, according to Fa-Hsien, cowries were the common means of exchange. "
    },
    {
        "question": " Lothal, the dockyard site of the Indus Valley Civilization, is situated in ",
        "option1": " Gujarat ",
        "option2": " Punjab ",
        "option3": " Pakistan ",
        "option4": " Haryana",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) Lothal is located in the Bhal region of Gujarat. It is situated near the village of Saragwala in the Dholka Taluka of Ahmedabad district. The nearest cities are Dholka and Bagodara. "
    },
    {
        "question": " Buddha means ",
        "option1": " Great Conqueror ",
        "option2": " Great Saint ",
        "option3": " Wise one ",
        "option4": " Enlightened one",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) The word ‘Buddha’ in Pali and Sanskrit means “Enlightened one”. The word has become synonymous with Buddha Shakyamuni (Siddhartha Gautama) who is also known as Gautam Buddha. "
    },
    {
        "question": " Varahamihira was ",
        "option1": " An Astronaut ",
        "option2": " A Space Shuttle ",
        "option3": " A Power Station ",
        "option4": " An Ancient Astronomer",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) Varahamihira was an Indian astronomer, mathematician, and astrologer who lived in Ujjain in the 6th century A.D. He is considered to be one of the nine jewels (Navratnas) of the court of legendary ruler Yashodharman Vikramaditya of Malwa."
    },
    {
        "question": " During the reign of Bindusara there was unrest at_____. ",
        "option1": " Ujjayani ",
        "option2": " Pushkalavati ",
        "option3": " Takshsila ",
        "option4": "Rajagriha",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) During the reign of Bindusara, Chandragupta Maurya’s son and successor, there was unrest at Taxila in the north-western province of Sindh. He sent Asoka (his son) to quell the uprising. Taxila was a highly volatile place because of the Indo-Greek presence and mismanagement of Governor Susima. "
    },
    {
        "question": " Name the Greek Ambassador at the Mauryan Court. ",
        "option1": " Alexander ",
        "option2": " Megasthanese ",
        "option3": " Plato ",
        "option4": " Aristotle",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) Megasthenes was a Greek ethnographer and explorer who served as an ambassador of Seleucus I of the Seleucid dynasty to Chandragupta Maurya. His ‘Indika,’ throws light on the contemporary society, religious beliefs and social stratification. "
    },
    {
        "question": " Who was the contemporary South Indian ruler of Harshavardhana ? ",
        "option1": " Krishnadevaraya ",
        "option2": " Pulakeshin II ",
        "option3": " Mayuravarma ",
        "option4": " Chikkadevaraja Wodeyar",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) Harshavardhana (606 to 647 AD) and Pulakesin II (610–642 AD) were contemporaries to each other. According to the Aihole inscription, Pulakesin of the Chalukyan dynasty defeated Harshavardhana of Kannauj on the banks of the Narmada. "
    },
    {
        "question": " Which one of the following is the most lasting contribution of the Rastrakutas ? ",
        "option1": " Kailasha Temple ",
        "option2": " Pampa, Ponna, Ranna, the three writers of Kannada poetry and Kailasha Temple. ",
        "option3": " Patronage of Jainism ",
        "option4": " Conquests",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) The Kannada literature reached great heights under the Western Chalukyas and the Rashtrakutas who succeeded them. King Amoghavarsha I was himself one of the gems of Kannada. Adikavi Pampa, Sri Ponna and Ranna, called the “three gems” of Kannada literature, found enthusiastic patronage from Rashtrakuta rulers. Similarly, the Kailasa temple is a contribution of the Rashtrakutas. "
    },
    {
        "question": " Ravikirti, a jain, who composed the Aihole Prashasti, was patronized by ",
        "option1": " Pulakeshin I ",
        "option2": " Harsha ",
        "option3": " Pulakeshin II ",
        "option4": " Kharavela",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) Ravikirti was the court poet of Chalukya King, Pulakesin II who reigned from 610 to 642 A.D. He authored the Aihole inscription at Meguti Temple which describes the defeat of Harshavardhana by Pulakesin II and the shifting of the capital from Aihole to Badami. "
    },
    {
        "question": " The original founder of the Manuscripts and Editor of Kautilya’s Athashastra was ",
        "option1": " Srikanta Shastri ",
        "option2": " Srinivasa Iyangar ",
        "option3": " R. Shamashastri ",
        "option4": " William Jones",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) In 1905, R. Ramashashtri discovered and published the Arthashastra, an ancient Indian treatise on statecraft. He transcribed, edited and published the Sanskrit edition in 1909. He proceeded to translate it into English, publishing it in 1915. "
    },
    {
        "question": " From which among the following rulers has the Government of India borrowed and adopted its symbols ? ",
        "option1": " Ashoka ",
        "option2": " Krishnadevaraya ",
        "option3": " Pulakesin ",
        "option4": " Kanishka",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) The National Emblem of India is derived from the time of the Emperor Ashoka. It is a replica of the Lion of Sarnath, near Varanasi in Uttar Pradesh. The Lion Capital was erected in the Emperor Ashoka in 3rd century B.C. to mark the spot where Buddha first proclaimed his gospel of peace and emancipation. "
    },
    {
        "question": " 6th century B.C. was an age of ",
        "option1": " Reasoning ",
        "option2": " Intellectual awakening ",
        "option3": " Political unrest ",
        "option4": " Religious ferment",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) The 6th century B.C was an age of religious ferment in the world. In India, it witnessed the birth of Buddhism and Jainism. It was in the same period that Heraclitus preached his new doctrines in the Greek island of Ionia; Zoroaster launched his protest against the prevailing religious superstitions in Iran and Confucius showed a new way of life in China. "
    },
    {
        "question": " Which of the following countries has asked India to return the famous ‘Dancing Girl’ statue from Mohenjodaro ? ",
        "option1": " Bangladesh ",
        "option2": " Bhutan ",
        "option3": " China ",
        "option4": " Pakistan",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) The Sindh government of Pakistan, in February 2014, requested Islamabad for asking India to return the famous statue of the Dancing Girl, which is in possession of the Indian authorities since 1946. The 10.8-cm bronze statue, made in 2500 BC, is on display at the National Museum in New Delhi. "
    },
    {
        "question": " Who is the founder of Jainism in India ? ",
        "option1": " Gautama ",
        "option2": " Mahavira ",
        "option3": " Chandragupta ",
        "option4": " Ashoka",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) According to Jain scriptures, Vardhaman Mahavira, the 24th and last Tirthankara founded Jainism as a faith in the 5th or 6th century B.C. The religion derives its name from the jinas (“conquerors”), a title given to twenty-four great teachers (Tirthankara) through whom their faith was revealed. "
    },
    {
        "question": " Who compiled the tales of “The Panchatantra” ? ",
        "option1": " Valmiki ",
        "option2": " VedaVyasa ",
        "option3": " Vishnu Sharma ",
        "option4": " Tulsidas",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) The Panchatantra is attributed to Vishnu Sharma. It an ancient Indian collection of inter-related animal fables in verse and prose arranged within a frame story. The original Sanskrit work, some scholars believe was composed around the 3rd century BC. "
    },
    {
        "question": " Ajanta Caves were built during period of ",
        "option1": " Gupta ",
        "option2": " Kushana ",
        "option3": " Maurya ",
        "option4": " Chalukya",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) The Ajanta Caves in Aurangabad district of Maharashtra, are about 30 rock-cut Buddhist cave monuments which date from the 2nd century BCE to about 480 or 650 A.D. Most of them were constructed during Gupta Period. "
    },
    {
        "question": " Which was the backbone of Indus Economy ? ",
        "option1": " Agriculture ",
        "option2": " Trade ",
        "option3": " Wheel Made Pottery ",
        "option4": " Carpentry",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) As in most other contemporary civilizations, agriculture was the backbone of the Indus economy. The people made extensive use of the wooden plows. Barley and wheat were the main food crops. Agriculture sustained the rudimentary urban centers that emerged (Studies in World History Volume 1 by James P. Stobaugh). INDIAN HISTORY SGAE–103 "
    },
    {
        "question": " The author of ‘Arthashastra’ was a contemporary of ",
        "option1": " Ashoka ",
        "option2": " Chandragupta Maurya ",
        "option3": " Samudragupta ",
        "option4": " Chandragupta Vikramaditya",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) The Arthashastra was authored by Kautilya, also known as Vishnugupta, who was a contemporary and mentor of Chandragupta Maurya, founder of the Mauryan Empire. It is an ancient Indian treatise on statecraft, economic policy and military strategy, written in Sanskrit. "
    },
    {
        "question": " Which one of the following was the book written by Amoghvarsha the Rashtrakuta King ? ",
        "option1": " Adipurana ",
        "option2": " Ganitasara Samgraha ",
        "option3": " Saktayana ",
        "option4": " Kavirajamarga",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) ‘Kavirajamarga’ (meaning “Royal Path for Poets”) was written by the famous Rashtrakuta King “Nrupatunga” Amoghavarsha I. it is the earliest available writing on rhetoric, poetics and grammar in the Kannada language. It was written around 850 A.D. "
    },
    {
        "question": " Who built the Kailasanatha Temple at Ellora ? ",
        "option1": " Rajendra I ",
        "option2": " Mahendra Varman I ",
        "option3": " Krishna I ",
        "option4": " Govinda I",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) The Kailasa temple was built by the Rashtrakuta king Krishna I in the 8th century A.D. It is a megalith carved out of one single rock, one of the 34 monasteries and temples known collectively as the Ellora Caves. It is a remarkable example of Dravidian architecture. "
    },
    {
        "question": " The land measures of the Second Pandyan Empire was mentioned in ",
        "option1": " Thalavaipuram Copper Platces ",
        "option2": " Uttirameru Inscription ",
        "option3": " Kudumiyammalai Inscription ",
        "option4": " Kasadudi Copper Plates",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) The Thalavaipuram copper plate brought out during 1018 and 1054 A.D by the Pandyan kings, describes land system, giant waves, etc. For example, it mentions six qualifications for a Brahmin to get land as a gift from the king. Kasakudi plates and Uthiramerur inscription are related to the Pallava and Chola dynasties respectively. "
    },
    {
        "question": " Who was the greatest ruler of the Satavahanas ? ",
        "option1": " Satkami I ",
        "option2": " Gautamiputra Satkarni ",
        "option3": " Simuka ",
        "option4": " Hala",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) Gautamiputra Satakarni (78-102 A.D) is often acknowledged by historians as the greatest of the Satavahana rulers. He defeated the Yavanas, Sakas, and Pallavas and re-established the ancient glory of the Satavahanas. He performed two Ashwamedha sacrifices. "
    },
    {
        "question": " The word ‘Buddha’ means ",
        "option1": " A Conqueror ",
        "option2": " A Liberator ",
        "option3": " A Enlibhtened one ",
        "option4": " A Wanderer",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) The word Buddha means \"awakened one\" or \"the enlightened one\". \"Buddha\" is also used as a title for the first awakened being in an era. Gautam Buddha was born as Siddhartha in a royal family; he began to be called the Buddha after attaining enlightenment under the Bodhi tree in Gaya. "
    },
    {
        "question": " Who built the famous Vaikunta Perumal temple at Kanchipuram ? ",
        "option1": " Narasimna Varman II ",
        "option2": " Parmeshvara Varman II ",
        "option3": " Nandi Varman II ",
        "option4": " Aparajita Varman",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) Thiru Parameswara Vinnagaram or Vaikunta Perumal Temple in Kanchipuram is believed to have been built by the Pallava king Nandivarman II, with later contributions from Medieval Cholas and Vijayanagara kings. It is constructed in the Dravidian style of architecture."
    },
    {
        "question": " The first to invade India were the ",
        "option1": " Aryans ",
        "option2": " Greeks ",
        "option3": " Persians ",
        "option4": " Arabs",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) A majority of historians believe that the Aryans were the first to invade India in the later stages of the Indus Valley Civilization around 1700 B.C. The Aryans came to India in bands and over several centuries in the 2nd millennium B.C. Historians are divided on the issue of their original homeland. "
    },
    {
        "question": " Name the oldest Indian civilization. ",
        "option1": " Indus Valley civilization ",
        "option2": " Mesopotamian civization ",
        "option3": " Egyptian civilization ",
        "option4": " None of these",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) Indus Valley civilization was the oldest civilization to have flourished in the Indian subcontinent. Generally dated between 3000 B.C to 1800 B.C, it was one of three early civilizations of the Old World along with Ancient Egypt and Mesopotamia. It was a Bronze Age civilization. "
    },
    {
        "question": " Who among the following Mughal rulers has been called the ‘Prince of Builders’? ",
        "option1": " Akbar ",
        "option2": " Jahangir ",
        "option3": " Shah Jahan ",
        "option4": " Babur",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) Shah Jahan was a great builder and he built many splendid buildings. That is why many scholars called him the ‘Engineer King’ or ‘Prince of Builders,’ etc. apart from building the Taj Mahal which is justly regarded as a jewel of the builder’s art; he also built he Jama Masjid, the Red Fort, etc. "
    },
    {
        "question": " Name the kingdom which first used elephants in wars? ",
        "option1": " Kosala ",
        "option2": " Magadha ",
        "option3": " Champa ",
        "option4": " Avanti",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) Elephants were always part of warfare in India. However, it were the rulers of Magadha who first employed elephants as a weapon of large-scale destruction. According to Plutarch, at the time of Alexander’s invasion of India, the Nanda army comprised 6,000 war elephants which discouraged Alexander’s men from further advancement. According to Megasthenes, Chandragupta Maurya’s army consisted of 9,000 war elephants. "
    },
    {
        "question": " The greatest king of the Pratihara dynasty was ",
        "option1": " Vatsaraj ",
        "option2": " Bhoj (Mihir-Bhoj) ",
        "option3": " Dantidurga ",
        "option4": " Nagbhatta II",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) Mihira Bhoja I (836–885 CE) or Bhoja I is considered as the greatest and most powerful ruler of the Pratihara dynasty. At its height, Bhoja’s empire extended to Narmada River in the South, Sutlej River in the northwest, and up to Bengal in the east. He was a scholar as well. "
    },
    {
        "question": " Who is considered founder of the Gupta Empire ? ",
        "option1": " Srigupta ",
        "option2": " Samudra Gupta ",
        "option3": " Chandra Gupta I ",
        "option4": " Chandra Gupta II",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) The history of the Gupta dynasty begins with its founding by Sri-Gupta around 240 CE. He has been described as Maharaja in edicts. The most likely time for the reign of Sri Gupta is c. 240–280 CE. Chinese traveller I-Tsing mentioned about Sri Gupta in his writings. "
    },
    {
        "question": " Kautilya’s “Arthashastra” mainly deals with ____ : ",
        "option1": " Political state craft ",
        "option2": " Social aspects ",
        "option3": " Economic doctrines ",
        "option4": " Military aspects",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) The Arthashastra is an ancient Indian treatise on statecraft, economic policy and military strategy, written by Kautilya. It is essentially a book of state and administrative system and deals with the art of government and politics. It is a comprehensive manual on how a state ought to be ruled and administered by a king and his administration. "
    },
    {
        "question": " One of the following Indus Valley sites is in Pakistan : ",
        "option1": " Lothal ",
        "option2": " Kalibangan ",
        "option3": " Alamgirpur",
        "option4": " Harappa",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) Harappa is an archaeological site in Punjab, Pakistan. The site takes its name from a modern village located near the former course of the Ravi River. Harappa contains the ruins of a Bronze Age fortified city, which was part of the Cemetery H culture and the Indus Valley Civilization, centered in Sindh and the Punjab. "
    },
    {
        "question": " Who was the author of Telugu Work Amuktamalyada ? ",
        "option1": " Harihara ",
        "option2": " Devaraya ",
        "option3": " Krishnadevaraya ",
        "option4": " Bukka",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) Krishnadevaraya (1509–1530), the greatest” emperor of the Vijayanagara Empire, composed Amuktamalyada. Considered a masterpiece in Telugu literature, the epic poem is believed to have been written and dedicated to Lord Venkateswara. The administration of the empire was carried on along the lines indicated in his Amuktamalyada. "
    },
    {
        "question": " Who composed the Allahabad Pillar inscription? ",
        "option1": " Harisena ",
        "option2": " Mahasena ",
        "option3": " Veerasena ",
        "option4": " Vishnusena",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) The Allahabad Pillar inscription or Allahabad Prasasti is one of the most important epigraphic evidences of the imperial Guptas. It was composed by Harisena, the court poet and minister of Samudragupta. It delineates a vivid description of the reign and conquests of Samudragupta. "
    },
    {
        "question": " Who built the famous Shiva temple at Ellora ? ",
        "option1": " Rashtrakuta Ruler Krishna I ",
        "option2": " Mauryan Emperor Ashoka ",
        "option3": " Gupta King Samudra Gupta ",
        "option4": " Chalukyan King Pulikeshi II",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) The Kailasa temple at Ellora, Maharashtra, was built in the 8th century by the Rashtrakuta king Krishna I as attested in Kannada inscriptions. This is one of the 34 temples and monasteries known collectively as the Ellora Caves. It is a megalith carved out of one single rock. "
    },
    {
        "question": " Which of the Kushana ruler patronised Buddhism? ",
        "option1": " Ashoka ",
        "option2": " Vikramaditya ",
        "option3": " Kanishka ",
        "option4": " Kautilya",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) Kushana, the most famous Kushana ruler, patronized Buddhism. The Fourth Buddhist Council, in which Buddhism got split into two different schools – Hinayana and Mahayana – was held during his reign in Kashmir. He also patronized the Buddhist scholars – Vasumitra, Asvagosha and Nagarjuna. INDIAN HISTORY SGAE–104 "
    },
    {
        "question": " Which of the following was the early capital of the Rashtrakutas? ",
        "option1": " Sopara ",
        "option2": " Ellora ",
        "option3": " Vatapi ",
        "option4": " Ajanta",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) There is uncertainty about the location of the early capital of the Rashtrakutas. However, since most of the Rashtrakuta monuments are found at Ellora (Ilapura), with nothing correspondence at Malkhed (Manyakhet), it has been suggested that the early Rashtrakuta capital was located in the vicinity of the Ellora caves in the time of Dantidurga who was the founder and first ruler of the dynasty. Later, Amoghavarsha I made Manyakhet his capital that remained the Rashtrakutas' regal capital until the end of the empire. "
    },
    {
        "question": " Whose army did Alexander, the Greek ruler confront on the banks of the river Jhelum ? ",
        "option1": " Chandragupta Maurya ",
        "option2": " Ambi ",
        "option3": " Dhanananda ",
        "option4": " Porus",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) The Battle of the Hydaspes was fought by Alexander the Great in 326 BC against King Porus of the Paurava kingdom on the banks of the river Hydaspes (Jhelum) in the Punjab near Bhera. The battle resulted in a complete Macedonian victory and the annexation of the Punjab.dragupta gave away his throne to his son, Bindusara, and spent his life as an ascetic. He accepted Jainism and spent his last days at Sravanabelagola in Karnataka along with Bhadrabahu. He gave up his life by the strict Jain ritual of sallakhena. "
    },
    {
        "question": " Find the odd one : ",
        "option1": " Samveda ",
        "option2": " Yajurveda ",
        "option3": " Vishnu Purana",
        "option4": " Rigveda",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) There are four Vedas: the Rig-Veda, the Yajur Veda, the Sama Veda and the Atharva Veda. On the other hand, Vishnu Purana is a religious Hindu text and one of the eighteen Mahapuranas. It has been given the name Puranaratna. "
    },
    {
        "question": " Which Indian rular fought the Kalinga War? ",
        "option1": " Samudragupta ",
        "option2": " Chandragupta ",
        "option3": " Shivaji ",
        "option4": " Ashoka",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) The Kalinga War was fought between the Mauryan Emperor Ashoka and Raja Anantha Padmanabhan of Kalinga in 262-261 B.C. It was the only major war Ashoka fought after his accession to throne. However, it is one of the major and bloodiest battles in world history. The bloodshed of this war is said to have prompted Ashoka to adopt Buddhism. "
    },
    {
        "question": " Name the Republic which was a confederacy of tribes in the 6th century B.C. ",
        "option1": " Gandhara ",
        "option2": " Vajji ",
        "option3": " Kosala ",
        "option4": " Avanti",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) Vajji or Vrijji was a confederacy in the 6th century B.C. The rulers of Vajji were a confederacy of the eight clans (atthakula) of whom the Vajjis, the Licchavis, the Jnatrikas and the Videhas were the most important. It was one of the sixteen Mahajanapadas. "
    },
    {
        "question": " A collective term used by the Jains for their sacred books is ",
        "option1": " Prabandhas ",
        "option2": " Angas ",
        "option3": " Nibandhas ",
        "option4": " Charits",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) The sacred books of the Jains are collectively called agama. Comprising fifty separate works which differ in small matters, the texts are written mainly in ArdhaMagadhi Prakrit and Sauraseni. The canon also includes 14 ‘Purva’ or ‘earlier’ works attributed in part to Mahavira and number of anga sections composed by Mahavira’s disciples, besides various other books of rules. "
    },
    {
        "question": " In which of the following mudra did Gautam Buddha delivered his first sermon at Sarnath? ",
        "option1": " Abhaya Mudra ",
        "option2": " Dhyana Mudra ",
        "option3": " Dharmachakra Mudra ",
        "option4": " Bhumisparsa Mudra",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) Dharmachakra in Sanskrit means ‘Wheel of Dharma’. This mudra symbolizes one of the most important moments in the life of Buddha, the occasion when he preached to his companions the first sermon after his Enlightenment in the Deer Park at Sarnath. This event is often referred to as the setting into motion of the Wheel of the teaching of the Dharma. "
    },
    {
        "question": " Kamarup is an ancient name of which region of India ? ",
        "option1": " Bihar ",
        "option2": " Rajasthan ",
        "option3": " Karnataka ",
        "option4": " Assam",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) Ancient Assam was known as Pragjyotisha in early times and as Kamarupa in later times. It came to be known as Kamarupa during the Puranic times,based on the legend that Kamadeva, the god of love, the Indian Cupid,who was destroyed by the fiery glance of Siva returned to life there. The first historic reference to the kingdom of Kamarupa is made in the Allahabad Pillar Inscription of Samudragupta. "
    },
    {
        "question": " Who among the following was ruler from The Kushan dynasty ? ",
        "option1": " Vikramaditya ",
        "option2": " Danti Durga ",
        "option3": " Khadphises I ",
        "option4": " Pushyamitra",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) Kujula Kadphises (also known as Kadphises I) is believed to be the founder of Kushana dynasty in India in 78 A.D. According to the Rabatak inscription, he was the grandfather of the great Kushan king Kanishka I. "
    },
    {
        "question": " What is the popular name of Monolithic rock shrines at Mahabalipuram ? ",
        "option1": " Rathas ",
        "option2": " Prasad ",
        "option3": " Mathika ",
        "option4": " Gandhakuti",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) The Monolithic rock shrines at Mahabalipuram in Kanchipuram district of Tamil Nadu are also known as Rathas. Each of the five monuments in the complex resembles a chariot (ratha), and each is carved over a single, long stone or monolith, of granite which slopes in north-south direction with a slight incline.Dating from the late 7th century, it is attributed to King Mahendravarman I and his son Narasimhavarman I of the Pallava Kingdom. "
    },
    {
        "question": " The people of the Indus valley civilisation worshipped ",
        "option1": " Vishnu ",
        "option2": " Pashupati ",
        "option3": " Indra ",
        "option4": " Brahma",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) On the basis of discovery of the Pashupati Seal at the Mohenjo-Daro, historians and archaeologists have opined that the Indus people worshipped Lord Shiva who is the Lord of the Beast (Pashupati). The Pashupati seal depicts a three faced male god seated in a yogic posture, surrounded by a rhino and a buffalo on the right, and an elephant and a tiger on the left. "
    },
    {
        "question": " The Upanishads are the ",
        "option1": " Great Epics ",
        "option2": " Story Books ",
        "option3": " Source of Hindu Philosophy ",
        "option4": " Law Books",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) The Upanishadsare a collection of texts that contain some of the central philosophical concepts of Hinduism. They are commonly referred to as Vedanta, variously interpreted to mean either the “last chapters, parts of the Veda” or “the object, the highest purpose of the Veda”. The concepts of Brahman (Ultimate Reality) and Atman (Soul) are central ideas in the Upanishads."
    },
    {
        "question": " The word ‘Satyameva Jayate’ have been derived from which Upanishad? ",
        "option1": " Akshi Upanishad ",
        "option2": " Mundaka Upanishad ",
        "option3": " Garuda Upanishad ",
        "option4": " Mahavakya Upanishad",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) Satyameva Jayate (Truth Alone Triumphs) is a mantra from the ancient Indian scripture Mundaka Upanishad. Upon independence of India, it was adopted as the national motto. It is inscribed in Devanagari script at the base of the national emblem. "
    },
    {
        "question": " Tripitakas’ are sacred books of ",
        "option1": " Hindus ",
        "option2": " Jains ",
        "option3": " Parsis ",
        "option4": " Buddhists",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) The Tripitaka or Three Baskets is the oldest collection of Buddhist scriptures and includes many texts believed to be the words of the historical Buddha. The three Pitakas are Sutta Pitaka, Vinaya Pitaka and Abhidhamma Pitaka. These are canonical texts revered as exclusively authoritative in Theravada Buddhism. "
    },
    {
        "question": " With which religion is Kaivalya associated? ",
        "option1": " Buddhism ",
        "option2": " Jainism ",
        "option3": " Hinduism ",
        "option4": " Sikhism",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) Kaivalya is the Jain concept of salvation. According to Jainism, all things in existence are divided into two parts Jiva (i.e. living beings having a soul) and Ajiva (non-living things having no soul). The entanglement of living beings (Jiva) with things not having souls (Ajiva) is a source of all misery. Kaivalya is a result of a living beings becoming free of this entanglement. "
    },
    {
        "question": " The first Buddhist Council was held at _______ . ",
        "option1": " Kashmir ",
        "option2": " Rajagriha ",
        "option3": " Pataliputra ",
        "option4": " Vaishali",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) According to the scriptures of all Buddhist schools, the first Buddhist Council was held soon after the death of the Buddha at Rajagriha in Bihar around 400 B.C. It was held under the patronage of king Ajatashatru with the monk Mahakasyapa presiding. Its objective was to preserve the Buddha’s sayings (suttas) and the monastic discipline or rules (Vinaya). "
    },
    {
        "question": " Who was the founder of the Satvahana Empire? ",
        "option1": " Kanha ",
        "option2": " Simuka ",
        "option3": " Hala ",
        "option4": " Gautamiputra",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) Simuka was the founder of the Satavahana Dynasty. He is mentioned as the first king in a list of royals in a Satavahana inscription at Nanaghat. He is believed to have destroyed the Shunga Power in the Deccan with the aid of the Rathikas and Bhojakas. He reigned for around 23 years and was beheaded by his brother Kanha, who succeeded him. INDIAN HISTORY SGAE–105 "
    },
    {
        "question": " Gandhara Art is the combination of ",
        "option1": " Indo–Roman ",
        "option2": " Indo–Greek ",
        "option3": " Indo–Islamic ",
        "option4": " Indo–China",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) Gandhara art was a style of Buddhist visual art that developed from a merger of Greek, Syrian, Persian, and Indian artistic influences during the first few centuries of Christian era. The foreign influence is evident from the sculptures of Buddha in which they bear resemblance to the Greek sculptures. Both Shakas and Kushanas were patrons of Gandhara School."
    },
    {
        "question": " Ajanta Ellora Caves are situated near which of the following cities? ",
        "option1": " Mount Abu ",
        "option2": " Aurangabad ",
        "option3": " Bijapur ",
        "option4": " Madurai",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) The Ajanta Caves, comprising rock-cut Buddhist cave monuments, are located in Aurangabad district of Maharashtra. Ellora caves, one of the largest rockcut monastery-temple caves complexes in the world, are also located near Aurangabad. Ajanta and Ellora caves form one of the major tourist attractions in Marathwada region of Maharashtra. "
    },
    {
        "question": " Chalukya temples (Jain temples) at Dilwara are situated in ",
        "option1": " Madhya Pradesh ",
        "option2": " Uttar Pradesh ",
        "option3": " Rajasthan ",
        "option4": " Haryana",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) The Dilwara Jain temples are located near Mount Abu in Rajasthan. These temples were built by Jain laymen between the 11th and 13th centuries AD and are world-famous for their stunning use of marble. The Dilwara temples are a sacred pilgrimage place of the Jains. "
    },
    {
        "question": " Vikram Shila University was founded by ",
        "option1": " Chandra Gupta Maurya ",
        "option2": " Kanishka ",
        "option3": " Dharampala ",
        "option4": " Pulakesin II",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) Vikramashila University was established by King Dharmapala of the Pala dynasty in the 8th century A.D. Located at Bhagalpur in modern day Bihar, it was one of the two most important centres of Buddhist learning in India during the Pala empire, along with Nalanda. It developed into the intellectual center for Tantric Buddhism. "
    },
    {
        "question": " Who were the patrons of Sangama Literature? ",
        "option1": " Nayakas ",
        "option2": " Chandellas ",
        "option3": " Pandyas ",
        "option4": " Solankis",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) Sangam was the ancient academy, which enabled Tamil poets and authors to gather periodically to publish their work. The Sangam met periodically in the city of Madurai in South India under the patronage of the Pandya kings. Sangam literature comprises some of the oldest extant Tamil literature, and deals with love, war, governance, trade and bereavement. "
    },
    {
        "question": " Which of the following is not true about Ajanta Caves? ",
        "option1": " They are in Maharashtra ",
        "option2": " They are decorated with Buddhist Art ",
        "option3": " They depict the techniques used in Ancient India ",
        "option4": " They do not contain paintings of flora and fauna",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) The Ajanta Caves in Aurangabad district of Maharashtra are about 30 rock-cut Buddhist cave monuments which date from the 2nd century BC to about 480 or 650 CE. The caves include paintings and rock cut sculptures described as among the finest surviving examples of ancient Indian art, particularly expressive painting that present emotion through gesture, pose and form. Flora and fauna are depicted on the ceilings of the caves. "
    },
    {
        "question": " What is the Mehrauli Pillar in the complex of Qutub Minar primarily famous for? ",
        "option1": " Proverbial height ",
        "option2": " Skilful stone cutting ",
        "option3": " Excellent quality steel ",
        "option4": " Statue of Buddha on top",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) The Iron Pillar located in Delhi, is a 7 m (23 ft) column in the Qutb complex, notable for the rustresistant composition of the metals used in its construction. The pillar has attracted the attention of archaeologists and materials scientists because of its high resistance to corrosion. The corrosion resistance results from an even layer of crystalline iron hydrogen phosphate hydrate forming on the high phosphorus content iron, which serves to protect it from climate. "
    },
    {
        "question": " Which script was used in Ashoka’s inscriptions? ",
        "option1": " Brahmi ",
        "option2": " Devanagiri ",
        "option3": " Gurmukhi ",
        "option4": " Sanskrit",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) Most of Asokan inscriptions in the eastern parts of the Mauryan empire were written in Magadhi language, using the Brahmi script. Kharosthi script was used in the north-western parts of his empire. The Brahmi script was deciphered in 1837 by James Princep, an archaeologist, philologist, and official of the East India Company. "
    },
    {
        "question": " Who among the following was the court physician of Kanishka? ",
        "option1": " Vasumitra ",
        "option2": " Nagarjuna ",
        "option3": " Charaka ",
        "option4": " Patanjali",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) Charaka was the court physician of Kanishka I. He was one of the principal contributors to the ancient art and science of Ayurveda, a system of medicine and lifestyle developed in ancient India. He is sometimes referred to as the Father of Indian Medicine. "
    },
    {
        "question": " The veda which deals with the rituals is known as ",
        "option1": " Rigveda ",
        "option2": " Yajurveda ",
        "option3": " Samaveda ",
        "option4": " Atharvaveda",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) Yajur Veda is a step-by-step guide about the right way of performing religious ceremonies and sacred rituals. Derived from “yajus” meaning “prose mantra” and veda meaning “knowledge”), the Yajur veda is the Veda of prose mantras. An ancient Vedic Sanskrit text, it is a compilation of ritual offering formulas that were said by a priest at the time of ritual actions. "
    },
    {
        "question": " The capital of the Mauryan Kingdom was located at ",
        "option1": " Pataliputra ",
        "option2": " Vaishali ",
        "option3": " Lumbini ",
        "option4": " Gaya",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) Pataliputra, the ancient city of Patna in Bihar, served as the capital city of the Mauryan empire. It reached the pinnacle of prosperity under Chandragupta Maurya and Ashoka. Greek ambassador, Megasthenes, has left a detailed account of its splendor. Pataliputra was originally built by Magadha ruler Ajatsatru in 490 BC. "
    },
    {
        "question": " Where is the Brihadeshwar temple, built during the Chola period, located? ",
        "option1": " Mysore ",
        "option2": " Mahabalipuram ",
        "option3": " Thanjavur ",
        "option4": " Kanyakumari",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) The Brihadeshwara Temple is a Hindu temple dedicated to Lord Shiva located in Thanjavur in Tamil Nadu. Also known as Raja Rajeswara Temple, it was built by Chola ruler Raja Raja Chola I and completed in 1010. The temple is part of the UNESCO World Heritage Site known as the “Great Living Chola Temples.” "
    },
    {
        "question": " Who among the following was the first grammarian of the Sanskrit language? ",
        "option1": " Kalhana ",
        "option2": " Maitreyi ",
        "option3": " Kalidasa ",
        "option4": " Panini",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) Panini is considered as the first grammarian of Sanskrit language. He is particularly known for his formulation of the 3,959 rules of Sanskrit morphology, syntax and semantics in the grammar known as Ashtadhyayi, the foundational text of the grammatical branch of the Vedanga, the auxiliary scholarly disciplines of the historical Vedic religion. "
    },
    {
        "question": " To which ganarajya Gautam Buddha belonged? ",
        "option1": " Shibi ",
        "option2": " Shakya ",
        "option3": " Saurasena ",
        "option4": " Shabara",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) Gautam Buddha was born as a Kshatriya, the son of Suddhodana, “an elected chief of the Shakya clan”, whose capital was Kapilvastu. The Shakyas formed an independent republican state known as the Shakya Ganarajya.His mother, Maya, Suddhodana’s wife, was a Koliyan princess. "
    },
    {
        "question": " The school of Indian art which is also known as the Greco–Roman– Buddhist art is the _______ school ",
        "option1": " Mauryan ",
        "option2": " Shunga ",
        "option3": " Gandhara ",
        "option4": " Gupta",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) The Gandhara School of Art is also known as the Graeco-Buddhist School of Art since Greek techniques of art were applied to Buddhist subjects. The most important contribution of the Gandhara School of Art was the evolution of beautiful images of the Buddha and Bodhisattvas, which were modelled on identical characters of Graeco-Roman pantheon. The Gandhara School of art developed in first century AD during the reign of Kanishka. "
    },
    {
        "question": " Which of the following Pallava Kings assumed the title of “Vatapikonda” after defeating and slaying the great Chalukyan King Pulakesin II? ",
        "option1": " Narsimha Varman I ",
        "option2": " Mahendra Varman I ",
        "option3": " Parameshwar Varman I ",
        "option4": " Nandi Varman",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) The Pallava king Narsimhavarman I assumed the title of ‘Vatapikonda’ (Conqueror of Vatapi), when he defeated and killed Pulakesin II (Chalukya King) and captured the Chalukyan capital, Badami in 642 AD. The Pallava victory resulted in the commencement of Pallava occupation of Vatapi which lasted until 654. "
    },
    {
        "question": " Harsha moved his capital from _____ to _____ . ",
        "option1": " Thanesar, Kannauj ",
        "option2": " Delhi, Deogiri ",
        "option3": " Kamboj, Kannauj ",
        "option4": " Valabhi, Delhi",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) During the 7th century A.D, Harshavardhana united the kingdoms of Punjab, Bengal, Orissa along with a large portion of Indo-Gangetic Plain. He defeated the ruler of Kannauj and shifted his capital from Thanesar to Kannauj. "
    },
    {
        "question": " Which of the following Harappan sites had a dockyard? ",
        "option1": " Harappa ",
        "option2": " Mohenjodaro ",
        "option3": " Lothal ",
        "option4": " Alamgirpur",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) Lothal, located along the Bhogava river, a tributary of Sabarmati, in the Gulf of Khambat in Gujarat, was the only port-town of the Indus Valley Civilisation. It had a basin with vertical wall, inlet and outlet channels which has been identified as a tidal dockyard. Lothal’s dock was the earliest known dock found in the world, equipped to berth and service ships. INDIAN HISTORY SGAE–106 "
    },
    {
        "question": " Aryabhatta and Kalidasa were in the court of which Gupta Emperor ? ",
        "option1": " Kumara Gupta I ",
        "option2": " Chandra Gupta II ",
        "option3": " Samudra Gupta ",
        "option4": " Skanda Gupta",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) Aryabhata and Kalidasa adorned the court of Gupta ruler Chandragupta II who was also known as Chandragupta Vikramaditya. Kalidasa was a classical Sanskrit writer, who was one of the nine gems of Chandragupta’s court. Aryabhata was a mathematician and astronomer whose works include the Aryabhaiya and the Arya-siddhanta."
    },
    {
        "question": " The language in which Buddha preached? ",
        "option1": " Hindi ",
        "option2": " Urdu ",
        "option3": " Pali ",
        "option4": " Hebrew",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) Buddha preached his messages in Pali, the vernacular language spoken then in north India.The language of the ancient Buddhist scriptures was Pali. Tripitaka is the collection of the teachings of the Buddha in the Pali language. It consists of three sections of the Buddha’s Teachings:Vinaya Pitaka, Sutta Pitaka and Abhidhamma Pitaka. "
    },
    {
        "question": " Ashoka was a king of which dynasty? ",
        "option1": " Pradyota ",
        "option2": " Haryanka ",
        "option3": " Maurya ",
        "option4": " Nanda",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) Ashokawas an ancient Indian emperor of the Maurya Dynasty who ruled almost all of the Indian subcontinent from c.?268 to 232 BC. One of India’s greatest emperors, Ashoka reigned overthe entire Indian subcontinent except parts of present-day Tamil Nadu, Karnataka and Kerala. "
    },
    {
        "question": " ‘Mohan-jo-daro’ in Sindhi means ",
        "option1": " The city of evil spirits ",
        "option2": " The food of Pashupathi ",
        "option3": " The land of Shiva ",
        "option4": " The mound of the dead",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) Mohen jodaro is interpreted as “Mound of the Dead Men” in Sindhi, and as “Mound of Mohan” (where Mohan is Krishna). The city’s original name is unknown. Mohen jodaro is located west of the Indus River in Larkana District, Sindh, Pakistan. "
    },
    {
        "question": " What was Hampi known for ? ",
        "option1": " It was the capital of Golconda ",
        "option2": " It had the largest stable in medieval India ",
        "option3": " It had the translation of the Indian epics to Persian ",
        "option4": " It was the capital of Vijayanagara",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) Hampi in Karnataka served as the capital of the Vijayanagara Empire. It served as the capital of the Vijayanagara Empire from 1343 to 1565, when it was besieged by the Deccan Muslim confederacy. Hampi was chosen because of its strategic location, bounded by the Tungabhadra river on one side and surrounded by defensible hills on the other three sides. "
    },
    {
        "question": " Buddha gave his first sermon at the Deer Park in ",
        "option1": " Magadha ",
        "option2": " Sarnath ",
        "option3": " Sanchi ",
        "option4": " Lumbini",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) After attaining enlightenment at Bodh Gaya, Gautam Buddha went to Sarnath (ancient Isipatana) near Varanasi in Uttar Pradesh. It was at the deer park in Sarnath that he preached his first discourse onthe Four Noble Truthsto a group of five monks and set in motion the Wheel of Dharma. Sarnath is mentioned by the Buddha as one of the four places of pilgrimage."
    },
    {
        "question": "Where did the traveller Ibn Batuta come from ? ",
        "option1": " Morocco ",
        "option2": " Persia ",
        "option3": " Turkey ",
        "option4": " Central Asia",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) Ibn Batuta was a Berber Muslim Moroccan explorer, known for his extensive travels, accounts of which were published in the Rihla (“Journey”). Over a period of thirty years, he visited most of the known Islamic world as well as many non-Muslim lands; his journeys including trips to North Africa, the Horn of Africa, West Africa, Southern Europe and Eastern Europe in the West, and to the Middle East, South Asia, Central Asia, Southeast Asia and China in the East, a distance surpassing threefold his near-contemporary Marco Polo. Ibn Batuta is considered one of the greatest travellers of all time. "
    },
    {
        "question": "Who built the Khajuraho temples? ",
        "option1": " Holkars ",
        "option2": " Scindias ",
        "option3": " Bundela Rajputs ",
        "option4": " Chandela Rajputs",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) The Khajuraho Group of Monuments are located in Khajuraho, a town in the Indian state of Madhya Pradesh, located in Chhatarpur District. Khajuraho has the largest group of medieval Hindu and Jain temples, famous for their erotic sculptures. The city was the cultural capital of Chandela Rajputs, a Hindu dynasty that ruled this part of India from the 10-12th centuries. The political capital of the Chandelas was Kalinjar. The Khajuraho temples were built over a span of 200 years, from 950 to 1150. The Chandela capital was moved to Mahoba after this time, but Khajuraho continued to flourish for some time. Khajuraho has no forts because the Chandel Kings never lived in their cultural capital. "
    },
    {
        "question": "The ‘Kirti Stambha’ (Tower of Victory) at Chittor was built by— ",
        "option1": " Rana Pratap",
        "option2": " Rana Kumbha ",
        "option3": " Rana Sanga ",
        "option4": " Bappa Raval",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) Kirti Stambh is situated at Chittorgarh fort in Rajasthan, India. The 22 metre high tower was built by a Rana Kumbha to commemorate his victory against Mahmud Khilji of Malwa. The tower is built in the Solanki style. It is 30 feet at the base and narrows down to 15 feet at the top . It is dated approximately around the 12th century AD. Kirti Stambh is older than another tower in the same fort, known as the Vijay Stambh (Tower of Victory). "
    },
    {
        "question": "Who got the monumental ‘Rayagopurams’ in front of the temples at Hampi, Tiruv-annamalai, Chidambaram, Srirangam, Tirupati, etc., constructed? ",
        "option1": " Vidyaranya ",
        "option2": " Krishnadevaraya ",
        "option3": " Harihara ",
        "option4": " Rajaraja",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) Rajagopuram literally means Royal Tower, an entrance that is fit for royalty but especially for the God in the Temples. Krishnadevaraya is credited with the building of thousand pillared mandapas and the rayagopurams which were spread out throughout the country-side in South India. "
    },
    {
        "question": "Which of the following architectural wonders was not constructed in the 12th A.D.? ",
        "option1": " Sun-temple of Konark ",
        "option2": " Temple of Khajuraho ",
        "option3": " Ankorvat ",
        "option4": " Notre Dam, the Paris",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) Konark Sun Temple is a 13th century Sun Temple (also known as the Black Pagoda), at Konark, in Orissa. It was constructed from oxidized and weathered ferruginous sandstone by King Narasimhadeva-I (1238- 1250 CE) of the Eastern Ganga Dynasty. The temple is an example of Orissan architecture of Ganga dynasty. The temple is one of the most renowned temples in India and is a World Heritage Site. "
    },
    {
        "question": "Where was saint Kabir born ? ",
        "option1": " Delhi ",
        "option2": " Varanasi ",
        "option3": " Mathura ",
        "option4": " Hyderabad",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) Not much is known of Kabir’s birth parents, but it is known that he was brought up in a family of Muslim weavers. He was found by a Muslim weaver named Niru and his wife, Nima, in Lehartara, situated in Varanasi. Kabir’s family is believed to have lived in the locality of Kabir Chaura in Varanasi. Kabir ma?ha, located in the back alleys of Kabir Chaura, celebrates his life and times. "
    },
    {
        "question": "Which of the following languages was in vogue during Mughal period in the courts of India ? ",
        "option1": " French ",
        "option2": " Persian ",
        "option3": " Portugese ",
        "option4": " Arabic",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) Although early Mughals spoke the Chagatai language and maintained some Turko-Mongol practices, they became essentially Persianized and transferred the Persian literary and high culture to India, thus forming the base for the Indo-Persian culture. Persian language became the lingua franca of the court and empire. "
    },
    {
        "question": "The writer of Ram Charit Manas, Tulsidas, was related to which ruler ? ",
        "option1": " Chandragupta Maurya ",
        "option2": " Nawab Vajid Ali Sah ",
        "option3": " Harsha ",
        "option4": " Akbar",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) Akbar and Tulsidas were contemporary. It was because of the close friendship between the two that Akbar ordered a firman that followers of Rama, Hanuman & other Hindus, should not be harassed in his kingdom. Abdur Rahim Khankhana, famous Muslim poet who was one of the Navaratnas (nine-gems) in the court of the Mughal emperor Akbar, was a personal friend of Tulsidas. The historian Vincent Smith, the author of a biography of Tulsidas’ contemporary Akbar, called Tulsidas as the greatest man of his age in India and greater than even Akbar himself."
    },
    {
        "question": "Which Sufi’s dargah is at Ajmer? ",
        "option1": " Baba Farid ",
        "option2": " Qutb-din Bakhtiyar Kaki ",
        "option3": " Moinuddin Chisti ",
        "option4": " Khwaja Bahuddin",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) Moinuddin Chishti, also known as Gharib Nawaz “Benefactor of the Poor” was the most famous Sufi saint of the Chishti Order of the Indian Subcontinent who introduced and established the order in South Asia. Dargah Sharif or Ajmer Sharif is a sufi shrine of sufi saint, Moinuddin Chishti located at Ajmer, Rajasthan, India. The shrine has the grave (Maqbara) of the revered saint, Moinuddin Chisti. It is said that the brass candlesticks taken from the Kalika temple after its destruction were given to the Dargah Sharif shrine of Moinuddin Chishti is in Ajmer, a shrine that Akbar vowed to rebuild after his victory. "
    },
    {
        "question": "Who was the architect who designed ‘Taj Mahal’ ? ",
        "option1": " Mohammad Hussain ",
        "option2": " Ustad-Isa ",
        "option3": " Shah Abbas ",
        "option4": " Ismail",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) Isa Muhammad Effendi or Ustad Isa was a Persian architect from Iran he and his colleague Ismail Effendi entered the service of the Mughal Emperor Shah Jahan after the Ottoman Sultan Murad IV and the Mughals exchanged ambassadors. Isa Muhammad Effendi is often described as the chief architect of the Taj Mahal. Recent research suggests the Persian architect, Ustad Ahmad Lahauri was the most likely candidate as the chief architect of the Taj, an assertion based on a claim made in writings by Lahauri’s son Lutfullah Muhandis. "
    },
    {
        "question": "The Assam State derives its name from that of a tribe that conquered the region. Where did the tribesmen come from ? ",
        "option1": " Tibet ",
        "option2": " Mongolia ",
        "option3": " Burma (now Myanmar) ",
        "option4": " Siam (now Thailand)",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) The state of Assam derived its name from the word ‘Asom’ which means unequal or unrivalled. True to the meaning of its name, the state is unrivalled in terms of its natural beauty and the simplicity of the people. In the Mahabharata and the Puranas, Assam has been referred to as ‘Kamarupa’. The inhabitants of the state are a mixture of the Mongol-Aryan culture. The Ahoms ventured into Assam somewhere around 1228 A.D. The present name Assam derives from the name of a Sino-Tibetan tribe, the Ahoms, who came to Assam from China and Thailand, began their rule from 1228 AD and remained a force to reckon with in the political arena till 1828 AD. "
    },
    {
        "question": "Shah Jahan built the Moti Masjid at ",
        "option1": " Delhi ",
        "option2": " Jaipur ",
        "option3": " Agra ",
        "option4": " Amarkot",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) The Moti Masjid in Agra was built by Shah Jahan. During the rule of Shah Jahan the Mughal emperor, numerous architectural wonders were built. Most famous of them is the Taj Mahal. Moti Masjid earned the epithet Pearl Mosque for it shined like a pearl. It is held that this mosque was constructed by Shah Jahan for his members of royal court. The Moti Masjid boasts of extensive white marble facing, a typical stylistic feature of architecture during the reign of Shah Jahan. "
    },
    {
        "question": "Select the incorrectly matched pair of philosophers and their philosophies : ",
        "option1": " Sankaracharya Advaita ",
        "option2": " Ballabhacharya-Pure-Advaita ",
        "option3": " Chaitanya-Vishistha-Advaita ",
        "option4": " Charvak—Lokayat",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) Vishishtadvaita is a sub-school of the Vedanta (literally, end or the goal of Knowledge, Sanskrit) school INDIAN HISTORY SGAE–108 of Hindu philosophy, the other major sub-schools of Vedanta being Advaita, Dvaita, and Achintya-BhedaAbheda. VishishtAdvaita (literally “Advaita with uniqueness/qualifications”) is a non-dualistic school of Vedanta philosophy. Ramanuja, the main proponent of Visishtadvaita philosophy contends that the Prasthana Traya (“The three courses”) i.e. Upanishads, Bhagavad Gita, and Brahma Sutras are to be interpreted in way that shows this unity in diversity, for any other way would violate their consistency. "
    },
    {
        "question": "Who got constructed ‘Grand Trunk Road’ ? ",
        "option1": " Akbar ",
        "option2": " Ashoka ",
        "option3": " Shershah Suri ",
        "option4": " Samudra Gupta",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) The Grand Trunk Road is one of South Asia’s oldest and longest major roads. For several centuries, it has linked the eastern and western regions of the Indian subcontinent, running from Chittagong, Bangladesh through to Howrah, West Bengal in India, across north India into Peshawar (in present day Pakistan), up to Kabul, Afghanistan. The modern road was built by Sher Shah Suri, who renovated and extended the ancient route in the 16th century "
    },
    {
        "question": "What do you mean by Mughal Zagir ? ",
        "option1": " providing rent free land ",
        "option2": " zamindar’s property ",
        "option3": " giving officer a right to revenue ",
        "option4": " giving cash salary to Mansabdar",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) Zagir was a piece of land held by the mansabdar which was granted by the Sultan. Mansabdars were given control over an area of land, a ‘Zagir’ whose revenue was to be used for maintaining troops; if not given a ‘Zagir’ they were paid in cash through a complicated accounting system, with deductions for various things including ‘the rising of the moon’; it was a normal practice to pay for only eight or ten months in the year. The Mansabdars were allowed to keep five percent of the income of the ‘Zagir’ or five per cent of the salaries received. In Mughal period, zagir was the practice giving officer a right to revenue. "
    },
    {
        "question": "Which among the following fort was known as the ‘Key of Deccan’? ",
        "option1": " Kalinjar ",
        "option2": " Ajaygarh ",
        "option3": " Asirgarh ",
        "option4": " Gulbarga",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) Asirgarh Qila is an Indian fortress (qila) situated in the Satpura Range, in Burhanpur District of Madhya Pradesh state. The fortress commands a pass through the Satpuras connecting the valleys of the Narmada and Tapti rivers, one of the most important routes from northern India to the Deccan in the southwest. It is known as the “key to the Deccan”. "
    },
    {
        "question": "Select the correct order– ",
        "option1": " Nizamuddin Auliya, Kabir, Mirabai, Tulsidas ",
        "option2": " Mirabai, Kabir, Niza-muddin Auliya, Tulsidas ",
        "option3": " Kabir, Nizamuddin Auliya, Tulsidas, Mirabai ",
        "option4": " Tulsidas, Mirabai, Kabir, Nizamuddin Auliya",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) Nizamuddin Auliya (1238 – 3 April 1325), also known as Hazrat Nizamuddin, was a famous Sufi saint of the Chishti Order in the Indian Subcontinent. Kabir (1440–1518) was a mystic poet and sant of India, whose writings have greatly influenced the Bhakti movement. Meerabai (c. 1498 – c. 1547 AD) was an aristocratic Hindu mystical singer and devotee of Lord Krishna from Rajasthan and one of the most significant figures of the Sant tradition of the Vaishnava bhakti movement. Tulsidas (1497/1532–1623) was a Hindu poet-saint, reformer and philosopher renowned for his devotion for the god Rama. "
    },
    {
        "question": "In Shivaji’s Council of Ministers the Prime Minister was called ",
        "option1": " Peshwa ",
        "option2": " Sachiv ",
        "option3": " Mantri ",
        "option4": " Samanta",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) A Peshwa was the titular equivalent of a modern Prime Minister. Emperor Shivaji created the Peshwa designation in order to more effectively delegate administrative duties during the growth of the Maratha Empire. The word Peshwa has roots in the Persian language meaning ‘foremost’. After the coronation of Shivaji in 1674, he appointed Moropant Trimbak Pingle as the first Peshwa. "
    },
    {
        "question": "Muhammad-Bin-Tughlaq was proficient in ",
        "option1": " Art ",
        "option2": " Music ",
        "option3": " Calligraphy ",
        "option4": " Philosophy",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) Muhammad Tughluq was a scholar versed in logic, philosophy, mathematics, astronomy and physical sciences. He had knowledge of medicine and was skillful in dialectics. He was also a calligrapher. He was well versed with several languages like Persian, Arabic, Turkish and even Sanskrit. "
    },
    {
        "question": "The battle that led to the foundation of Muslim power in India was ",
        "option1": " The first battle of Tarain ",
        "option2": " The second battle of Tarain ",
        "option3": " The first battle of Panipat ",
        "option4": " The second battle of Panipat",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) The Battles of Tarain, also known as the Battles of Taraori, were fought in 1191 and 1192 near the town of Tarain, near Thanesar in present-day Haryana, between the Muslim Ghurid army led by Sultan Shahabuddin Muhammad Ghauri and the Hindu Rajput army led by Prithviraj Chauhan. Prithviraj Chauhan was defeated in the Second Battle of Tarain which led the foundation of the Sultanate of Delhi. Delhi remained under Muslim rule for over six centuries till 1857. "
    },
    {
        "question": "The most important Sufi shrine in India is at ",
        "option1": " Pandua ",
        "option2": " Bidar ",
        "option3": " Ajmer ",
        "option4": " Shahjahanabad",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) Ajmer is famous for the Dargah Sharif of Khwaja Moinuddin Chishti which is situated at the foot of the Taragarh hill, and consists of several white marble buildings arranged around two courtyards, including a massive gate donated by the Nizam of Hyderabad and the Akbari Mosque, built by the Mughal emperor Shah Jahan. It contains the domed tomb of the saint. Akbar and his queen used to come here by foot on pilgrimage from Agra every year in observance of a vow when he prayed for a son. "
    },
    {
        "question": "Which of the following is associated with Sufi saints ? ",
        "option1": " Tripitaka ",
        "option2": " Dakhma ",
        "option3": " Khanqah ",
        "option4": " Synagogue",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) A khanqah also known as a ribat is a building designed specifically for gatherings of a Sufi brotherhood, or tariqa, and is a place for spiritual retreat and character reformation. In the past, and to a lesser extent nowadays, they often served as hospices for Sufi travelers (salik) and Islamic students (talib). Khanqahs are very often found adjoined to dargahs (shrines of Sufi saints), mosques and madrasas (Islamic schools). "
    },
    {
        "question": "Which of the following powers did not fight for the Tungabhadra Doab ? ",
        "option1": " Pallavas and Chalukyas ",
        "option2": " Cholas and later Chalukyas of Kalyana ",
        "option3": " Golconda and Ahmadnagar Sultanates ",
        "option4": " Vijayanagar and Bahmani kingdoms",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) The kingdoms of Golconda and Ahmednagar did not contend for the Tungabhadra Doab. "
    },
    {
        "question": "Which of the following aspects is not common to both Bhakti movement and Sufi movement? ",
        "option1": " Personal love for God ",
        "option2": " Worship of idols ",
        "option3": " Mysticism ",
        "option4": " Visit to holy shrines",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) The Bhakti Movement stressed on the mystical union of the individual with God. The sufi movement laid great emphasis on love and devotion as the bond between God and the individual soul. The stress was on direct communion with God and forsaking dogmatic rituals. "
    },
    {
        "question": "Ranthambhor was ",
        "option1": " a Mughal palace ",
        "option2": " a Rajput fort ",
        "option3": " capital of the Khaljis ",
        "option4": " a Buddhist pilgrimage centre",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) Ranthambore Fort is a formidable fort and has been a focal point of historical developments of Rajasthan. It is situated near Sawai Madhopur town in Rajasthan. This fort is known for the glory and valor of brave Hammir Dev of Chauhan dynasty. The fortress was captured by the kingdom of Mewar under Rana Hamir Singh (1326–1364) and Rana Kumbha (1433–1468). After the reign of Rana Kumbha’s successor Rana Udai Singh I (1468–1473) the fortress passed to the Hada Rajputs of Bundi. Sultan Bahadur Shah of Gujarat captured the fortress from 1532 to 1535  . The Mughal Emperor Akbar captured the fortress in 1559 . "
    },
    {
        "question": "‘Lakh Baksh’ was a title given to the ruler ",
        "option1": " Iltutmish ",
        "option2": " Balban ",
        "option3": " Raziya ",
        "option4": " Qutub-ud-din Aibak",
        "answar": "4",
        "category": "indian history",
        "explain": "  (4) Sultan Qutb-ud-din Aibak also called “Lakh Baksh Sultan” (the donator of hundreds of thousands) was the first Muslim Emperor of India who ruled from his capital in Delhi where he built Qutb Minar and the Quwwat Al Islam mosque. He was of Turkic descent from central Asia, Turkic ruler, the first Sultan of Delhi and founder of the Slave dynasty (also known as the Ghulam dynasty) of India. He ruled as an emperor for only four years, from 1206 to 1210 but because of his super efficient administration and farsighted vision, his name has become inseparable from the history of South Asia. "
    },
    {
        "question": "Who is considered as the greatest of all the Vijayanagar rulers? ",
        "option1": " Krishnadeva Raya ",
        "option2": " Vira Narasimha ",
        "option3": " Sadasiva Raya ",
        "option4": " Rama Raya",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) Krishna Deva Raya was the greatest Emperor of the Vijayanagara Empire who reigned from 1509–1529 CE. He was the third ruler of the Tuluva Dynasty. Emperor Krishna Deva Raya earned the titles Andhra Bhoja, Mooru Rayara Ganda (meaning King of three Kings) and Kannada Rajya Rama Ramana. Portuguese travelers Domingo Paes and Fernao Nuniz also visited the Vijayanagara Empire during his reign. Travelogues indicate that the king was not only an able administrator, but also an excellent general, leading from the front in battle and even attending to the wounded. "
    },
    {
        "question": "Mughal presence in the Red Ford ceased with the fall of ",
        "option1": " Aurangzeb ",
        "option2": " Muhammad Shah ",
        "option3": " Shah Alam ",
        "option4": " Bahadur Shah ‘Zafar’",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) The Red Fort is a 17th century fort complex constructed by the Mughal emperor, Shah Jahan in the walled city of Old Delhi (in present day Delhi, India) that served as the residence of the Mughal Emperors. It served as the capital of the Mughals until 1857, when Mughal emperor Bahadur Shah Zafar was exiled by the British Indian government. "
    },
    {
        "question": "‘Khalsa’ was founded by ",
        "option1": " Guru Gobind Singh ",
        "option2": " Guru Ramdas ",
        "option3": " Guru Nanak ",
        "option4": " Arjun Dev",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) Khalsa is the collective body of Singhs and Kaurs represented by the five beloved-ones and is the final temporal Guru/leader of the Sikhs. The Khalsa was inaugurated on March 30, 1699, by Guru Gobind Singh, the tenth Sikh Guru. The leadership was passed on by Guru Gobind Singh to the Khalsa and bestowed the title “Guru Panth” or “Guru”. The Khalsa is also the nation of the Sikhs. The Khalsa is responsible for all executive, military and civil authority. The meaning of Khalsa translates to “Sovereign/ Free”. Another interpretation is that of being ‘Pure’. Guru Gobind Singh has declared the Khalsa as his true Guru and therefore as following described in the Sarbloh Granth the attributes of the Khalsa "
    },
    {
        "question": "The Delhi General who successfully advanced up to Madurai was ",
        "option1": " Khizr Khan ",
        "option2": " Muhammad Ghori ",
        "option3": " Malik Kafur ",
        "option4": " Muhammad bin Tughlaq",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) Malik Kafur was a slave who became a head general in the army of Alauddin Khilji, ruler of the Delhi sultanate from 1296 to 1316 AD. Between 1309 and 1311, Malik Kafur led two campaigns in South India. The first was against Warangal and other against Dwar Samudra, Mabar and Madurai. "
    },
    {
        "question": "Who was the greatest Bhakti poet of Maharasthra ? ",
        "option1": " Ramdas ",
        "option2": " Tukaram ",
        "option3": " Namdeva ",
        "option4": " Eknath",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) Saint Tukaram (1608–1645) was a prominent Varkari Sant (Saint) and spiritual poet during a Bhakti movement in India. Dilip Purushottam Chitre, a well known Marathi Scholar, identifies Tukaram as the first modern poet of Marathi. Chitre believes that Tukaram was the second saint after Sant Dnyaneshwar who denied caste hierarchy in Hindu religion and attacked rituals present in Hindu Dharma. "
    },
    {
        "question": "The foreign traveller who visited India during the Mughal period and who left us an expert’s description of the Peacock Throne, was ",
        "option1": " Geronimo Verroneo ",
        "option2": " ‘Omrah’ Danishmand Khan ",
        "option3": " Travernier ",
        "option4": " Austin of Bordeaux",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) Tavernier gives a detailed and vivid description of the “Peacock Throne” in his book Le Six Voyages de J. B. Tavernier- The Six Voyages of J. B. Tavernier. It was during Tavernier’s sixth voyage to India, which he undertook between 1663 and 1668, he had the privilege of visiting the court of the great Mughal Emperor Aurangzeb, at Jahanabad, at the invitation of the Emperor himself. The main purpose of Tavernier’s invitation to the Emperor’s court, was for the Emperor to inspect whatever jewels Tavernier had brought from the west, with a view of purchasing them. The description of the throne appears in Chapter VIII of Volume II of his book, which concerns about preparations for the Emperor’s annual birthday festival, during which he is solemnly weighed every year, and also about the splendor of his thrones and the magnificence of his court. Tavernier’s account of the Peacock Throne is the most comprehensive account of the throne available to modern historians. "
    },
    {
        "question": "The dead body of Babar by his own choice lies buried in ",
        "option1": " Agra ",
        "option2": " Farghana ",
        "option3": " Samarqand",
        "option4": " Kabul",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) Babur died at the age of 47 in 1531. Though he wished to be buried in his favourite garden in Kabul, a city he had always loved, he was first buried in a mausoleum in the capital city of Agra. His remains were later moved to Bagh-e Babur (Babur Gardens) in Kabul, Afghanistan. "
    },
    {
        "question": "Goa was captured by the Portuguese in the year— ",
        "option1": " 1508 ",
        "option2": " 1608 ",
        "option3": " 1510 ",
        "option4": " 1610",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) The Portuguese State of India was established in 1505 as a viceroyalty of the Kingdom of Portugal, six years after the discovery of a sea route between Portugal and India, to serve as the plenipotentiary governing body of a string of Portuguese fortresses and colonies overseas. In the year 1509, Alfonso de Albuquerque was appointed the second governor of the Portuguese possessions in the East. In 1510, Alfonso de Albuquerque defeated the Bijapur sultans with the help of Timayya, on behalf of the Hindu Vijayanagara Empire, leading to the establishment of a permanent settlement in Velha Goa (or Old Goa). "
    },
    {
        "question": "Who was the Guru of Shivaji ? ",
        "option1": " Namdev ",
        "option2": " Ramdas ",
        "option3": " Eknath ",
        "option4": " Tukaram",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) Samarth Ramdas was a prominent Marathi saint and religious poet in the Hindu tradition in Maharashtra, India. Samarth Ramdas was a devotee of Lord Hanuman and Lord Rama. His birth name was Narayan Suryajipant Kulkarni Thosar. Ramdas was the political strategist and spiritual guru of Shivaji. It is said that Shivaji Maharaj requested Shri Ramdas swami to move his residence to a fort named Parali & establish his permanent monastery there. The fort was subsequently renamed Sajjangad - Fort of the sacred. "
    },
    {
        "question": "Amir Khusrau was a musician and ",
        "option1": " Sufi saint ",
        "option2": " Persian and Hindi writer, and scholar ",
        "option3": " historian ",
        "option4": " All of the above",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) Amir Khusrau was an Indian musician, scholar and poet. He was an iconic figure in the cultural history of the Indian subcontinent. A Sufi mystic and a spiritual disciple of Nizamuddin Auliya of Delhi, Amir Khusrow was not only a notable poet but also a prolific and seminal musician. He wrote poetry primarily in Persian, but also in Hindavi. He is regarded as the “father of qawwali” (the devotional music of the Sufis in the Indian subcontinent). He is also credited with enriching Hindustani classical music by introducing Persian and Arabic elements in it, and was the originator of the khayal and tarana styles of music. The invention of the tabla is also traditionally attributed to him. "
    },
    {
        "question": "A new coin called the ‘Rupia’ was issued for the first time by ",
        "option1": " Ala-ud-din Khilji ",
        "option2": " Mohammed Shah Tughluq ",
        "option3": " Sher Shah Suri ",
        "option4": " Akbar",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) The system of tri-metalism which came to characterize Mughal coinage was introduced by Sher Shah. While the term rupya had previously been used as a generic term for any silver coin, during his rule the term rupiya came to be used as the name for a silver coin of a standard weight of 178 grains, which was the precursor of the modern rupee. Rupee is today used as the national currency in Pakistan, India, Nepal, Sri Lanka, Indonesia, Mauritius, Maldives, Seychelles among other countries. Gold coins called the Mohur weighing 169 grains and copper coins called Dam were also minted by his government. "
    },
    {
        "question": "The world famous ‘Peacock Throne’ was kept in which of the following Mughal buildings ? ",
        "option1": " Diwan-r-Khasa-Fatehpur Sikri ",
        "option2": " New Agra Fort ",
        "option3": " The Rang Mahal of the Red Fort at Delhi ",
        "option4": " The Diwan–i–Am of the Red Fort at Delhi",
        "answar": "*",
        "category": "indian history",
        "explain": " (*) In the Diwan-i-Aam or the Hall of Public Audiences of the Red Fort in Delhi, the emperor, seated in a canopied alcove, would hear complaints and pleas of the commoners through a jharokha (balcony). In the Diwan-i-Khas or the Hall of Private Audiences the INDIAN HISTORY SGAE–110 Emperor held private meetings with courtiers and state guests. At the centre of the chamber, the famous Peacock Throne throne was placed over a marble pedestal. The throne was looted in 1739 by Nadir Shah. The original peacock throne was housed inside the Diwan-i-Am (Hall of Public Audience) of Agra Fort form where it was shifted to Delhi. "
    },
    {
        "question": "Which was the birth place of Guru Nanak ? ",
        "option1": " Gurdaspur ",
        "option2": " Amritsar ",
        "option3": " Lahore ",
        "option4": " Talwandi",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) Guru Nanak was the founder of the religion of Sikhism and the first of the ten Sikh Gurus. Guru Nanak was born on 15 April 1469, now celebrated as Prakash Divas of Guru Nanak Dev, into a Hindu Khatri family in the village of Rai Bhoi di Talwandi, now called Nankana Sahib, near Lahore, Pakistan. Today, his birthplace is marked by Gurdwara Janam Asthan. "
    },
    {
        "question": "The famous Kohinoor diamond was produced from one of the mines in ",
        "option1": " Orissa ",
        "option2": " Chhota Nagpur ",
        "option3": " Bijapur ",
        "option4": " Golconda",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) The Koh-i-Noor, meaning “Mountain of Light” in Persian language, also spelled Koh-i-noor, Kuh-e Nur or Koh-i-Nur, is a 105.6 metric carats diamond, weighing 21.6 grammes in the most recent cut state, and once the largest known diamond. The Koh-i Nur is believed by some to have originated in the state of Andhra Pradesh in India together with its double, the Darya-ye Noor (the “Sea of Light”). The diamond came from the Kollur mines, near the village Kollur in the present-day Guntur district of Andhra Pradesh in India "
    },
    {
        "question": "Which of the following was not ordered by Alauddin Khalji to control black-marketing and hoarding ? ",
        "option1": " Land revenue should be collected in kind ",
        "option2": " Cultivators should sell the harvested crops on the field only ",
        "option3": " Merchants should sell all commodities in the open ",
        "option4": " More privileges should be given to Khuts and Muqaddams",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) In order to accomplish his price control measure, Alauddin promulgated the following seven ordinances according to the Tarikh-i-Firuzhshai: (1) all food prices were to be fixed; (ii) a high ranking official was to ensure that no tampering was done; (iii) large storages of grain was established in Delhi; (iv) grain trade and transport were controlled by the government; (v) peasants and traders were prohibited from hoarding grains; (vi) the collection of revenue was to be made in kind and the government procurement of grain was to be done in the field to eliminate the private storage of grain; and (vii) a daily status report on market prices had to be submitted to the Sultan. "
    },
    {
        "question": "The medieval city of Vijayanagar is now known as ",
        "option1": " Chandragiri ",
        "option2": " Halebidu ",
        "option3": " Hampi ",
        "option4": " Kondavidu",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) Vijayanagara is in Bellary District, northern Karnataka. It is the name of the now-ruined capital city that surrounds modern-day Hampi, of the historic Vijayanagara empire which extended over the southern part of India. The name translates as ‘City of Victory’, from vijaya (victory) and nagara (city). As the prosperous capital of the largest and most powerful kingdom of its time in all of India, Vijayanagara attracted people from all around the world. "
    },
    {
        "question": "Which one of the following Mughal buildings is said to possess the unique feature of breing exactly equal in length and beadth? ",
        "option1": " Agra Fort ",
        "option2": " Red Fort ",
        "option3": " Taj Mahal ",
        "option4": " Buland Darwaza",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) The Taj Mahal is a white marble mausoleum located in Agra, Uttar Pradesh, India. It was built by Mughal emperor Shah Jahan in memory of his third wife, Mumtaz Mahal. The tomb is the central focus of the entire complex of the Taj Mahal. The marble dome that surmounts the tomb is the most spectacular feature. Its height of around 35 metres is about the same as the length of the base, and is accentuated as it sits on a cylindrical “drum” which is roughly 7 metres high. "
    },
    {
        "question": "Who of the following was sent as an ambassador to the royal court of Jahangir by James 1, the then king of England? ",
        "option1": " John Hawkins ",
        "option2": " William Todd ",
        "option3": " Sir Thomas Roe ",
        "option4": " Sir Walter Raleigh",
        "answar": "1",
        "category": "indian history",
        "explain": " (1) The King of England sent envoys, John Hawkins in 1608 and Thomas Roe in 1615, to the Mughal court of Jahangir. In 1609, Emperor Jehangir issued farman permitting the English to establish a factory at Surat. "
    },
    {
        "question": "The Khilji Sultans of Delhi were ",
        "option1": " Mongols ",
        "option2": " Afghans ",
        "option3": " Turks ",
        "option4": " A Jat tribe",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) The Khilji dynasty was a Muslim dynasty of Turkic Khalaj origin. The Khiljis ruled large parts of South Asia between 1290 and 1320. They were the second dynasty to rule the Delhi Sultanate of India. Led by their ruler, Ala-ud-din Khilji, they are noted for having repeatedly defended India against the Mongol invasions of India. "
    },
    {
        "question": "The rulers of Vijayanagar promoted ",
        "option1": " Hindi, Marathi and Sanskrit ",
        "option2": " Malayalam, Tamil and Sanskrit ",
        "option3": " Tamil, Telugu and Sanskrit ",
        "option4": " Telugu, Urdu and Sanskrit",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) Telugu culture reached its zenith during the Vijayanagara rule under Sri Krishnadevaraya. The rulers patronized Kannada, Telugu and Sanskrit and Tamil scholars who wrote in the Jain, Virashaiva and Vaishnava traditions.The Vijayanagar period was the golden age of Telugu literature. Sanskrit literature was given patronage by the Vijayanagar kings. The early kings of the Sangama dynasty patronized the Sringeri saints while the Saluva and Tuluva kings patronised the Madhva saints of Udupi. Krishnadevaraya also patronised Tamil poet Harihara who wrote Irusamaya vilakkam (an exposition on saivism and Vaishnavism). "
    },
    {
        "question": "The original name of Tansen, the most famous musician at the court of Akbar was ",
        "option1": " Lal Kalwant ",
        "option2": " Banda Bahadur ",
        "option3": " Ramatanu Pande ",
        "option4": " Markandey Pande",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) Mia Tansen (born as Ramtanu Pandey) was a prominent Hindustani classical music composer and musician. He was an extraordinarily gifted vocalist, known for a large number of compositions, and also an instrumentalist who popularized and improved the plucked rabab (of Central Asian origin). He was among the Navaratnas (nine jewels) at the court of the Mughal Emperor Akbar. Akbar gave him the title Miyan (an honorific, meaning learned man). "
    },
    {
        "question": "The Qutub Minar was completed by the famous ruler ",
        "option1": " Qutub-ud-din Aibak ",
        "option2": " Iltutmish ",
        "option3": " Firoz Shah Tughlaq ",
        "option4": " Alauddin Khilji",
        "answar": "2",
        "category": "indian history",
        "explain": " (2) The construction of Qutb Minar was begun by Qutub-ud-din Aibak in 1192 and was completed by Iltutmish. The soaring conical tower is an exquisite example of Indo-Islamic Afghan architecture. It is a UNESCO World Heritage Site in Delhi. "
    },
    {
        "question": "Which of the following are incorrectly paired ? ",
        "option1": " Krishnadeva Raya — Amukta Malyada ",
        "option2": " Harshavardhana — Nagananda ",
        "option3": " Kalidasa — Ritusamhara ",
        "option4": " Visakhadatta — Kiratarjuniyam",
        "answar": "4",
        "category": "indian history",
        "explain": " (4) Visakhadatta is the author of the play (drama) Mudra Rakshasa that narrates the ascent of the king Chandragupta Maurya to power in Northern India. Mudrarakshasa is dated variously from the late 4th century to the 8th century "
    },
    {
        "question": "Ibn Batuta visited India during the reign of ",
        "option1": " Iltutmish ",
        "option2": " Ala-ud-din Khalji ",
        "option3": " Muhammad bin Tughluq ",
        "option4": " Balban",
        "answar": "3",
        "category": "indian history",
        "explain": " (3) Ibn Battuta, the famous Moroccan traveler, visited India during the reign of Muhammad bin Tughluq. Muhammad bin Tughluq was renowned as the wealthiest man in the Muslim World at that time. He patronized various scholars, sufis, qadis, viziers and other functionaries in order to consolidate his rule. On the strength of his years of study in Mecca, Ibn Batuta was appointed a qazi, or judge, by the sultan. He found it difficult to enforce Islamic laws beyond the sultan’s court in Delhi, due to lack of Islamic appeal in India."
    }
    

]
