[
    {
        "question": "The Milky Way Galaxy was first observed by ",
        "option1": " Galileo ",
        "option2": " Maarten Schmidt ",
        "option3": " Marconi ",
        "option4": " Newton",
        "category": "physical geography",
        "answar": "1",
        "explain": " The Milky Way is the galaxy that contains our solar\nsystem. This name derives from its appearance as a\ndim “milky” glowing band arching across the night sky,\nin which the naked eye cannot distinguish individual\nstars. Observational evidence for the Milky Way being\nmade up of distant stars first came when Galileo\npointed his telescope towards the Milky Way, observing\na large amount of faint stars.\n11. "
    },
    {
        "question": "Which of the following state- ments is correct ? ",
        "option1": " Pluto is not a Planet now ",
        "option2": " Pluto was discoverd by Clyde Tombaugh in 1930 ",
        "option3": " Pluto has been given the number 134340 ",
        "option4": " All of the above",
        "category": "physical geography",
        "answar": "4",
        "explain": " Pluto was discovered by clyde Tombaugh in 1930.\nAccording to International Astronomical Union (IAU)\non August 24, 2006 Pluto is considered as dwarf\nplanet. According to the definition, there are currently\neight planets and five dwarf planets known in the solar\nsystem. The five dwarf planets are Pluto, Ceres, Eris,\nMake make and Haumea. Pluto has been given number\n134340.\n12. "
    },
    {
        "question": "Which is the hottest planet in the Solar System ? ",
        "option1": " Jupiter ",
        "option2": " Saturn ",
        "option3": " Venus ",
        "option4": " Uranus",
        "category": "physical geography",
        "answar": "3",
        "explain": " Mercury is closer to the sun, but the atmosphere\non Venus actually makes it hotter. Even on the night\nside, the temp erature doesn’t drop by much\n(comparatively) because of the carbon dioxide, about\n95%, atmosphere. The atmospheric pressure of Venus\nis also about 90 times greater than that of Earth.\n13. "
    },
    {
        "question": "The largest planet in our solar system is ",
        "option1": " Mars ",
        "option2": " Jupiter ",
        "option3": " Saturn ",
        "option4": " Mercury",
        "category": "physical geography",
        "answar": "2",
        "explain": " Jupiter is the fifth planet from the Sun and is the\nlargest planet in the solar system. If Jupiter were\nhollow, more than one thousand Earths could fit\ninside. It also contains two and a half times the mass\nof all the other planets combined. It has a mass of 1.9\n× 1027 kg and is 142,800 kilometers (88,736 miles)\nacross the equator.\n14. "
    },
    {
        "question": "The four largest planets of the Solar System in decreasing size are ",
        "option1": " Jupiter, Mercury, Saturn and Uranus ",
        "option2": " Mercury, Jupiter, Saturn and Neptune ",
        "option3": " Jupiter, Saturn, Uranus and Neptune ",
        "option4": " Jupiter, Mercury, Saturn and Neptune",
        "category": "physical geography",
        "answar": "3",
        "explain": " The diameter of Jupiter is 1,42,984 km, Saturn:\n1,20,536 km ,Uranus: 51,118 km, and that of Neptune\nis 49,528 km.\n15. "
    },
    {
        "question": "The number of staellites of the planet is Mercury is ",
        "option1": " 0 ",
        "option2": " 1 ",
        "option3": " 2 ",
        "option4": " 16",
        "category": "physical geography",
        "answar": "1",
        "explain": " The nearness of Mercury to the massive gravity\ninfluence of the Sun is the likely reason that no natural\nsatellites are present, although it is possible that one\nor more may have existed in the past.\n16. "
    },
    {
        "question": "Which of the following does not belong to the solar system? ",
        "option1": " Asteroids ",
        "option2": " Comets ",
        "option3": " Planets ",
        "option4": " Nebulae",
        "category": "physical geography",
        "answar": "4",
        "explain": " A nebula is an interstellar cloud of dust, hydrogen,\nhelium and other ionized gases. Originally, nebula was\na name for any extended astronomical object, including\ngalaxies beyond the Milky Way. The Andromeda Galaxy,\nfor instance, was referred to as the Andromeda Nebula\nbefore galaxies were discovered by Edwin Hubble.\n17. "
    },
    {
        "question": "Which is the coldest among the following ? ",
        "option1": " Mars ",
        "option2": " Earth ",
        "option3": " Pluto ",
        "option4": " Mercury",
        "category": "physical geography",
        "answar": "3",
        "explain": " Until it lost its planetary status in 2006, Pluto was\nthe coldest with an estimated surface temperature\nbetween -235 and -210 degrees Celsius. But Pluto\nhas now been relegated the status of a Dwarf Planet.\nPluto has always had the ‘honour’ of being the coldest\nplanet with an average temperature between -360 to -\n400 degrees Fahrenheit. This is because it is so far\naway from the sun: it is over 40 times further from\nthe sun than planet Earth. Pluto also has no internal\nheat source and it even orbits in a ring of ice debris.\n18. "
    },
    {
        "question": "The moon is showing its same face to the earth because ",
        "option1": " It is not rotating about its own axis ",
        "option2": " Its rotation and revolution are opposite ",
        "option3": " Its periods of rotation and revolution are the same ",
        "option4": " Its rotation is faster than its revolution",
        "category": "physical geography",
        "answar": "3",
        "explain": " Because it is “tidally-locked” to the Earth. The\nEarth’s gravity slows down the moon’s rotation, so\nthat it rotates at the same speed as it revolves around\nthe Earth. Imagine a person who walks around a center\npole, but shifts their body so they are always facing it\nas they walk.\n19. "
    },
    {
        "question": "Among the following, the celes- tial body farthest from the Earth is ",
        "option1": " Saturn ",
        "option2": " Uranus ",
        "option3": " Neptune ",
        "option4": " Pluto",
        "category": "physical geography",
        "answar": "3",
        "explain": " Pluto, formal designation 134340 Pluto, is the\nsecond-most-massive known dwarf planet in the Solar\nSystem (after Eris) and the tenth-most-massive body\nobserved directly orbiting the Sun. Originally classified\nas the ninth planet from the Sun, Pluto was\nrecategorized as a dwarf planet and plutoid owing to\nthe discovery that it is only one of several large bodies\nwithin the Kuiper belt. Like other members of the\nKuiper belt, Pluto is composed primarily of rock and\nice and is relatively small, approximately one-sixth the\nmass of the Earth’s Moon and one-third its volume. It\nhas an eccentric and highly inclined orbit that takes it\nfrom 30 to 49 AU (4.4–7.4 billion km) from the Sun.\nThis causes Pluto to periodically come closer to the\nSun than Neptune. Pluto gets as close as 4.44 billion\nkm. But its orbit is so elliptical that it gets out to a\ndistance of 7.38 billion km. In fact, there are times in\nPluto’s orbit when Neptune passes it. Then Neptune\nreally is the farthest planet from the Sun.\n20. "
    },
    {
        "question": "Pulsars are ",
        "option1": " stars moving towards the Earth ",
        "option2": " stars moving away from Earth ",
        "option3": " rapidly spinning stars ",
        "option4": " high temperature stars",
        "category": "physical geography",
        "answar": "3",
        "explain": " The word “pulsar” is a contraction of “pulsating\nstar. A pulsar is formed when a massive star collapses\nexhausts its supply of fuel. It blasts out in a giant\nexplosion known as a supernova, the most powerful\nand violent event in the universe. Without the opposing\nforce of nuclear fusion to balance it, gravity begins to\npull the mass of the star inward until it implodes. In a\npulsar, gravity compacts the mass of the star until it\nforms an object composed primarily of neutrons packed\nso tightly that they no longer exist as normal matter.\nAs the star collapses, it begins to spin more rapidly in\nwhat is known as the conservation of angular\nmomentum. The process is similar to that of an ice\nskater pulling their arms in close to spin faster. What\nis left behind is a rapidly spinning ball of tightly packed\nneutrons inside an iron shell..\n21. "
    },
    {
        "question": "Biggest planet of solar system is ",
        "option1": " Earth ",
        "option2": " Mars ",
        "option3": " Saturn ",
        "option4": " Jupiter",
        "category": "physical geography",
        "answar": "4",
        "explain": " Jupiter is the biggest planet in our Solar System. It\nis the largest by mass, volume, and surface area among\nother statistics. Here are the critical measurements\nof Jupiter as well as a few other interesting facts about\nthe planet and other bodies in the Jovian system.\n22. "
    },
    {
        "question": "Which is the second nearest star to the Earth after the Sun? ",
        "option1": " Vega ",
        "option2": " Sirius ",
        "option3": " Proxima Centauri ",
        "option4": " Alpha Centauri",
        "category": "physical geography",
        "answar": "3",
        "explain": " As the nearest star from our Solar System, Proxima\nCentauri is a prime candidate for future interstellar\ntravel and space colonization missions. Proxima\nCentauri is a red dwarf star about 4.24 light-years\ndistant inside the G-cloud in the constellation of\nCentaurus. It was discovered in 1915 by Robert\nInnes, the Director of the Union Observatory in South\nAfrica, and is the nearest known star to the Sun,\nalthough it is too faint to be seen with the naked eye.\nBecause of the proximity of this star, its distance from\nthe Sun and angular diameter can be measured\ndirectly, from which it can be determined that its\ndiameter is about one-seventh of that of the Sun.\nProxima Centauri’s mass is about an eighth of the\nSun’s, and its average density is about 40 times that\nof the Sun.\n23. "
    },
    {
        "question": "The outermost layer of the Sun is called ",
        "option1": " Chromosphere ",
        "option2": " Photosphere ",
        "option3": " Corona ",
        "option4": " Lithosphere",
        "category": "physical geography",
        "answar": "3",
        "explain": " The outermost layer of the sun is the corona. Only\nvisible during eclipses, it is a low density cloud of\nplasma with higher transparency than the inner layers.\nThe white corona is a million times less bright than\nthe inner layers of the sun, but is many times larger.\nA corona is a type of plasma “atmosphere” of the Sun\nor other celestial body, extending millions of kilometers\ninto space, most easily seen during a total solar eclipse,\nbut also observable in a coronagraph. The word\n“corona” itself derived from the Latin, meaning crown.\nThe high temperature of the corona gives it unusual\nspectral features\n24. "
    },
    {
        "question": "Which planet is called evening star? ",
        "option1": " Mars ",
        "option2": " Mercury ",
        "option3": " Venus ",
        "option4": " Jupiter",
        "category": "physical geography",
        "answar": "3",
        "explain": " Venus \"overtakes\" the Earth every 584 days as it\norbits the Sun. As it does so, it changes from the\n\"Evening Star\", visible after sunset, to the \"Morning\nStar\", visible before sunrise.\n25. "
    },
    {
        "question": "The planet revolving east to west is ",
        "option1": " Venus ",
        "option2": " Uranus ",
        "option3": " Neptune ",
        "option4": " Pluto",
        "category": "physical geography",
        "answar": "1",
        "explain": " Like the other planets in our solar system, Venus\nrotates about its axis. However, Venus is the only planet\nthat rotates from east to west instead of west to east.\nThis means, that if we lived on Venus, the Sun would\nappear to rise in the west in the morning, and set in\nthe east in the evening. Venus rotates in what is called\nretrograde motion.\n26. "
    },
    {
        "question": "The planet emitting green light is ",
        "option1": " Jupiter ",
        "option2": " Venus ",
        "option3": " Uranus ",
        "option4": " Neptune",
        "category": "physical geography",
        "answar": "3",
        "explain": " The atmosphere of Uranus is composed of 83%\nhydrogen, 15% helium, 2% methane and small\namounts of acetylene and other hydrocarbons.\nMethane in the upper atmosphere absorbs red light,\ngiving Uranus its blue-green colour.\n27. "
    },
    {
        "question": "The number of zodiacs is ",
        "option1": " 10 ",
        "option2": " 12 ",
        "option3": " 13 ",
        "option4": " 11",
        "category": "physical geography",
        "answar": "2",
        "explain": " In both astrology and historical astronomy, the\nzodiac is a circle of twelve 30° divisions of celestial\nlongitude that are centered upon the ecliptic: the\napparent path of the Sun across the celestial sphere\nover the course of the year. Historically, these twelve\ndivisions are called signs.\n28. "
    },
    {
        "question": "W hi ch o f the fo l l owi ng i s known as the Morning Star? ",
        "option1": " Saturn ",
        "option2": " Jupiter ",
        "option3": " Mars ",
        "option4": " Venus",
        "category": "physical geography",
        "answar": "4",
        "explain": " One of the nicknames of Venus is “the Morning\nStar”. It is also known as the Evening Star. Venus is\ncalled so because it appears brightest shortly before\nsunrise and shortly after sunset.\n29. "
    },
    {
        "question": "Which planet orbits closest to the earth? ",
        "option1": " Mars ",
        "option2": " Jupiter ",
        "option3": " Venus ",
        "option4": " Mercury",
        "category": "physical geography",
        "answar": "3",
        "explain": " Venus orbits the Sun at an average distance of\nabout 0.72 AU (108,000,000 km), and completes an\norbit every 224.65 days. Although all planetary orbits\nare elliptical, Venus's orbit is the closest to circular,\nwith an eccentricity of less than 0.01.\n30. "
    },
    {
        "question": "Solar energy is received by the earth through ",
        "option1": " conduction ",
        "option2": " radiation ",
        "option3": " convection ",
        "option4": " refraction",
        "category": "physical geography",
        "answar": "2",
        "explain": " In physics, radiation is a process in which energetic\nparticles or energetic waves travel through vacuum,\nor through matter-containing media that are not\nrequired for their propagation. The Earth receives 174\npetawatts (PW) of incoming solar radiation (insolation)\nat the upper atmosphere.\n31. "
    },
    {
        "question": "Earth are ",
        "option1": " Mars and Jupiter ",
        "option2": " Mercury and Venus ",
        "option3": " Venus and Saturn ",
        "option4": " Mars and Venus",
        "category": "physical geography",
        "answar": "4",
        "explain": " Earth is the third planet from the Sun in the\nfollowing order from the Sun: Mercury, Venus, Earth,\nand Mars. The four smaller inner planets, Mercury,\nVenus, Earth and Mars, also called the terrestrial\nplanets, are primarily composed of rock and metal.\n32. "
    },
    {
        "question": "Which planet looks reddish in the night sky ? ",
        "option1": " Jupiter ",
        "option2": " Saturn ",
        "option3": " Mars ",
        "option4": " Mercury",
        "category": "physical geography",
        "answar": "3",
        "explain": " Mars is the fourth planet from the Sun and the\nseventh largest. The planet probably got this name\ndue to its red color; Mars is sometimes referred to as\nthe Red Planet as the iron oxide prevalent on its\nsurface gives it a reddish appearance.\n33. "
    },
    {
        "question": "Isohels are the isopleths of ",
        "option1": " sunshine ",
        "option2": " flowering time ",
        "option3": " rain ",
        "option4": " clouds",
        "category": "physical geography",
        "answar": "1",
        "explain": " An isohel is line drawn on a map connecting points\nthat receive equal amounts of sunlight. It is derived\nfrom helios, meaning 'Sun.'\n34. "
    },
    {
        "question": "Which one of the following is the largest planet ? ",
        "option1": " Jupiter ",
        "option2": " Venus ",
        "option3": " Saturn ",
        "option4": " Uranus",
        "category": "physical geography",
        "answar": "1",
        "explain": " Jupiter is the fifth planet from the Sun and the\nlargest planet in the Solar System. It is a gas giant\nwith mass one-thousandth that of the Sun but is two\nand a half times the mass of all the other planets in\nthe Solar System combined.\n35. "
    },
    {
        "question": "The mass of Jupiter is approxi- mately ",
        "option1": " one tenth of the solar mass ",
        "option2": " one thousandth of the solar mass ",
        "option3": " one hundredth of the solar mass ",
        "option4": " half the solar mass",
        "category": "physical geography",
        "answar": "2",
        "explain": " Jupiter's radius is about 1/10 the radius of the\nSun, and its mass is 0.001 times the mass of the Sun.\nJupiter's mass is 2.5 times that of all the other planets\nin the Solar System combined—this is so massive that\nits barycenter with the Sun lies above the Sun's surface\nat 1.068 solar radii from the Sun's center.\n36. "
    },
    {
        "question": "The planet nearest to the Sun is : ",
        "option1": " Earth ",
        "option2": " Mercury ",
        "option3": " Mars ",
        "option4": " Venus",
        "category": "physical geography",
        "answar": "2",
        "explain": " Mercury is the innermost planet (nearest to the\nSun) in the Solar System. It is also the smallest, and\nits orbit is the most eccentric (that is, the least perfectly\ncircular) of the eight planets. It orbits the Sun once in\nabout 88 Earth days, completing three rotations about\nits axis for every two orbits.\n37. "
    },
    {
        "question": "The planet that takes 88 days to make one revolution of the sun is : ",
        "option1": " Mercury ",
        "option2": " Saturn ",
        "option3": " Jupiter ",
        "option4": " Mars",
        "category": "physical geography",
        "answar": "1",
        "explain": " In the solar system, the orbit of Mercury is the\nmost eccentric (that is, the least perfectly circular) of\nthe eight planets. It orbits the Sun once in about 88\nEarth days, completing three rotations about its axis\nfor every two orbits.\n38. "
    },
    {
        "question": "‘Super nova’ is ",
        "option1": " a comet ",
        "option2": " an asteroid ",
        "option3": " an exploding Star ",
        "option4": " a black hole",
        "category": "physical geography",
        "answar": "3",
        "explain": " A supernova is a stellar explosion that is more\nenergetic than a nova. During this short interval a\nsupernova can radiate as much energy as the Sun is\nexpected to emit over its entire life span. The explosion\nexpels much or all of a star's material at a velocity of\nup to 30,000 km/s (10% of the speed of light).\n39. "
    },
    {
        "question": "Which planet in our solar system is nearly as big as the earth ? ",
        "option1": " Mercury ",
        "option2": " Mars ",
        "option3": " Venus ",
        "option4": " Pluto",
        "category": "physical geography",
        "answar": "3",
        "explain": " Venus is sometimes called as Earth's twin planet,\nin terms of size and composition. Like the earth, Venus\nis covered with thick clouds and has an atmosphere.\nThere is almost the same amount of gravity on Venus\nbut the pressure on the planet is about 100 times\nbigger than on Earth.\n40. "
    },
    {
        "question": "Which of the following is called “Blue Planet” ? ",
        "option1": " Saturn ",
        "option2": " Earth ",
        "option3": " Jupiter ",
        "option4": " Mars",
        "category": "physical geography",
        "answar": "2",
        "explain": " Earth is the Blue Planet because of the vast\nencompass of oceans on its surface. From space the\noceans combined with the atmosphere makes the\nplanet look blue. The abundance of water on Earth's\nsurface is a unique feature that distinguishes the \"Blue\nPlanet\" from others in the Solar System.\n41. "
    },
    {
        "question": "Which planet in our solar sys- tem is nearly as big as the earth ? ",
        "option1": " Mercury ",
        "option2": " Mars ",
        "option3": " Venus ",
        "option4": " Pluto",
        "category": "physical geography",
        "answar": "3",
        "explain": " Venus is often referred to as our sister planet\nbecause of similarities in size, mass, density and\nvolume. It is believed that both planets share a\ncommon origin forming at the same time out of a\ncondensing nebulosity around 4.5 billion years ago.\n42. "
    },
    {
        "question": "Which planets do not have sat- ellites revolving around them ? ",
        "option1": " Mars and Venus ",
        "option2": " Mercury and Venus ",
        "option3": " Mars and Mercury ",
        "option4": " Neptune and Pluto",
        "category": "physical geography",
        "answar": "2",
        "explain": " Of the nine planets, only Venus and Mercury have\nno known natural satellites. A total of 139 moons, or\nnatural satellites, can be found in the vast solar system.\n43. "
    },
    {
        "question": "The planet which has the high- est surface temperature is ",
        "option1": " Jupiter ",
        "option2": " Earth ",
        "option3": " Pluto ",
        "option4": " Venus",
        "category": "physical geography",
        "answar": "4",
        "explain": " Venus has a maximum surface temperature of\n462°C (862°F) making it the hottest planet in the solar\nsystem. The high temperature is because of its dense\ncloud layer.\n44. "
    },
    {
        "question": "Light from the Sun reaches us in nearly ",
        "option1": " 8 min ",
        "option2": " 2 min ",
        "option3": " 6 min ",
        "option4": " 4 min",
        "category": "physical geography",
        "answar": "1",
        "explain": " The sun’s light takes about 8 minutes to reach\nthe Earth after it has been emitted from the sun’s\nsurface. The time it takes for light to reach planets\nin our Solar System varies from about 3 minutes for\nMercury, to about 5.3 hours for Pluto.\n45. "
    },
    {
        "question": "A spinning neutron star is known as ",
        "option1": " White dwarf ",
        "option2": " Black hole ",
        "option3": " Pulsar ",
        "option4": " Quasar",
        "category": "physical geography",
        "answar": "3",
        "explain": " Pulsars are spinning neutron stars that have jets\nof particles moving almost at the speed of light stream-\ning out above their magnetic poles. These jets pro-\nduce very powerful beams of light.\n46. "
    },
    {
        "question": "When the moon completely cov- ers the sun, it is known as ",
        "option1": " the Antumbra ",
        "option2": " the Umbra ",
        "option3": " the Penumbra ",
        "option4": " None of these",
        "category": "physical geography",
        "answar": "2",
        "explain": " A solar eclipse occurs when the moon crosses the\npath between the sun and the earth. The darkest shad-\now (where the sun is completely covered) is called the\numbra. The umbra is narrow at the distance of the\nEarth, and a total eclipse is observable only within\nthe narrow strip of land or sea over which the umbra\npasses. The partial shadow is called the penumbra.\n47. "
    },
    {
        "question": "The darkest portion of the shad- ow cast during an eclipse is ",
        "option1": " Corona ",
        "option2": " Umbra ",
        "option3": " Penumbra ",
        "option4": " Black hole",
        "category": "physical geography",
        "answar": "2",
        "explain": " The umbra (Latin for “shadow”) is the innermost\nand darkest part of a shadow, where the light source\nis completely blocked by the occluding body. An ob-\nserver in the umbra experiences a total eclipse.\n48. "
    },
    {
        "question": "The total number of planets re- volving around the sun is ",
        "option1": " Five ",
        "option2": " Eight ",
        "option3": " Seven ",
        "option4": " Six",
        "category": "physical geography",
        "answar": "2",
        "explain": " There are 8 planets of the solar system that re-\nvolve around the sun: Mercury, Venus, Earth, Mars,\nJupiter, Saturn, Uranus, and Neptune. Pluto was\nstripped of its planetary status and categorized as a\n‘dwarf planet’ by the International Astronomical Union\nin 2005.\n49. "
    },
    {
        "question": "In a solar or lunar eclipse, the region of earth’s shadow is divid- ed into ",
        "option1": " Five parts ",
        "option2": " Four parts ",
        "option3": " Two parts ",
        "option4": " Three parts",
        "category": "physical geography",
        "answar": "4",
        "explain": " An eclipse occurs when a star (such as Sun) aligns\nwith two celestial bodies, such as a planet and a moon.\nThe closer body casts a shadow that intersects the\nmore distant body. This means that “things get dark.”\nThe region of shadow is divided into an umbra, where\nthe light from the star is completely blocked, and a\npenumbra, where only a portion of the light is blocked.\nBeyond the end of the umbra is a region called the\nantumbra. For an observer inside the antumbra of a\nsolar eclipse, for example, the moon appears smaller\nthan the sun, resulting in an annular eclipse.\n50. "
    },
    {
        "question": "Day and Night are equal at the: ",
        "option1": " Prime Meridian ",
        "option2": " Antarctic ",
        "option3": " Poles ",
        "option4": " Eqator",
        "category": "physical geography",
        "answar": "4",
        "explain": " The equator receives equal day and night through-\nout the year because it does not tilt in relation to the\nsun’s location. Because of the tilted axis of the Earth,\nthe poles and locations away from the equator lean\ntowards or away from the sun as an orbit is complet-\ned, while the equator stays in essentially the same\nlocation relative to the sun.\n51. "
    },
    {
        "question": "Name the first Asian country to Orbit Mars. ",
        "option1": " Japan ",
        "option2": " Pakistan ",
        "option3": " China ",
        "option4": " India",
        "category": "physical geography",
        "answar": "4",
        "explain": " India is the first Asian nation to reach Mars orbit,\nand the first nation in the world to do so in its first\nattempt. Its Mars Orbiter Mission (MOM), also called\nMangalyaan, was launched on 5 November 2013 by\nthe Indian Space Research Organisation (ISRO). It\nhas been orbiting Mars since 24 September 2014.\n52. "
    },
    {
        "question": "Which of the following Scientist proved that the path of each plan- et around the Sun is elliptical? ",
        "option1": " Kepler ",
        "option2": " Galileo ",
        "option3": " Newton ",
        "option4": " Copernicus",
        "category": "physical geography",
        "answar": "1",
        "explain": " According to Kepler’s First law (Law of Orbits), each\nplanet revolves around the sun in an elliptic orbit, the\nsun occupying one of the Foci. The elliptical shape of\nthe orbit is a result of the inverse square force of grav-\nity. Kepler’s laws were derived for orbits around the\nsun, but they apply to satellite orbits as well.\n53. "
    },
    {
        "question": "Which of the following is an al- ternative theory to the Big Bang theory developed in 1948, stat- ing that the universe does not change even though it is expand- ing over time ? ",
        "option1": " Oscillating Universe ",
        "option2": " Steady State Universe ",
        "option3": " Mirror Universe ",
        "option4": " Eternal Inflation",
        "category": "physical geography",
        "answar": "2",
        "explain": " The Steady State theory (also known as the Infinite\nUniverse theory or continuous creation) was devel-\noped in 1948 by Fred Hoyle, Thomas Gold, Hermann\nBondi and others as an alternative to the Big Bang\ntheory. In the steady-state theory, the density of mat-\nter in the expanding universe remains unchanged due\nto a continuous creation of matter. It asserts that the\nobservable universe is basically the same at any time\nas well as at any place.\n54. "
    },
    {
        "question": "The constellation ‘Sapta Rishi’ is known to Westerners as the ",
        "option1": " Seven Monks ",
        "option2": " Alpha Centauri ",
        "option3": " Big Dipper ",
        "option4": " Small Bear",
        "category": "physical geography",
        "answar": "3",
        "explain": " The Big Dipper is an asterism consisting of the\nseven brightest stars of the constellation Ursa Major.\nIn Hindu astronomy, it is referred to as the “Collec-\ntion of Seven Great Sages” (Saptarshi Mandal), as each\nstar is named after a mythical Hindu sage.\n55. "
    },
    {
        "question": "Which of these is a dwarf plan- et? ",
        "option1": " Neptune ",
        "option2": " Titan ",
        "option3": " Eris ",
        "option4": " Hydra",
        "category": "physical geography",
        "answar": "3",
        "explain": " Eris is the most massive and second-largest dwarf\nplanet known in the Solar System. It is 27% more\nmassive than dwarf planet Pluto. Eris is the ninth-\nmost-massive known body directly orbiting the Sun,\nand the largest known body in the Solar System not\nvisited by a spacecraft.\n56. "
    },
    {
        "question": "Stars twinkle but planets do not twinkle because ",
        "option1": " they emit light of a constant intensity ",
        "option2": " their distance from the earth does not change with time ",
        "option3": " they are very far away from the earth resulting in de- crease in intensity of light ",
        "option4": " they are nearer to the earth and hence we receive a great- er amount of light and there- fore minor variations in inten- sity are not noticeable",
        "category": "physical geography",
        "answar": "4",
        "explain": " Stars twinkle because they are point light sources.\nPassing through the atmosphere, the small beam of\nlight constantly shifts by bouncing off particles in the\nair. The much closer planets appear instead as tiny\ndisks in the sky. Their apparent sizes are usually larger\nthan the pockets of air that would distort their light,\nso the effects of scintillation are negligible. Being clos-\ner, planets appear as discs, with the shifting of light\nfrom one side cancelling out the other.\n57. "
    },
    {
        "question": "The outermost layer of sun is called ",
        "option1": " Lithosphere ",
        "option2": " Chromosphere ",
        "option3": " Photosphere ",
        "option4": " Corona",
        "category": "physical geography",
        "answar": "4",
        "explain": " The corona is the outermost layer of the Sun,\nstarting at about 1300 miles (2100 km) above the\nsolar surface (the photosphere). The temperature in\nthe corona is 500,000 K (900,000 degrees F, 500,000\ndegrees C) or more, up to a few million K. The corona\ncannot be seen with the naked eye except during a\ntotal solar eclipse. The corona does not have an up-\nper limit.\n58. "
    },
    {
        "question": "On which date is India likely to experience the shortest day? ",
        "option1": " December 22 ",
        "option2": " March 21 ",
        "option3": " June 22 ",
        "option4": " September 23",
        "category": "physical geography",
        "answar": "1",
        "explain": " 21-23 December, also known as winter solstice, is\nthe shortest day of the year in the northern hemi-\nsphere. India, being in the northern hemisphere, ex-\nperiences its shortest day and longest night on this\nvery day. The winter solstice occurs at the moment\nwhen the North Pole is tilted furthest away from the\nsun.\n59. "
    },
    {
        "question": "When does solar eclipse take place ? ",
        "option1": " When the sun is between the moon and earth ",
        "option2": " When the earth is between the moon and sun ",
        "option3": " When the moon is between the sun and earth ",
        "option4": " When the moon does not lie on the line joining the sun and earth",
        "category": "physical geography",
        "answar": "3",
        "explain": " A solar eclipse occurs when the moon gets be-\ntween Earth and the sun, and the moon casts a shad-\now over Earth. A solar eclipse can only take place at\nthe phase of new moon, when the moon passes di-\nrectly between the sun and Earth and its shadows fall\nupon Earth’s surface.\n60. "
    },
    {
        "question": "When does the sun shine verti- cally on the Equator ? ",
        "option1": " Throughout the year ",
        "option2": " For six months ",
        "option3": " Twice a year ",
        "option4": " Once a year",
        "category": "physical geography",
        "answar": "3",
        "explain": " When the Sun is vertically above the equator, the\nday is of equal length all over Earth. This happens\ntwice a year, and these are the “equinoxes” in March\nand in September. Between the two tropic zones,\nwhich includes the equator, the Sun is directly over-\nhead twice per year. Outside the tropic zones, wheth-\ner to the south or north, the Sun is never directly\noverhead.\n61. "
    },
    {
        "question": "If a star is bigger than Sun, but not more than twice as big, it will turn into a _______. ",
        "option1": " Pulsar ",
        "option2": " Maxima ",
        "option3": " Avenger ",
        "option4": " Discover",
        "category": "physical geography",
        "answar": "1",
        "explain": " If the star is about the mass of the Sun or less\nthan that, it will turn into White Dwarfs. If the star is\nbigger than the Sun but not more than twice as big, it\nwill turninto a Neutron Star or Pulsar. If the star is\nmany times bigger than the Sun, it will turn into what\nis called a Black Hole."
    },
    {
        "question": "In which of the following plan- ets water cycle is available ? ",
        "option1": " Jupiter ",
        "option2": " Earth ",
        "option3": " Mars ",
        "option4": " Venus",
        "category": "physical geography",
        "answar": "2",
        "explain": " The water cycle, also known as the hydrological\ncycle or H 2O cycle, describes the continuous movement\nof water on, above and below the surface of the Earth.\nAlthough the balance of water on Earth remains fairly\nconstant over time, individual water molecules can\ncome and go, in and out of the atmosphere. The water\nmoves from one reservoir to another, such as from\nriver to ocean, or from the ocean to the atmosphere,\nby the physical processes of evaporation,\ncondensation, precipitation, infiltration, runoff, and\nsubsurface flow. In so doing, the water goes through\ndifferent phases: liquid, solid (ice), and gas (vapor).\n2. "
    },
    {
        "question": "The asteroids revolve round the Sun in between : ",
        "option1": " Earth and Mars ",
        "option2": " Mars and Jupiter ",
        "option3": " Jupiter and Saturn ",
        "option4": " Saturn and Uranus",
        "category": "physical geography",
        "answar": "2",
        "explain": " Asteroids, sometimes called minor planets, are small,\nrocky fragments left over from the formation of our\nsolar system about 4.6 billion years ago. Most of this\nancient space rubble can be found orbiting the sun\nbetween Mars and Jupiter. Asteroids range in size from\nCeres, about 952 km (592 miles) in diameter, to bodies\nthat are less than 1 km across. The total mass of all\nthe asteroids is less than that of Earth’s Moon.\n3. "
    },
    {
        "question": "Which of the following is called the twin of the earth ? ",
        "option1": " Neptune ",
        "option2": " Venus ",
        "option3": " Mars ",
        "option4": " Saturn",
        "category": "physical geography",
        "answar": "2",
        "explain": " Venus is the second planet from the sun and a\nclose neighbor to the earth. It was named after the\nRoman Goddess of Beauty. Venus is usually one the\nbrightest objects in the sky, which might be the reason\nit got its name. It is quite similar to the planet earth\nmainly in its size and a few other characteristics which\nis why it is often considered the Earth’s twin. However,\nsurface conditions are not nearly the same making it\na quite inhospitable environment.\n4. "
    },
    {
        "question": "Which amidst the following plan- ets has its orbit closest to Sun ? ",
        "option1": " Venus ",
        "option2": " Mars ",
        "option3": " Jupiter ",
        "option4": " Uranus",
        "category": "physical geography",
        "answar": "1",
        "explain": " Venus is the brightest planet in our sky and can\nsometimes be seen with the naked eye if we know\nwhere to look. It is the solar system’s brightest planet\n— yellow clouds of sulfuric acid reflect the sun’s light\nbrightly and has its orbit closest to sun but only next\nto mercury.\n5. "
    },
    {
        "question": "The light from the Sun reaches the Earth in about— ",
        "option1": " 8 seconds ",
        "option2": " 8 minutes ",
        "option3": " 10 seconds ",
        "option4": " 10 minutes",
        "category": "physical geography",
        "answar": "2",
        "explain": " Light travels at 186,000 miles a second at the Earth\nis 93 million miles to Sun on average. This works out\nas 8.33 minutes for light from the Sun to reach Earth.\nOn average, it takes energy between 10,000 and\n170,000 years to leave the sun’s interior and then be\nemitted from the surface as light. Sunlight, in the\nbroad sense, is the total frequency spectrum of\nelectromagnetic radiation given off by the Sun,\nparticularly infrared, visible, and ultraviolet light. On\nEarth, sunlight is filtered through the Earth’s\natmosphere, and is obvious as daylight when the Sun\nis above the horizon.\n6. "
    },
    {
        "question": "The surface temperature of the sun is estimated as ",
        "option1": " 6000 °C ",
        "option2": " 12000 °C ",
        "option3": " 18000 °C ",
        "option4": " 24000 °C",
        "category": "physical geography",
        "answar": "1",
        "explain": " The surface of the sun is called the photosphere.\nThe photosphere is 340 miles thick and it’s temperature\ns range from 5,500°C to 6,000°C. It has dark spots\ncalled sunspots which are the only solar activity\nobservable by the naked eye.\n7. "
    },
    {
        "question": "Which one of the following plan- ets has no moon? ",
        "option1": " Mars ",
        "option2": " Neptune ",
        "option3": " Mercury ",
        "option4": " Pluto",
        "category": "physical geography",
        "answar": "3",
        "explain": " Mercury and Venus are the only two recognized\nplanets in our solar system without moons. However,\nthere are many, many planets in the universe and a\nsignificant portion of these, if our solar system is\nassumed representative of at least a significant portion\nof the universe’s planetary systems likely have no\nmoons.\n8. "
    },
    {
        "question": "Which one of the following is called a red planet ? ",
        "option1": " Venus ",
        "option2": " Mercury ",
        "option3": " Mars ",
        "option4": " Jupiter",
        "category": "physical geography",
        "answar": "3",
        "explain": " Mars is the fourth planet from the Sun and the\nsecond smallest planet in the Solar System. Named\nafter the Roman god of war, it is often described as\nthe “Red Planet”, as the iron oxide prevalent on its\nsurface gives it a reddish appearance. Mars is a\nterrestrial planet with a thin atmosphere, having\nsurface features reminiscent both of the impact craters\nof the Moon and the volcanoes, valleys, deserts, and\npolar ice caps of Earth.\n9. "
    },
    {
        "question": "Brightest planet in our solar sys- tem is ",
        "option1": " Venus ",
        "option2": " Mercury ",
        "option3": " Mars ",
        "option4": " Jupiter",
        "category": "physical geography",
        "answar": "1",
        "explain": " Venus has the highest albedo of any planet in our\nsolar system. Venus is so bright partly because it\nreflects over 70 per cent of sunlight striking it. It owes\nits reflective ability to the fact that it’s blanketed with\nclouds. Sunlight bouncing from these clouds is what\nmakes Venus so bright."
    },
    {
        "question": "Hanging Valley is formed due to the action of ",
        "option1": " Glacier ",
        "option2": " River ",
        "option3": " Ocean ",
        "option4": " Wind",
        "category": "physical geography",
        "answar": "1",
        "explain": " A hanging valley is a tributary valley with the floor\nat a higher relief than the main channel into which it\nflows. They are most commonly associated with U-\nshaped valleys when a tributary glacier flows into a\nglacier of larger volume. The main glacier erodes a\ndeep U-shaped valley with nearly vertical sides while\nthe tributary glacier, with a smaller volume of ice,\nmakes a shallower U-shaped valley. Since the\nsurfaces of the glaciers were originally at the same\nelevation, the shallower valley appears to be ‘hanging’\nabove the main valley\n11. "
    },
    {
        "question": "Mushroom Rocks are the typi- cal land forms seen in ",
        "option1": " River Valleys ",
        "option2": " Mountain tops ",
        "option3": " Coastal areas ",
        "option4": " Deserts",
        "category": "physical geography",
        "answar": "4",
        "explain": " A mushroom rock, also called rock pedestal or a\npedestal rock, is a naturally occurring rock whose\nshape, as its name implies, strikingly resembles a\nmushroom. Usually found in desert areas, these rocks\nare formed over thousands of years when wind erosion\nof an isolated rocky outcrop progresses at a different\nrate at its bottom to that at its top.\n12. "
    },
    {
        "question": "Basaltic lava is found in the ",
        "option1": " Deccan Trap ",
        "option2": " Himalayas ",
        "option3": " Indo-Gangetic Plain ",
        "option4": " North-Eastern Hills",
        "category": "physical geography",
        "answar": "1",
        "explain": " The Deccan Traps are a large igneous province\nlocated on the Deccan Plateau of west-central India\n(between 17°–24°N, 73°–74°E) and one of the largest\nvolcanic features on Earth. They consist of multiple\nlayers of solidified flood basalt that together are more\nthan 2,000 m (6,562 ft) thick and cover an area of\n500,000 km2 (193,051 sq mi) and a volume of\n512,000 km3\n (123,000 cu mi). The term “trap”, used\nin geology for such rock formations, is derived from\nthe Swedish word for stairs and refers to the step-\nlike hills forming the landscape of the region.\n13. "
    },
    {
        "question": "Which one of the following types of erosion is responsible for the formation of Chambal Ravines ? ",
        "option1": " Splash ",
        "option2": " Sheet ",
        "option3": " Rill ",
        "option4": " Gully",
        "category": "physical geography",
        "answar": "4",
        "explain": " Chambal ravine formation significantly increases\nsoil loss from agricultural lands and severely impacts\nagricultural productivity. A review of ephemeral gully\nerosion and spreading rates of the ravenous tracks\nof Lower Chambal Valley using geospatial tools shows\nthat both the ravenous and the marginal lands have\nincreased during the last 15 years.\n14. "
    },
    {
        "question": "Consider the following geological phenomena : I. Development of a fault II. Movement along a fault III. Impact produced by a vol- canic eruption IV. Folding of rocks quakes ? ",
        "option1": " I, II and III ",
        "option2": " II and IV ",
        "option3": " I, III and IV ",
        "option4": " I to IV",
        "category": "physical geography",
        "answar": "1",
        "explain": " Earthquakes are caused by faulting, a sudden\nlateral or vertical movement of rock along a rupture\n(break) surface. Earthquakes often occur in volcanic\nregions and are caused there, both by tectonic faults\nand the movement of magma in volcanoes. Such\nearthquakes can serve as an early warning of volcanic\neruptions, as during the Mount St. Helens eruption\nof 1980.\n15. "
    },
    {
        "question": "Shale is metamorphosed into which of the following rocks? ",
        "option1": " Graphite ",
        "option2": " Gneiss ",
        "option3": " Marble ",
        "option4": " Slate",
        "category": "physical geography",
        "answar": "4",
        "explain": " From depth of burial by continual sediment\ndeposition from above, or from compressional stress\nfrom tectonic plate collisions, shale is metamorphosed\ninto slate over periods of millions of years. During\nthis compression, the clay minerals making up the\nshale decompose as they become unstable in the high\npressure environment, and their chemi cal\ncomponents are gradually transformed into minerals\nthat are more stable in the newly forming higher\npressure environment.\n16. "
    },
    {
        "question": "Where are the hot deserts gen- erally found ? ",
        "option1": " On the eastern margins of the Tropics ",
        "option2": " On the western margins of the Tropics ",
        "option3": " Nearer the Equator ",
        "option4": " In the middle of the Conti- nents",
        "category": "physical geography",
        "answar": "2",
        "explain": " The deserts lie in the belt of the trade winds which\nblow from northeast in the northern hemisphere and\nsoutheast in the southern hemisphere. There-fore,\nthe general direction of the trade winds is from the\neast to west. These winds shed their moisture on\nthe eastern margins of the continents and by the\ntime they reach the west they have lost their moisture.\nThe hot desert climate is found around the tropics of\nCapricorn and Cancer, usually on the west side of\ncontinents. Examples are the Thar Desert in Pakistan\nand the Atacama desert in Chile.\n17. "
    },
    {
        "question": "Why are winters more severe in Southern Hemisphere than in Northern Hemisphere? ",
        "option1": " Earth is titled towards the sun in the Northern Hemi- sphere ",
        "option2": " Northern Hemisphere re- ceives more sunlight ",
        "option3": " Because of more iceberg ac- tivity in Southern Hemi- sphere ",
        "option4": " Southern Hemisphere is less inhabited",
        "category": "physical geography",
        "answar": "1",
        "explain": " The winter in the Southern Hemisphere occurs\nwhen the Northern hemisphere is tilted more toward\nthe Sun. From the perspective of an observer on the\nEarth, the winter Sun has a lower maximum altitude\nin the sky than the summer Sun.\n18. "
    },
    {
        "question": "Marble is the metamorphosed form of ",
        "option1": " Shale ",
        "option2": " Basalt ",
        "option3": " Sandstone ",
        "option4": " Limestone",
        "category": "physical geography",
        "answar": "4",
        "explain": " Marble is a non-foliated metamorphic rock\ncomposed of re-crystallized carbonate minerals, most\ncommonly calcite or dolomite. Geologists use the term\n“marble” to refer to metamorphosed limestone. Marble\nis a rock resulting from metamorphism of\nsedimentary carbonate rocks, most commonly\nlimestone or dolomite rock. Metamorphism causes\nvariable recrystallization of the original carbonate\nmineral grains. The resulting marble rock is typically\ncomposed of an interlocking mosaic of carbonate\ncrystals. Primary sedimentary textures and structures\nof the original carbonate rock (protolith) have typically\nbeen modified or destroyed.\n19. "
    },
    {
        "question": "The highest mountain peak of the Himalayas is situated in— ",
        "option1": " India ",
        "option2": " Tibet ",
        "option3": " Nepal ",
        "option4": " China",
        "category": "physical geography",
        "answar": "3",
        "explain": " Overall, the Himalayan mountain system is the\nworld’s highest, and is home to the world’s highest\npeaks, the Eight-thousanders. The Mount Everest is\nthe highest peak having elevation of 8848 m and is\nsituated in East of Kathmandu on Sagarmatha Zone\nNepal. Mount Everest is the Earth’s highest mountain,\nwith a peak at 8,848 metres above sea level. It is\nlocated in the Mahalangur section of the Himalayas.\nThe international border between China and Nepal\nruns across the precise summit point.\n20. "
    },
    {
        "question": "Metamorphic rocks originate from— ",
        "option1": " igneous rocks ",
        "option2": " sedimentary rocks ",
        "option3": " both igneous and sedime- ntary rocks ",
        "option4": " None of these",
        "category": "physical geography",
        "answar": "3",
        "explain": " Metamorphic rocks are rocks that have “morphed”\ninto another kind of rock. These rocks were once\nigneous or sedimentary rocks. How do sedimentary\nand igneous rocks change? The rocks are under tons\nand tons of pressure, which fosters heat build-up,\nand this causes them to change. If you exam\nmetamorphic rock samples closely, you’ll discover\nhow flattened some of the grains in the rock are.\n21. "
    },
    {
        "question": "The term ‘epicentre’ is associated with— ",
        "option1": " earthquake ",
        "option2": " folding ",
        "option3": " faulting ",
        "option4": " earth’s interior",
        "category": "physical geography",
        "answar": "1",
        "explain": " The epicenter is the point on the Earth’s surface\nthat is directly above the hypocenter or focus, the\npoint where an earthquake or underground explosion\noriginates. In the case of earthquakes, the epicenter\nis directly above the point where the fault begins to\nrupture, and in most cases, it is the area of greatest\ndamage. However, in larger events, the length of the\nfault rupture is much longer, and damage can be\nspread across the rupture zone..\n22. "
    },
    {
        "question": "The Earth rotates on its axis at an inclination of ",
        "option1": " 23*1/2° ",
        "option2": " 22*1/2° ",
        "option3": " 21*1/2° ",
        "option4": " 20",
        "category": "physical geography",
        "answar": "1",
        "explain": " The Earth is rotating around an axis (called its\nrotational axis). Some objects rotate about a horizontal\naxis, like a rolling log. Some objects, such as a skater,\nrotate about a vertical axis. The Earth’s axis is tipped\nover about 23.5° from vertical.\n23. "
    },
    {
        "question": "Dolomite is a/an ",
        "option1": " Sedimentary rock ",
        "option2": " Plutonic rock ",
        "option3": " Igneous rock ",
        "option4": " Metamorphic rock",
        "category": "physical geography",
        "answar": "1",
        "explain": " Dolomite a sedimentary rock resembling limestone\nbut consisting principally of the mineral dolomite. It\nis an important source of magnesium and its\ncompounds, and is used as a building material and\nrefractory. Dolomite is used as an ornamental stone,\na concrete aggregate, a source of magnesium oxide\nand in the Pidgeon process for the production of\nmagnesium. It is an important petroleum reservoir\nrock, and serves as the host rock for large strata-\nbound Mississippi Valley-Type (MVT) ore deposits of\nbase metals such as lead, zinc, and copper. Where\ncalcite limestone is uncommon or too costly, dolomite\nis sometimes used in its place as a flux for the\nsmelting of iron and steel. Large quantities of\nprocessed dolomite are used in the production of\nfloat glass.\n24. "
    },
    {
        "question": "A geyser is a spring which ",
        "option1": " throws water continuously ",
        "option2": " throws water intermittently ",
        "option3": " throws water and steam at regular intervals ",
        "option4": " throws only steam",
        "category": "physical geography",
        "answar": "3",
        "explain": " A geyser is a spring characterized by intermittent\ndischarge of water ej ected turbul ently and\naccompanied by a vapour phase (steam). The word\ngeyser comes from Geysir, the name of an erupting\nspring at Haukadalur, Iceland; that name, in turn,\ncomes from the Icelandic verb geysa, “to gush”, the\nverb itself from Old Norse.\n25. "
    },
    {
        "question": "Which one of the following is ig- neous rock ? ",
        "option1": " Limestone ",
        "option2": " Granite ",
        "option3": " Marble ",
        "option4": " Slate",
        "category": "physical geography",
        "answar": "2",
        "explain": " Igneous rock (derived from the Latin word ignis\nmeaning fire) is one of the three main rock types, the\nothers being sedimentary and metamorphic rock.\nIgneous rock is formed through the cooling and\nsolidification of magma or lava. Igneous rock may\nform with or without crystallization, either below the\nsurface as intrusive (plutonic) rocks or on the surface\nas extrusive (volcanic) rocks. This magma can be\nderived from partial melts of pre-existing rocks in\neither a planet’s mantle or crust. Typically, the melting\nis caused by one or more of three processes: an\nincrease in temperature, a decrease in pressure, or\na change in composition. Granite is the best-known\nigneous rock. Many people recognize granite because\nit is the most common igneous rock found at Earth’s\nsurface and because granite is used to make many\nobjects that we encounter in daily life.\n26. "
    },
    {
        "question": "How many minutes for each degree of longitude does the local time of any place vary from the Greenwich time ? ",
        "option1": " Two minutes ",
        "option2": " Four minutes ",
        "option3": " Six minutes ",
        "option4": " Eight minutes",
        "category": "physical geography",
        "answar": "2",
        "explain": " The first of these ideas is the relationship between\ntime and the rotation of the Earth. It takes an average\ntime of 24 hours for the Earth to rotate 360 degrees.\nIf you divide the number degrees in a circle by the\nnumber of hours in a day, we find that the Earth\nturns 15 degrees each hour.360° / 24 hours = 15°\nper hour. We can take this a step further and state\nthat the Earth turns one degree in four minutes.1\nhour = 60 minutes / 15° = 4 minutes per degree\n27. "
    },
    {
        "question": "The tropical grassland is called ",
        "option1": " Pampas ",
        "option2": " Llanas ",
        "option3": " Savanah ",
        "option4": " Veld",
        "category": "physical geography",
        "answar": "3",
        "explain": " Tropical grasslands (Savannas) are located near\nthe equator, between the Tropic of Cancer and the\nTropic of Capricorn. They cover much of Africa as\nwell as large areas of Australia, South America, and\nIndia. They are found in tropical wet and dry climates.\nThese areas are hot year-round, usually never\ndropping under 64 degrees Farenheit. Although these\nareas are overall very dry, they do have a season of\nheavy rain. Annual rainfall is from 20-50 inches per\nyear. It is crucial that the rainfall is concentrated in\nsix or eight months of the year, followed by a long\nperiod of drought when fires can occur. Savannas\nare associated with several types of biomes. Savannas\nare frequently in a transitional zone between forest\nand desert or grassland. Savanna covers\napproximately 20% of the Earth’s land area.\n28. "
    },
    {
        "question": "The topography of plateau is ideal for ",
        "option1": " cultivation ",
        "option2": " forestry ",
        "option3": " mining ",
        "option4": " generation of hydro power",
        "category": "physical geography",
        "answar": "4",
        "explain": " The prospect of producing electricity from the\nhydrological resources of the Plateau region lies not,\nas has been suggested, in the ‘region’s fast flowing\nrivers’. The flow rate of most rivers in the region is\nrelatively slow. However, the sloped topography of\nthe plateau itself provides enormous capacity to\ngenerate electricity. All existing and planned\nhydropower projects in the region are based on the\nsimple engineering principle of utilizing gravity to\ngenerate energy from the region’s rivers. The steep\nescarpments found in the south-eastern portion of\nthe regi on provide the natural topographical\nmechanism to subject the region’s water resources\nto the energy-producing force of gravity.\n29. "
    },
    {
        "question": "Which of the following state- ments is correct ? ",
        "option1": " Lava and magma both have gas ",
        "option2": " Neither the lava nor the mag- ma has gas ",
        "option3": " Magma has gas while lava has no gas ",
        "option4": " Lava has gas while magma has no gas",
        "category": "physical geography",
        "answar": "1",
        "explain": " Highly viscous lava tends to entrap gas, which\nform vesicles (bubbles) within the rock as they rise\nto the surface. Lava with low viscosity tends to easily\nrelease bubbling gases as they are formed. Lavas\nalso may contain many other components, sometimes\nincluding solid crystals of various minerals, fragments\nof exotic rocks known as xenoliths and fragments of\npreviously solidified lava. Volcanic eruptions are\ncaused by magma (a mixture of liquid rock, crystals,\nand dissolved gas) expelled onto the Earth’s surface.\nAt depth in the Earth nearly all magmas contain gas\ndissolved in the liquid, but the gas forms a separate\nvapor phase when pressure is decreased as magma\nrises toward the surface of the Earth. This is similar\nto carbonated beverages which are bottled at high\npressure. The high pressure keeps the gas in solution\nin the liquid. Gas gives magmas their explosive\ncharacter, because volume of gas expands as pressure\nis reduced.\n30. "
    },
    {
        "question": "Which one of the following is the example of sedimentary rocks ? ",
        "option1": " Loess ",
        "option2": " Basalt ",
        "option3": " Granite ",
        "option4": " Gabbro",
        "category": "physical geography",
        "answar": "1",
        "explain": " Loess is an Aeolian sediment formed by the\naccumulation of wind-blown silt, typically in the 20–\n50 micrometer size range, twenty percent or less\nclay and the balance equal parts sand and silt that\nare loosely cemented by calcium carbonate. It is\nusually homogeneous and highly porous and is\ntraversed by vertical capillaries that permit the\nsediment to fracture and form vertical bluffs. The\nword loess, with connotations of origin by wind-\ndeposited accumulation, is of German origin and\nmeans “loose.” It was first applied to Rhine River\nvalley loess about 1821.\n31. "
    },
    {
        "question": "Mica is found in which one of the following pairs of rocks ? ",
        "option1": " Slate- Sandstone ",
        "option2": " Schist-Gneiss ",
        "option3": " Limestone-Sandstone ",
        "option4": " Shale- Limestone",
        "category": "physical geography",
        "answar": "2",
        "explain": " The schists constitute a group of medium-grade\nmetamorphi c rocks, chiefly notabl e for the\npreponderance of lamellar minerals such as micas,\nchlorite, talc, hornblende, graphite, and others.\nGneissic rocks are usually medium- to coarse-foliated\nand largely recrystallized but do not carry large\nquantities of micas, chlorite or other platy minerals.\nMica minerals make some rocks sparkle! They are\noften found in igneous rocks such as granite and\nmetamorphic rocks such as schist. Most schists are\nmica schists, but graphite and chlorite schists are\nalso common. Schist is a crystalline metamorphic\nrock, mostly composed of more than 50% tabular\nand elongated minerals.\n32. "
    },
    {
        "question": "The Mohorovicic (Moho) Discon- tinuity separates ",
        "option1": " Outer core and Mantle ",
        "option2": " Inner and Outer core ",
        "option3": " Sima and Nife ",
        "option4": " Crust and Mantle",
        "category": "physical geography",
        "answar": "4",
        "explain": " The Mohorovicic discontinuity, usually referred\nto as the Moho, is the boundary between the Earth’s\ncrust and the mantle. Named after the pioneering\nCroatian seismologist Andrija Mohorovicic, the Moho\nseparates both the oceanic crust and continental crust\nfrom underlying mantle. The Moho mostly lies entirely\nwithin the lithosphere; only beneath mid-ocean ridges\ndoes it define the lithosphere – asthenosphere\nboundary..\n33. "
    },
    {
        "question": "Suppose if we measure the time lapse between the two Sunsets by sitting in the beach, from this we can estimate ",
        "option1": " The distance between the sun and the earth ",
        "option2": " The depth of the ocean ",
        "option3": " The radius of the earth ",
        "option4": " The radius of the sun",
        "category": "physical geography",
        "answar": "3",
        "explain": " A method is described whereby, using primitive\nequipment anyone can measure the size of the earth\nto an accuracy of order of magnitude 10% by\nobserving two sunsets in the space of a few seconds.\n34. "
    },
    {
        "question": "What is the International Date Line ? ",
        "option1": " It is the equator ",
        "option2": " It is the 0° longitude ",
        "option3": " It is the 90° east longitude ",
        "option4": " It is the 180° longitude",
        "category": "physical geography",
        "answar": "4",
        "explain": " The International Date Line (IDL) is an imaginary\nline on the surface of the Earth, that runs from the\nnorth to the south pole and demarcates one calendar\nday from the next. It passes through the middle of\nthe Pacific Ocean, roughly following the 180° longitude\nbut it deviates to pass around some territories and\nisland groups.\n35. "
    },
    {
        "question": "Earthquake is caused by ",
        "option1": " disturbance of earth surface ",
        "option2": " adjustment of layers of earth’s crust ",
        "option3": " breakage of rock system ",
        "option4": " upliftment of rocks",
        "category": "physical geography",
        "answar": "1",
        "explain": " Most earthquakes are minor tremors. Larger\nearthquakes usually begin with slight tremors but\nrapidly take the form of one or more violent shocks,\nand end in vibrations of gradually diminishing force\ncalled aftershocks. The subterranean point of origin\nof an earthquake is called its focus; the point on the\nsurface directly above the focus is the epicenter.\n36. "
    },
    {
        "question": "The highest grade and best qual- ity coal is ",
        "option1": " Lignite ",
        "option2": " Peat ",
        "option3": " Bituminous ",
        "option4": " Anthracite",
        "category": "physical geography",
        "answar": "4",
        "explain": " Anthracite is usually considered to be the highest\ngrade of coal and is actually considered to be\nmetamorphic. Compared to other coals it is much\nharder, has a glassy luster, and is denser and blacker\nwith few impurities. It is largely used for heating\ndomestically as it burns with little smoke.\n37. "
    },
    {
        "question": "River erosion is at its greatest where river’s ",
        "option1": " depth is more ",
        "option2": " breadth is more ",
        "option3": " flow is fast ",
        "option4": " gradient is more",
        "category": "physical geography",
        "answar": "3",
        "explain": " The outer bank (called a cut bank) has the greatest\nerosion because the water is flowing faster along the\nouter bank than the inner bank. The slower water\nallows sediment to be deposited (called a point bar).\n38. "
    },
    {
        "question": "In which of the following is the Great Barrier Reef located ? ",
        "option1": " Coral Sea ",
        "option2": " Solomon Sea ",
        "option3": " Bismarck Sea ",
        "option4": " Arafura Sea",
        "category": "physical geography",
        "answar": "1",
        "explain": " The Great Barrier Reef is in the Coral Sea, on\nAustralia’s north-eastern coast. It stretches more than\n2,300km along the state of Queensland’s coastline,\nbeginning at the tip of Cape York Peninsula in the\nnorth and extending down to Bundaberg in the south.\nThe Great Barrier Reef is ideal for Cairns Scuba Diving.\n39. "
    },
    {
        "question": "The term ‘epicentre’ is associat- ed with ",
        "option1": " Earthquakes ",
        "option2": " Volcanoes ",
        "option3": " Cyclones ",
        "option4": " Landslides",
        "category": "physical geography",
        "answar": "1",
        "explain": " Epicenter is the point on the Earth’s surface that\nis directly above the hypocenter or focus, the point\nwhere an earthquake or underground explosion\noriginates. Epicentral distance is used in calculating\nseismic magnitudes developed by Richter and\nGutenberg.\n40. "
    },
    {
        "question": "What is the scale used for mea- suring the intensity of the earth- quake? ",
        "option1": " Richter scale ",
        "option2": " Metric scale ",
        "option3": " Centigrade scale ",
        "option4": " Newton’s scale",
        "category": "physical geography",
        "answar": "4",
        "explain": "Magnitude and Intensity measure different\ncharacteristics of earthquakes. Magnitude measures\nthe energy released at the source of the earthquake.\nMagnitude is determined from measurements on\nseismographs. Intensity measures the strength of\nshaking produced by the earthquake at a certain\nlocation. Intensity is determined from effects on\npeople, human structures, and the natural\nenvironment. The Mercalli intensity scale is a seismic\nscale used for measuring the intensity of an\nearthquake. It measures the effects of an earthquake,\nand is distinct from the moment magnitude usually\nreported for an earthquake (sometimes described as\nthe obsolete Richter magnitude), which is a measure\nof the energy released. The intensity of an earthquake\nis not totally determined by its magnitude..\n41. "
    },
    {
        "question": "Equator represents ",
        "option1": " line joining North and South poles ",
        "option2": " imaginary line passing round the Earth midway between North & South poles ",
        "option3": " a belt (ring) around the planet Saturn ",
        "option4": " axis of rotation of Earth",
        "category": "physical geography",
        "answar": "2",
        "explain": " An equator is the intersection of a sphere’s surface\nwith the plane perpendicular to the sphere’s axis of\nrotation and containing the sphere’s center of mass.\nNotably, the Equator refers to the Earth’s equator,\nper above: an imaginary line on the Earth’s surface\nequidistant from the North Pole and South Pole,\ndividing the Earth into the Northern Hemisphere and\nSouthern Hemisphere. Other planets and spherical\nastronomical bodies have equators similarly defined.\nThe length of the Equator is roughly 40,075\nkilometres.\n42. "
    },
    {
        "question": "The acceleration due to gravity at the equator ",
        "option1": " is less than that at the poles ",
        "option2": " is greater than that at the poles ",
        "option3": " is equal to that at the poles ",
        "option4": " does not depend on the",
        "category": "physical geography",
        "answar": "1",
        "explain": " The gravity of Earth, denoted g, refers to the\nacceleration that the Earth imparts to objects on or\nnear its surface. At latitudes nearer the Equator, the\ninertia produced by Earth’s rotation is stronger than\nat polar latitudes. This counteracts the Earth’s gravity\nto a small degree – up to a maximum of 0.3% at the\nEquator – reducing the downward acceleration of\nfalling objects. The second major reason for the\nPHYSICAL Gdifference in gravity at different latitudes is that the\nEarth’s equatorial bulge (itself also caused by inertia)\ncauses objects at the Equator to be farther from the\nplanet’s centre than objects at the poles. Because\nthe force due to gravitational attraction between two\nbodies (the Earth and the object being weighed) varies\ninversely with the square of the distance between\nthem, an object at the Equator experiences a weaker\ngravitational pull than an object at the poles.\n43.\n "
    },
    {
        "question": "The ‘Pacific Ring of Fire’ is as- sociated with ",
        "option1": " oil well fires ",
        "option2": " thermal power station ",
        "option3": " volcanoes and earthquakes ",
        "option4": " forest fires",
        "category": "physical geography",
        "answar": "3",
        "explain": " The Pacific Ring of Fire is an area where a large\nnumber of earthquakes and volcanic eruptions occur\nin the basin of the Pacific Ocean. In a 40,000 km\nhorseshoe shape, it is associated with a nearly\ncontinuous series of oceanic trenches, volcanic arcs,\nand volcanic belts and/or plate movements. The Ring\nof Fire has 452 volcanoes and is home to over 75%\nof the world’s active and dormant volcanoes. It is\nsometimes called the circum-Pacific belt or the\ncircum-Pacific seismic belt. About 90% of the world’s\nearthquakes and 81% of the world’s largest\nearthquakes occur along the Ring of Fire.\n44.\n "
    },
    {
        "question": "Which one of the following riv- ers forms an estuary ? ",
        "option1": " Ganga ",
        "option2": " Tapti ",
        "option3": " Godavari ",
        "option4": " Mahanadi",
        "category": "physical geography",
        "answar": "2",
        "explain": " Tapti river empties into the Gulf of Cambay of the\nArabian Sea, forming an estuary. It is fed by monsoon\nrains. The mean flow rate is about 600 cu m per sec,\nwith the maximum in the summer. The Tapti is\nnavigable by small craft for a distance of 50 km from\nthe mouth. In some places it is used for irrigation.\nThe seaport of Surat is located in the estuary.\n45.\n "
    },
    {
        "question": "How much of the Earth's land surface is desert ? ",
        "option1": " 1/10th ",
        "option2": " 1/5th ",
        "option3": " 1/3rd ",
        "option4": " 1/6th",
        "category": "physical geography",
        "answar": "3",
        "explain": " Deserts take up about one third (33%) of the Earth’s\nland surface. Hot deserts usually have a large diurnal\nand seasonal temperature range, with high daytime\ntemperatures, and low nighttime temperatures (due\nto extremely low humidity). In hot deserts the\ntemperature in the daytime can reach 45 °C/113 °F\nor higher in the summer, and dip to 0 °C/32 °F or\nlower at nighttime in the winter.\n46.\n "
    },
    {
        "question": "What percentage of world’s freshwater is stored as glacial ice ? ",
        "option1": " 50% ",
        "option2": " 10% ",
        "option3": " 70% ",
        "option4": " 30%",
        "category": "physical geography",
        "answar": "3",
        "explain": " About 70% of the world’s fresh water is stored as\nglacial ice. Only 3% water of the earth is fresh, rest\n97% salted. Of that 3%, over 2% is frozen in ice\nsheets and glaciers. Means less than 1% fresh water\nis found in lakes, rivers and underground.\n47.\n "
    },
    {
        "question": "The approximate circumference of the Earth is ",
        "option1": " 13,000 km ",
        "option2": " 20,000 km ",
        "option3": " 25,000 km ",
        "option4": " 30,000 km",
        "category": "physical geography",
        "answar": "3",
        "explain": " The circumference of the earth at the equator is\n24,901.55 miles (40,075.16 kilometers). But, if we\nmeasure the earth throu gh the poles the\ncircumference is a bit shorter - 24,859.82 miles\n(40,008 km). Thus, the earth is a tad wider than it is\ntall, giving it a slight bulge at the equator. This shape\nis known as an ellipsoid or more properly, geoid\n(earth-like).\n48.\n "
    },
    {
        "question": "Desertification can be checked by ",
        "option1": " plugging gullies ",
        "option2": " checking over-grazing ",
        "option3": " contour ploughing ",
        "option4": " forming shelter belts",
        "category": "physical geography",
        "answar": "2",
        "explain": " Overgrazing is the major cause of desertification\nworldwide. Plants of semi-arid areas are adapted to\nbeing eaten by sparsely scattered, large, grazing\nmammals which move in response to the patchy\nrainfall common to these regions. Early human\npastoralists living in semi-arid areas copied this\nnatural system. They moved their small groups of\ndomestic animals in response to food and water\navailability. Such regular stock movement prevented\novergrazing of the fragile plant cover.\n49.\n "
    },
    {
        "question": "In an iceberg floating in the sea, out of 10 parts of its mass, how much will remain above the sur- face of the water? ",
        "option1": " 1 part ",
        "option2": " 2 parts ",
        "option3": " 4 parts ",
        "option4": " 6 parts",
        "category": "physical geography",
        "answar": "1",
        "explain": " Because the density of pure ice is about 920 kg/\nm3, and that of sea water about 1025 kg/m3, typically\nonly one-ninth of the volume of an iceberg is above\nwater.\n50. "
    },
    {
        "question": "A day is added when one crosses ",
        "option1": " the equator from south to north ",
        "option2": " 180 degree longitude from east to west ",
        "option3": " the equator from north to south ",
        "option4": " 180 degree longitude from west to east",
        "category": "physical geography",
        "answar": "1",
        "explain": " A traveler crossing the International Date Line\neastbound subtracts one day, or 24 hours, so that\nthe calendar date to the west of the line is repeated.\nCrossing the IDL westbound results in 24 hours being\nadded, advancing the calendar date by one day. The\nInternational Date Line is necessary to have a fixed,\nalbeit arbitrary, boundary on the globe where the\ncalendar date advances in the westbound direction.\n51. "
    },
    {
        "question": "When does the mo on come between the Sun and earth? ",
        "option1": " Lunar eclipse ",
        "option2": " Solar eclipse ",
        "option3": " Sidereal day ",
        "option4": " Full moon day",
        "category": "physical geography",
        "answar": "2",
        "explain": " As seen from the Earth, a solar eclipse occurs\nwhen the Moon passes between the Sun and Earth,\nand the Moon fully or partially blocks the Sun. This\ncan happen only at new moon, when the Sun and\nthe Moon are in conjunction as seen from Earth. In a\ntotal eclipse, the disk of the Sun is fully obscured by\nthe Moon. In partial and annular eclipses only part\nof the Sun is obscured.\n52. "
    },
    {
        "question": "The l ati tu de of a pl ace i s expressed by its angu lar distance in relation to— ",
        "option1": " Equator ",
        "option2": " South Pole ",
        "option3": " Axis of the Earth ",
        "option4": " North Pole",
        "category": "physical geography",
        "answar": "1",
        "explain": " Latitude is a geographic coordinate that specifies\nthe north-south position of a point on the Earth's\nsurface. The lines of constant latitude, or parallels,\nrun east–west as circles parallel to the equator. Latitude\nis an angle (defined below) which ranges from 0° at\nthe Equator to 90° (North or South) at the poles.\n53. "
    },
    {
        "question": "Hangi ng Vall ey i s very common in ",
        "option1": " high mountains ",
        "option2": " sub-Arctic region ",
        "option3": " glaciated areas ",
        "option4": " coastal belt",
        "category": "physical geography",
        "answar": "3",
        "explain": " When the glaciers melt, the tributary troughs are\nleft as hanging valleys high on the walls of the main\nglacial valley. A hanging valley is a tributary valley\nwith the floor at a higher relief than the main channel\ninto which it flows. They are most commonly\nassociated with U-shaped valleys when a tributary\nglacier flows into a glacier of larger volume.\n54. "
    },
    {
        "question": "The word ‘dendritic’ is associated with— ",
        "option1": " wind ",
        "option2": " waves ",
        "option3": " rivers ",
        "option4": " glaciers",
        "category": "physical geography",
        "answar": "3",
        "explain": " Dendritic drainage systems are the most common\nform of drainage system. The term Dendritic comes\nfrom the Latin word \"dendron\", meaning tree, due to\nthe resemblance of the system to a tree. In a dendritic\nsystem there is one main river (like the trunk of a\ntree), which is joined and formed by many smaller\ntributary rivers. Dendritic systems form in V-shaped\nvalleys; as a result, the rock types must be impervious\nand non-porous.\n55. "
    },
    {
        "question": "When the earth is at the maximum distance from the Sun, it is called ",
        "option1": " Aphelion ",
        "option2": " Perihelion ",
        "option3": " Equinox ",
        "option4": " Sidereal",
        "category": "physical geography",
        "answar": "1",
        "explain": " Aphelion is the point in the path of a celestial\nbody (as a planet) that is farthest from the sun. Its\nopposite is Perihelion which is the point on its orbit\nwhen the Earth is closest to the sun.\n56. "
    },
    {
        "question": "The scale that measures the intensity of earthquakes is called as ",
        "option1": " Vernier scale ",
        "option2": " Richter scale ",
        "option3": " Beaufort scale ",
        "option4": " Diagonal scale",
        "category": "physical geography",
        "answar": "4",
        "explain": " An earthquake is measured by its Magnitude and\nIntensity. The Magnitude indicates the amount of\nenergy released at the source (or epicenter) and is\nmeasured by the open-ended Richter Scale. The\nintensity of an earthquake at a particular locality\nindicates the violence of earth motion produced there\nby the earthquake. It is computed with the help of\nModified Mercalli Scale (MMS).\n57. "
    },
    {
        "question": "The main source of usabl e water on the Earth is ",
        "option1": " Oceans ",
        "option2": " Rivers ",
        "option3": " Underground water ",
        "option4": " Precipitation",
        "category": "physical geography",
        "answar": "3",
        "explain": " Even though most of the Earth's surface is water,\nonly 1% of it is fresh usable water. Ninety-seven\npercent of the Earth's water is saltwater, which\ncontains too many minerals for humans to use\nuntreated. Two percent of our water is \"locked up\"\nin ice caps and glaciers, leaving only one percent as\nusable fresh water. Groundwater comprises 0.62 per\ncent of water, followed by Freshwater Lakes: 0.009\nper cent; and rivers: 0.0001 per cent.\n58. "
    },
    {
        "question": "Which of the following rivers lies in a rift valley? ",
        "option1": " Luni ",
        "option2": " Chambal ",
        "option3": " Sone ",
        "option4": " Tapti",
        "category": "physical geography",
        "answar": "4",
        "explain": " There are three Peninsular rivers which flow in a\nrift valley. Narmada flows westward between the\nPHYSICAL GSatpura and Vindhya ranges. The Tapti River and\nMahi River also flow through rift valleys, but between\ndifferent ranges."
    }
]