[
{"question": " By which of the following method electric power may be transmitted from one location to another location?", "option1": "UnderGround System\n", "option2": "Overhead system\n", "option3": "Both 1 and 2", "option4": "None of the above", "answar": "3", "category": "Transmission and Distribution", "explain": "Electrical power is generally transmitted by two methods i.e underground transmission and overhead transmission", "": ""},
{"question": " Which of the following transmission line have more initial cost?", "option1": "Overhead Transmission", "option2": "Underground transmission", "option3": "Both have almost the same initial cost", "option4": "None of the above", "answar": "2", "category": "Transmission and Distribution", "explain": "The underground cable can be 2-3 times more expensive than the overhead cable.\nAs the voltage level increases the cost of insulation is increased therefore the underground cable is restricted to low and medium voltages.", "": ""},
{"question": " Name the cable or conductor which connects the distributor to the consumer terminals.", "option1": "Service Mains", "option2": "Distributor", "option3": "Feeders", "option4": "None of the above", "answar": "1", "category": "Transmission and Distribution", "explain": "Service Mains: The service mains conductors form connecting links between distributors and metering points at the consumer terminal.\nThe area of connection of a sub-main conductor is greater than the service mains.", "": ""},
{"question": " Which of the following materials are not used for the transmission and distribution of electrical power?", "option1": "Copper", "option2": "Aluminum", "option3": "Tungsten", "option4": "Steel", "answar": "3", "category": "Transmission and Distribution", "explain": "The resistance of tungsten is very high, the more the resistance more the losses, therefore, tungsten is never used for transmission and distribution purposes.", "": ""},
{"question": " The usual spans with R.C.C. poles are", "option1": "40—50 metres", "option2": "60—100 metres", "option3": "200 – 300 meters", "option4": "80 – 150 meters", "answar": "4", "category": "Transmission and Distribution", "explain": "The Reinforced concrete pole (R.C.C) is usually called a Concrete pole and it are used for system voltage up to 33kV.\nThe minimum overall length of the R.C.C pole should be six meters.\nThe span length of R.C.C is between 80 – 200 meters because they are stronger and more durable.\nThey are free from corrosion hence poles have a longer life but these are very bulky in sizes.", "": ""},
{"question": "Which of the following are the constants of the transmission lines?\n\n", "option1": "Inductance", "option2": "Capacitance", "option3": "Resistance and Conductance", "option4": "All of the above", "answar": "4", "category": "Transmission and Distribution", "explain": "The line constants are parameters that describe the characteristics of conductive transmission lines.\nThe primary line has the following constants\nR = Resistance per unit length Ω\nL = Inductance per unit length (Henry) H \nC = Capacitance per unit length (Henry) H\nG = Conductance per unit length ℧\nAll these constants are independent of frequency, therefore, they are called primary constants and these constants are measured by considering both the wires of the transmission lines.\nR and L elements are in series with the line (because they are properties of the conductor) and C and G are elements shunting the line (because they are properties of the dielectric material between the conductors).\nG represents leakage current through the dielectric and in most cables is very small.", "": ""},
{"question": " The phenomenon of rising in voltage at the receiving end of the open-circuited or lightly loaded line is called as", "option1": "Roman Effect", "option2": "Skin Effect", "option3": "Corona Effect", "option4": "Ferranti Effect", "answar": "4", "category": "Transmission and Distribution", "explain": "The phenomenon of the rise of voltage at the receiving end of an open-circuited or lightly loaded transmission line is called as the Ferranti effect.\nThe receiving end voltage becomes more than the sending end voltage.\nThe Ferranti effect occurs in medium and long transmission lines.\nThe Ferranti Effect will be more pronounced the longer the line and the higher the voltage applied. The relative voltage rise is proportional to the square of the line length.\nThe Ferranti effect is much more pronounced in underground cables, even in short lengths, because of their high capacitance.", "": ""},
{"question": "Low tension cables are meant for use up to", "option1": "1 kV", "option2": "5 kV", "option3": "10 kv", "option4": "33 kv", "answar": "1", "category": "Transmission and Distribution", "explain": "Low voltage cables with a range up to 1 kV are used for energy distribution from the last transformer station to the customer.", "": ""},
{"question": " The operating voltage of high tension cables is up to", "option1": "1 – 11 kV", "option2": "11 – 20 kV", "option3": "11 – 33 kV", "option4": "above 33 kV", "answar": "1", "category": "Transmission and Distribution", "explain": "High tension cables are used for a three-phase medium. These consist of three core belted type cables with separated insulation for each core.\nPaper insulation is provided for high-tension cables.\nThe operating voltage of high tension cable is up to 11kV. ", "": ""},
{"question": "The operating voltage of super tension cable is", "option1": "1 – 11 kV", "option2": "11 – 33 kV", "option3": "33 – 66  kV", "option4": "above 66 kV", "answar": "2", "category": "Transmission and Distribution", "explain": "Super tension cables are used upto the voltage level of 33 kV. They are further classified into 3 types\n\nH – type or screened cables\nSL type cables\nHSL types cables", "": ""},
{"question": "The operating voltage of Extra high tension cable is upto", "option1": "11 kv", "option2": "33 kV", "option3": "66  kV", "option4": "above 66 kV", "answar": "3", "category": "Transmission and Distribution", "explain": "Three core cables are generally used for voltages upto 33 Kv but beyond that weight and size of the three core cables is not economical and nor practical.\nExtra high tension cable can be of 2 types\nOil-filled cables\nGas pressure cables", "": ""},
{"question": "Which of the following methods is used for laying of underground cables?", "option1": "Direct laying", "option2": "Solid system", "option3": "Draw-in-system", "option4": "All of the Above", "answar": "4", "category": "Transmission and Distribution", "explain": "Generally, there are three methods of laying an underground cable\nDirect laying\nSolid system\nDraw-in-system", "": ""},
{"question": "Which of the following is the source of heat generation in the cables?", "option1": "Dielectric losses in cable insulation", "option2": "Conductor losses", "option3": "Sheath loses", "option4": "All of the Above", "answar": "4", "category": "Transmission and Distribution", "explain": "In a cable, if the rate of heat generation is more than the rate of heat dissipation than the temperature of cable increases.", "": ""},
{"question": "A booster is a", "option1": "Synchronous generator", "option2": "Shunt-wound generator", "option3": "Series wound generator", "option4": "None of the above", "answar": "3", "category": "Transmission and Distribution", "explain": "A booster is a series-wound generator that is inserted into the circuit to increase the DC voltage level so that the excessive voltage drop in the feeder can be compensated.", "": ""},
{"question": "Which of the following D.C. distribution system is the simplest and lowest in first cost?", "option1": "Radial system", "option2": "Inter-connected system", "option3": "Ring system", "option4": "Any of the above", "answar": "1", "category": "Transmission and Distribution", "explain": "A radial system is an electric transmission system that supplies power from the main generating station to the various sub-station.\nFrom the substation, the power line is connected to the distribution transformer where the voltage is step-down to the value required by the customers.", "": ""},
{"question": "The voltage of the single-phase supply to residential consumers is", "option1": "110 V", "option2": "230 V", "option3": "440 V", "option4": "Any of the above", "answar": "2", "category": "Transmission and Distribution", "explain": "In India, a single-phase supply is a 230V supply through two wires and In North America, a typical three-phase system will have 208 volts between the phases and 120 volts between phase and neutral. ", "": ""},
{"question": "The distributors for residential areas are", "option1": "Three-phase four-wire", "option2": "Three-phase three-wire", "option3": "Single-phase", "option4": "None of the above", "answar": "1", "category": "Transmission and Distribution", "explain": "A four-wire system allows you to have phase voltages or line-to-ground voltages. In a 3 phase 4 wire system, neutral wire carries return current in case any fault occurs in the line there is more flexibility to keep the system running since it may only affect one of the phases.", "": ""},
{"question": "The conductors of the overhead lines are", "option1": "Stranded conductors", "option2": "Solid conductors", "option3": "Both solid and stranded\n", "option4": "None of the above", "answar": "1", "category": "Transmission and Distribution", "explain": "Stranded Conductors are widely used over solid conductors. Although there seems to be more expensive than a solid conductor but offers many advantages too, over the solid conductor.\nThe stranded conductor offers much surface area for the flow of current that results in the reduced diameter of the conductor for the same current carrying capacity.\nAs the Stranded conductor offers much surface area so the overall resistance of the conductor is lesser than the same size solid conductor.\nEddy’s current losses are very much lesser than the solid conductor.\nStranded conductors are very suitable for an external environment and reduce the risk of loose connection.\nStranded Conductors offer much flexibility hence have a longer life than the solid conductor.", "": ""},
{"question": "High voltage transmission lines use", "option1": "Suspension insulators", "option2": "Pin insulators", "option3": "Any of the above", "option4": "None of the above", "answar": "1", "category": "Transmission and Distribution", "explain": "With an increase in the line voltage (above 33 kV) the pin insulator becomes heavy and complicated.\nSuspension type Insulator consists of a Number of porcelain discs connected in series with the metallic links to form a chain and the line conductor is carried by the bottom-most insulator.", "": ""},
{"question": "Multicore cables generally use", "option1": "Square conductors\n", "option2": "Rectangular conductors", "option3": "Sector-shaped conductors", "option4": "Circular conductors", "answar": "3", "category": "Transmission and Distribution", "explain": "A sector conductor is a stranded conductor whose cross-section is approximately the shape of a sector of a circle. A multiple conductor insulated cable with sector conductors has a smaller diameter than the corresponding cable with round conductors.", "": ""},
{"question": "The material commonly used for insulation in high voltage cables is", "option1": "Rubber\n", "option2": "Paper", "option3": "Lead", "option4": "Any of the above", "answar": "2", "category": "Transmission and Distribution", "explain": "Cables for power distribution of 10 kV or higher may be insulated with oil and paper, and are run in a rigid steel pipe, semi-rigid aluminum, or lead sheath.\nAn extruded lead sheath over the paper cable was required to ensure that the paper remained absolutely dry.", "": ""},
{"question": " Overhead lines generally use", "option1": "A.C.S.R. conductors", "option2": "Copper conductors", "option3": "Aluminum conductors", "option4": "Any of the above", "answar": "1", "category": "Transmission and Distribution", "explain": "Aluminum conductor steel-reinforced cable (ACSR) is a type of high-capacity, high-strength stranded conductor typically used in overhead power lines.\nThe outer strands are high-purity aluminum and the center strand is the steel for additional strength to help support the weight of the conductor.\nSteel has higher strength than aluminum which can allow increased mechanical tension to be applied on the conductor.", "": ""},
{"question": "The power factor of industrial loads is generally", "option1": "Unity", "option2": "Lagging", "option3": "Leading", "option4": "Any of the above", "answar": "2", "category": "Transmission and Distribution", "explain": "Generally industrial loads include inductive motor coil,\n\nIndustrial wiring systems are very inductive because they contain many inductive machines and circuits., such as electric motors, transformers, welding plants, and discharge lighting.\nThe inductive nature of the industrial load causes the current to lag behind the voltage and creates a lagging power factor.\nThe power factor is the percentage of current in an alternating current circuit that can be used as energy for the intended purpose. A power factor of say 0.7 indicates that 70% of the current supplied is usefully employed by the industrial equipment.\nAn inductive circuit, such as that produced by an electric motor, induces an electromagnetic force that opposes the applied voltage and causes the current wave to lag the voltage wave, therefore, they have a lagging power factor.", "": ""},
{"question": "The material generally used for the armour of high voltage cables is", "option1": "Copper", "option2": "Brass", "option3": "Aluminum", "option4": "Steel", "answar": "4", "category": "Transmission and Distribution", "explain": "Steel wire armored cable, commonly abbreviated as SWA, is a hard-wearing power cable designed for the supply of mains electricity.\nIt is one of a number of armored electrical cables – which include 11 kV Cable and 33 kV Cable – and is found in underground systems, power networks, and cable ducting.\nArmour Steel wire armor provides mechanical protection, which means the cable can withstand higher stresses, be buried directly, and used in external or underground projects.", "": ""},
{"question": " In transmission lines, the cross-arms are made of", "option1": "Steel", "option2": "Wood", "option3": "R.C.C\n", "option4": "Either Steel or Wood", "answar": "4", "category": "Transmission and Distribution", "explain": "Cross arms are either made up of wood or steel angle sections.\nCross arms are installed at the top of the pole for holding the insulator on which the conductors are fastened.\nIf the cross arms are fixed in the center of the pole then it is simply called cross arms.\nIf the cross arms are fixed on the side of the pole then it is termed as side cross arms.\nFor the three-phase line, U-shaped Cross arms are used.", "": ""},
{"question": "Transmission line insulators are made of", "option1": "Porcelain", "option2": "Glass", "option3": "Composite Polymer", "option4": "Any of the above", "answar": "4", "category": "Transmission and Distribution", "explain": "Insulators used for high-voltage power transmission are made from glass, porcelain or composite polymer materials.\nPorcelain insulators are made from clay, quartz, or alumina and feldspar, and are covered with a smooth glaze to shed water.\nPorcelain has a dielectric strength of about 4–10 kV/mm.\nGlass has higher dielectric strength, but it attracts condensation and the thick irregular shapes needed for insulators are difficult to cast without internal strains.", "": ""},
{"question": "The material commonly used for sheaths of underground cables is", "option1": "Lead", "option2": "Rubber", "option3": "Copper", "option4": "Iron", "answar": "1", "category": "Transmission and Distribution", "explain": "The insulator conductors are covered with the lead sheath. This provides additional mechanical strength and also protects the cable from moisture.\nNote: The most common material used as the sheath in today’s cables is Poly-Vinyl-Chloride or PVC. In earlier days, the lead was used as the sheath.", "": ""},
{"question": "The spacing between phase conductors of a 220 kV line is approximately equal to", "option1": "2 m", "option2": "3 m", "option3": "6 m", "option4": "10 m", "answar": "3", "explain": "According to the Electrical safety rule, the spacing between the phase conductor of 220 kV is  6m.", "category": "Transmission and Distribution", "": ""},
{"question": "The minimum clearance between the ground and a 220 kV line is about", "option1": "1 m", "option2": "7 m", "option3": "10 m", "option4": "5 m", "answar": "2", "explain": "According to the Electrical safety rule, the minimum clearance between the ground and a 220 kV line is about 7m.", "category": "Transmission and Distribution", "": ""},
{"question": " In a D.C. 3-wire distribution system, balancer fields are cross-connected in order to", "option1": "Boost the generated voltage", "option2": "Equalize voltages on the positive and negative outers", "option3": "Balance loads on both sides of the neutral", "option4": "Make both machines run as unloaded motors", "answar": "2", "explain": "The purpose of the Balancer is to redress the voltage on the positive and negative outer.\nLet us suppose P and Q are the armatures of 2 DC machines that are connected in series across the outers and the field being cross-connected.\nOut of balance load makes the DC machine works automatically as a motor or generator in order to compensate for voltage drop or rise.\nThe balancer connected to lightly load side always work as the motor while that connected to a heavily loaded side act as the generator.\nThe energy is always transferred from the lightly loaded side to the heavily loaded side.", "category": "Transmission and Distribution", "": ""},
{"question": "In a D.C. 3-wire distributor using balancers and having unequal loads on the two sides", "option1": "Balancer connected to lightly- loaded side runs as a motor", "option2": "Balancer connected to heavily- loaded side runs as a motor", "option3": "Both balancers run as motors", "option4": "Both balancers run as generators", "answar": "1", "explain": "The purpose of the Balancer is to redress the voltage on the positive and negative outer.\nLet us suppose P and Q are the armatures of 2 DC machines that are connected in series across the outers and the field being cross-connected.\nOut of balance load makes the DC machine works automatically as a motor or generator in order to compensate for voltage drop or rise.\nThe balancer connected to lightly load side always work as the motor while that connected to a heavily loaded side act as the generator.\nThe energy is always transferred from the lightly loaded side to the heavily loaded side.", "category": "Transmission and Distribution", "": ""},
{"question": "A uniformly-loaded D.C. distributor is fed at both ends with equal voltages. As compared to a similar distributor fed at one end only, the drop at the middle point is", "option1": "One-half", "option2": "One-third", "option3": "One-fourth", "option4": "Twice", "answar": "3", "explain": "no explanation for this question", "category": "Transmission and Distribution", "": ""},
{"question": "As compared to a 2-wire D.C. distributor, a 3-wire distributor with same maximum voltage to earth uses only", "option1": "31.25 percent of copper", "option2": "66.7 percent of copper", "option3": "33.3 percent of copper", "option4": "125 percent of copper", "answar": "3", "explain": "no explanation for this question", "category": "Transmission and Distribution", "": ""},
{"question": "For an overhead line, the surge impedance is taken as", "option1": "20-30 ohms", "option2": "400 – 600 ohms", "option3": "70—80 ohms", "option4": "100—200 ohms", "answar": "2", "explain": "In power system, the characteristic impedance is sometimes referred to as surge impedance.\nIt is defined  as the √Z/Y where\nZ  = series impedance of line\nY = shunt admittance of the line\nFor a lossless line, the surge impedance reduces to √(L/C) a pure resistance.\nIts value is normally 400 to 600 ohms for an overhead line while for underground cable its value is typically between 40 to 60 ohms.", "category": "Transmission and Distribution", "": ""},
{"question": "The presence of ozone due to corona is harmful because it\n\n", "option1": "Corrodes the material", "option2": "Transfer energy to the ground\n", "option3": "Gives odor", "option4": "Any of the above", "answar": "1", "explain": "Corona discharge is the ionization of air molecules due to high electrical potentials. The ionization process creates a plasma which we call corona discharge.\nThe high-energy ions that create this effect can rapidly deteriorate power systems equipment.\nCorona discharge typically occurs at (non-smooth) surfaces because at these points the electric field is the highest.", "category": "Transmission and Distribution", "": ""},
{"question": " The power transmitted will be maximum when", "option1": "Corona losses are minimum", "option2": "Receiving end voltage is high", "option3": "Reactance is high", "option4": "Sending end voltage is high", "answar": "4", "explain": "In case if the sending end voltage is not more than the receiving end voltage then the current start flowing in reverse direction i.e from receiving end to sending end this phenomenon is called as the Ferranti effect.\nThis occurs when the line is energized, but there is a very light load or the load is disconnected. ", "category": "Transmission and Distribution", "": ""},
{"question": "A 3-phase 4 wire system is commonly used on", "option1": "Primary transmission", "option2": "Secondary transmission", "option3": "Primary distribution", "option4": "Secondary distribution", "answar": "4", "explain": "At the local distribution centers, there are step-down distribution transformers.\nThe voltage level of 6.6 kV and 11 kV are further step-down to 400 V for an industrial region and 240 V for a domestic or household region.\nThis uses 3 phase 4 wire system and the voltage between any two lines is 400 Volt and the voltage between any of the three-line and neutral is 230 V.", "category": "Transmission and Distribution", "": ""},
{"question": " Corona discharge occurs more in", "option1": "Humid Weather", "option2": "Hot weather\n", "option3": "Cold Weather", "option4": "Any of the above", "answar": "1", "explain": "In humid conditions, there is more water droplets in the atmosphere this water droplet increases the electric field on the surface of the conductor hence corona is generated.\nThe high humidity decreases the breakdown strength of the air surrounding the conductor which further decreases the intensity of the discharge.\nThis electric field accelerates the free electron charge in the air surrounding the conductor.\nThis causes an avalanche which is called the corona discharge.", "category": "Transmission and Distribution", "": ""},
{"question": "Which of the following relays are used on long transmission lines?", "option1": "Impedance Relay", "option2": "Mho’s Relay", "option3": "Differential Relay", "option4": "Reactance Relay", "answar": "2", "explain": "Mho relay comes in the category of the distance relay protection scheme.\nThe mho type relay is most suited for long lines because there are more chances of severe synchronizing power surges on the system.\nIt does not need any additional equipment to prevent tripping during these surges.\nThe mho relay occupies the least space on an R-X diagram for a given line section and is, therefore, least affected by abnormal system conditions except for the line faults.\nSince the mho relay is most affected by arc resistance, it is used for long lines.", "category": "Transmission and Distribution", "": ""},
{"question": " Which of the following relay is used for short transmission line?", "option1": "Impedance Relay", "option2": "Mho’s Relay", "option3": "Differential Relay", "option4": "Reactance Relay", "answar": "4", "explain": "In short transmission lines, the most common fault is the line to ground fault hence reactance type relay is used because more of the line can be protected at high speed.\nThe line-to-ground fault also causes arcing ground and the reactance relay is practically independent of the arc resistance which may be large as compared with the line impedance.", "category": "Transmission and Distribution", "": ""},
{"question": "Which of the following relay is used for the protection of a medium transmission line?", "option1": "Impedance Relay", "option2": "Mho’s Relay", "option3": "Differential Relay", "option4": "Reactance Relay", "answar": "1", "explain": "The impedance relay is less affected by synchronizing power surges as compared to the reactance relay and also this relay is less affected by arc resistance as compared with the mho relay.\nThis relay only operates when the voltage/current ratio becomes less than the given value.\nThe impedance relay is, therefore, used for protecting medium-length transmission lines.", "category": "Transmission and Distribution", "": ""},
{"question": " The steel used in steel cored conductors is usually", "option1": "Alloy steel", "option2": "Stainless steel", "option3": "Mild steel", "option4": "High-speed steel", "answar": "3", "explain": "The conductor used for overhead transmission systems generally used galvanized mild steel core (to provide tensile strength).\nThe price of mild steel is relatively low hence for laying the network of transmission lines around the city or state it is very cost-effective.", "category": "Transmission and Distribution", "": ""},
{"question": "Which of the following characteristics should the line supports for transmission lines possess?", "option1": "High mechanical strength", "option2": "Longer life", "option3": "Low cost", "option4": "All of the above", "answar": "4", "explain": "Whether the transmission line is short, medium, or long it should have high mechanical strength, long life, and low cost.", "category": "Transmission and Distribution", "": ""},
{"question": "Which of the following voltage regulations is considered best?", "option1": "10 %", "option2": "20 %", "option3": "100 %", "option4": "4 %", "answar": "4", "explain": "In electrical engineering, particularly power engineering, voltage regulation is a measure of the change in the voltage magnitude between the sending and receiving end of a component, such as a transmission or distribution line.\nVoltage regulation describes the ability of a system to provide near-constant voltage over a wide range of load conditions.\n A 4% voltage regulation will mean that when loaded, the voltage will fluctuate 4% according to its rated voltage.\nMeans if you have a source with 240V on no-load it might drop to 236V when supplying to a load.\nThe lesser the number the better the voltage regulation since it stays close to where you want it to be.", "category": "Transmission and Distribution", "": ""},
{"question": "A conductor, due to sag between two supports, takes the form of", "option1": "Catenary", "option2": "Semi-circle", "option3": "Triangle", "option4": "Ellipse", "answar": "1", "explain": "A catenary is a curve that an idealized hanging chain or cable assumes under its own weight when supported only at its ends.\nThe catenary curve has a U-like shape, superficially similar in appearance to a parabola, but it is not a parabola.", "category": "Transmission and Distribution", "": ""},
{"question": " By which of the following methods string efficiency can be improved?", "option1": "Using long cross arm", "option2": "Grading the insulator", "option3": "Using a guard ring", "option4": "Any of the above", "answar": "4", "explain": "The ratio of voltage across the whole string to the product of the number of discs and the voltage across the disc nearest to the conductor is known as string efficiency.", "category": "Transmission and Distribution", "": ""},
{"question": "The skin effect cause", "option1": "Portion of the conductor near the surface carries less current and core of the conductor carries more current", "option2": "Portion of the conductor near the surface carries more current and the core of the conductor carries less current", "option3": "Current flows through the half cross-section of the conductor", "option4": "None of the above", "answar": "2", "explain": "In string effect due to eddy current, the portion of the conductor near the surface carries more current and the core of the conductor carries less current", "category": "Transmission and Distribution", "": ""},
{"question": "A circuit is disconnected by isolators when", "option1": "Line is on full load", "option2": "Circuit breaker is not open", "option3": "There is no current in the line", "option4": "Line is energized", "answar": "3", "explain": "In electrical engineering, a disconnector, disconnect switch, or isolator switch is used to ensure that an electrical circuit is completely de-energized for service or maintenance.", "category": "Transmission and Distribution", "": ""},
{"question": "Current rating is not necessary in case of", "option1": "Circuit breaker", "option2": "Isolator", "option3": "Load break switch", "option4": "None of the above", "answar": "2", "explain": "Isolator operates under no-load condition. They are not equipped with any arch-quenching device and don’t have any specified current breaking capacity or current making capacity.\nIsolators are employed only for isolating the circuit when the current has already been interrupted. They ensure that the current is not switched into the circuit until the fault has been fixed.", "category": "Transmission and Distribution", "": ""},
{"question": "The voltage drop, for constant voltage transmission, is compensated by installing", "option1": "Capacitors", "option2": "Synchronous motors", "option3": "Inductors", "option4": "all of the above", "answar": "2", "explain": "Synchronous motor sometimes runs on no-load with over-excitation for improving the voltage regulation of a transmission line. Such an over-excited synchronous motor is called the synchronous condenser or synchronous capacitor.", "category": "Transmission and Distribution", "": ""},
{"question": "The use of strain type insulators is made where the conductors are", "option1": "Dead End", "option2": "Road Crossing", "option3": "Intermediate anchor towers", "option4": "all of the above", "answar": "4", "explain": "Strain type insulators are used for handling the mechanical stress at the angle position of the line i.e Dead end, intermediate anchor tower, corner, sharp curve.", "category": "Transmission and Distribution", "": ""},
{"question": "The current drawn by the line due to corona losses is", "option1": "Non-sinusoidal", "option2": "Triangular", "option3": "Square", "option4": "Sinusoidal", "answar": "1", "explain": "The current drawn by the line due to corona is non-sinusoidal therefore non-sinusoidal voltage occurs in the line.\nThis non-sinusoidal current and voltage cause inductive interference with the neighboring communication line.", "category": "Transmission and Distribution", "": ""},
{"question": "Pin type insulators are generally not used for voltages beyond", "option1": "22 kv", "option2": "33 kV", "option3": "11 kV", "option4": "1 kv", "answar": "2", "explain": "Pin type insulators are used for the transmission and distribution of electric power at voltages up to 33 kV.\nBeyond operating voltage of 33 kV, the pin type insulators become too bulky and hence uneconomical. ", "category": "Transmission and Distribution", "": ""},
{"question": "For transmission of power over a distance of 200 km, the transmission voltage should be", "option1": "66 kv", "option2": "132 kv", "option3": "11 kV", "option4": "33 kv", "answar": "2", "explain": "In this case, the line length is more than 160 Km, therefore, it is a long transmission line and the line voltage requires is greater than 100 kV.", "category": "Transmission and Distribution", "": ""},
{"question": "Which of the following equipment, for regulating the voltage in the distribution feeder, will be most economical?", "option1": "Static condenser", "option2": "Tap changing transformer", "option3": "Synchronous condenser", "option4": "Shunt capacitor", "answar": "4", "explain": "The synchronous condenser is most suitable for power factor correction but it is expensive therefore it is used for the high-voltage transmission line.\nThe most economical way of regulating the voltage within the permissible limit is to use shunt capacitor.\nShunt capacitors are installed on the feeder and substation bus to achieve the economical power factor.\n", "category": "Transmission and Distribution", "": ""},
{"question": "In a tap changing transformer, the tappings are provided on", "option1": "Primary winding", "option2": "Secondary winding", "option3": "High voltage winding", "option4": "Any of the above", "answar": "3", "explain": "Tapings are connected to the high voltage winding side, because of low current. If we connect tapings to the low voltage side, sparks will produce due to high current.\nThe number of turns in the High voltage winging is large and hence a fine voltage variation can be obtained.\nLV winding is placed nearer to the core and HV winding is placed outside. Therefore providing taps on the HV winding is comparatively easier than that of the LV winding.", "category": "Transmission and Distribution", "": ""},
{"question": "Constant voltage transmission entails the following disadvantage", "option1": "Short-circuit current of the system is increased", "option2": "Large conductor area is required for same power transmission\n", "option3": "Load power factor in heavy loads", "option4": "All of the above", "answar": "1", "explain": "In constant voltage transmission, a constant voltage drop is maintained along the line with the help of the phase modifiers (synchronous motor running without mechanical load) at the receiving end.\nWith the change in load, the power factor of the system is changed by the synchronous motors and thus voltage drop along the line remains constant.\nThe main disadvantage of constant power transmission is\n\nIncreased the risk of interruption of supply due to falling of synchronous motors\nShort-circuit current in the system is increased.", "category": "Transmission and Distribution", "": ""},
{"question": "Skin effect depends upon?", "option1": "Frequency of the current", "option2": "Resistivity of the conductor material", "option3": "Size and type of the conductor", "option4": "All of the above", "answar": "1", "explain": "Frequency: Skin effect increases with the increase in frequency.\nDiameter: It increases with the increase in diameter of the conductor.\nThe shape of the conductor: Skin effect is more in the solid conductor and less in the stranded conductor because the surface area of the solid conductor is more.\nType of material: Skin effect increase with the increase in the permeability of the material\nThe resistivity of the conductor: When resistivity increases its conductivity decrease, therefore, the skin effect also increases. ", "category": "Transmission and Distribution", "": ""},
{"question": " When an alternator connected to the bus-bar is shut down the bus-bar voltage will", "option1": "Remain unchanged", "option2": "Increased", "option3": "Decreased", "option4": "None of the above", "answar": "1", "explain": "Many alternators are connected to an infinite busbar and they are synchronized at the same frequency, so removing one of them doesn’t change the frequency.\nIt can be said that the power capabilities of the infinite bus bar are very much large as compared to an individual alternator connected to it thus when any alternator is removed no significant impact is made on the bus bar voltage or frequency and hence they don’t change.", "category": "Transmission and Distribution", "": ""},
{"question": "The angular displacement between two interconnected stations is mainly due to", "option1": "The synchronous reactance of both the alternators", "option2": "The reactance of the interconnector", "option3": "Armature reactance of both alternators", "option4": "all of the above", "answar": "3", "explain": "In an interconnected station to transfer large load between the stations, it is required that the load on the line must be shared equally.\nConsider the 2 generating stations S-1 and S-2 supplying a Receiving station RS through line 1 and line 2.\nTo deliver equal power through line 1 and line 2 the phase and active component of line current I1 and I2 must be equal.\nTo compensate for Impedance drop the regulating components (RE) are installed at the sending end of each transmission line.\nThe parallel operation and load sharing between two alternators are possible because of alternator internal reactance which limits the short circuit current and allows angular displacement between two stations.", "category": "Transmission and Distribution", "": ""},
{"question": " Electro-mechanical voltage regulators are generally used in", "option1": "Transformer", "option2": "Generator", "option3": "Reactor", "option4": "all of the above", "answar": "2", "explain": "The voltage of an AC generator is controlled by the electromechanical voltage regulator.\nThe magnetic field produced by the current attracts a moving ferrous core held back under spring tension.\nThe magnetic field produced by the current attracts a moving ferrous core held back under spring tension.\nAs voltage increases, so does the current, strengthening the magnetic field produced by the coil and pulling the core towards the field.\nWhen voltage decreases, so do the current, releasing spring tension or the weight of the core and causing it to retract. This closes the switch and allows the power to flow once more.\nThe magnet is physically connected to a mechanical power switch, which opens as the magnet moves into the field.", "category": "Transmission and Distribution", "": ""},
{"question": "Series capacitors on transmission lines are of little use when the load VAR requirement is", "option1": "Large", "option2": "Small", "option3": "Fluctuating", "option4": "any of the above", "answar": "2", "explain": "Series capacitor is the method of improving the system voltage and impedance by injecting the reactive power in the transmission line.\nIf the voltage drop is the limiting factor then the series capacitor is very effective. Voltage fluctuations due to the arc furnace can also be compensated by series capacitors.\nSeries capacitor is also very effective when the total line reactance is high.\nIt is mostly used in extra and ultra high voltage line but if the load vAR requirement is small series capacitor are of little use.\nThe shunt capacitor is used for lightly loaded cables or lines.", "category": "Transmission and Distribution", "": ""},
{"question": "The voltage regulation in the magnetic amplifier type voltage regulator is effected by", "option1": "Electromagnetic induction", "option2": "Varying the resistance", "option3": "Variable transformer", "option4": "Varying the reactance", "answar": "4", "explain": "Magnetic amplifier voltage regulators work on the principle of the saturable magnetic core.\nTwo dc windings are arranged on the core of the opposite magnetic field which is fed through the rectifier.\nThe combination of the ampere-turns of the D.C signal coil and the series rectifying coil will produce the varying degree of reactance in the series circuit.\nAny small change in the voltage will change the resultant ampere-turns on the control winding which is used to control the field current of the exciter of the alternator.", "category": "Transmission and Distribution", "": ""},
{"question": "When a conductor carries more current on the surface as compared to core, it is due to", "option1": "Corona", "option2": "Skin Depth", "option3": "Skin Effect", "option4": "Any of the above", "answar": "3", "explain": "In skin effect the eddy current causes the electron to be repelled towards the outermost surface of the conductor.\nRepelling the electron towards the outer surface of the conductor increase the conductor resistance", "category": "Transmission and Distribution", "": ""},
{"question": "When a live conductor of public electric supply breaks down and touches the earth which of the following will happen?", "option1": "Current will flow to earth", "option2": "No current will flow in the conductor", "option3": "Either 1 or 2", "option4": "Supply voltage will increase", "answar": "3", "explain": "The electrical current travels by means of ions dissolved in the moisture in the ground. In dry soil, this may not work as but in wet ground, current can flow easily because water is a good conductor of electricity.\nThe key point is that the current flows from one point of the circuit, through the ground, then back into the circuit. With only one connection to the ground, there is no circuit for the current to flow through.\nIf there is a second connection to ground elsewhere in the circuit (usually at the sub-station) which forms the circuit.", "category": "Transmission and Distribution", "": ""},
{"question": "If the length of the cable is doubled, its capacitance C will become", "option1": "Doubled", "option2": "Half", "option3": "One-fourth", "option4": "Remain Unchanged", "answar": "1", "explain": "Capacitance exists between two things with different electric charge and a dielectric in between.\nThe transmission line and the earth below it, have a charge difference and the air between them is dielectric. This constitutes a capacitance.\nThe longer the cable, the more part of it runs parallel to the earth and hence, more capacitance between them since the length of the cable and the capacitance of the cable are directly proportional to each other.", "category": "Transmission and Distribution", "": ""},
{"question": "The advantages of high transmission voltage are", "option1": "Area of cross-section is reduced", "option2": "Reduced line losses", "option3": "Increase efficiency", "option4": "All of the above", "answar": "4", "explain": "The line losses are inversely proportional to the square of the voltage and the power factor (Pl∝ 1/V²P). Therefore line losses are reduced.\nFor constant current density, the line efficiency is high for the high voltage transmission line.\nThe volume of copper required is inversely proportional to the square of the voltage and the power factor. Hence the requirement of copper is less for the high voltage transmission line.\nA ∝ 1/V²\nAs the line losses are decreased the efficiency of the transmission line is increased.", "category": "Transmission and Distribution", "": ""},
{"question": "The voltage regulation of flat voltage profile system is", "option1": "100 %", "option2": "50 %", "option3": "0 %", "option4": "any of the above", "answar": "3", "explain": "The % voltage regulation is given as (Vs-Vr)/Vr*100  where\nVs = Supply voltage\nVr = Receiving end Voltage\n\nFor flat voltage profile system all the voltage drop in the line are neglected therefore supply voltage (Vs) is equal to the Receiving end voltage (Vr) i.e Vs = Vr\nHence the voltage regulation for flat voltage profile system is zero.", "category": "Transmission and Distribution", "": ""},
{"question": "The maximum power can be achieved in a transmission line by", "option1": "Reducing system transfer Reactance", "option2": "Increasing the Voltage level", "option3": "Both 1 and 2", "option4": "none of the above", "answar": "3", "explain": "To reduce the power loss in the transmission line the source voltage is stepped up by using the transformer.\nBy increasing the voltage level the same amount of power can transfer with much smaller current thus reducing transmission line losses (I2R losses).\nThe system transfer reactance of a transmission line can be reduced by the series capacitance, bundled conductor, or by using parallel transmission line.", "category": "Transmission and Distribution", "": ""},
{"question": "Ferranti effect can be reduced by which of the following method?", "option1": "Shunt Reactor", "option2": "Series Reactor", "option3": "Shunt Capacitor", "option4": "Series Capacitor", "answar": "1", "explain": "A long transmission line can be considered to be composed of a high amount of capacitance and inductor distributed across the entire length of the line. Ferranti Effect occurs when the current drawn by the distributed capacitance of the line is greater than the current associated with the load at the receiving end of the line which occurs during light or no load.\nShunt Reactor compensation at the receiving end help to reduce the effect of capacitance thus reducing the Ferranti effect.\nShunt Reactor absorbs the excess reactive power during no load or light load conditions and thus helps in stabilizing the voltage of the Transmission Line.", "category": "Transmission and Distribution", "": ""},
{"question": "Under excited Synchronous phase modifier works as", "option1": "Shunt Reactor", "option2": "Shunt Reactor", "option3": "Series Capacitor", "option4": "Series Reactor", "answar": "2", "explain": "The synchronous phase modifier is a synchronous motor which is not connected to any load.\nWhen a synchronous motor is under-excited its works as an inductor or shunt Reactor.\nThe shunt reactors are used across capacitive loads or lightly loaded lines to absorb leading vars to control the voltage across the load to within certain desirable limits.", "category": "Transmission and Distribution", "": ""},
{"question": "Over-excited Synchronous phase modifier work as", "option1": "Shunt capacitor", "option2": "Shunt Reactor", "option3": "Series Capacitor", "option4": "Series Reactor", "answar": "2", "explain": "The synchronous phase modifier is a synchronous motor which is not connected to any load.\nWhen a synchronous motor is over-excited its works as a shunt capacitor.\nThe shunt capacitors are used across an inductive load to provide leading volt-ampere-reactive vAR to reduce the line current and total kVA loading of the substation.", "category": "Transmission and Distribution", "": ""},
{"question": "The specified quantities of load bus are\n\n", "option1": "Q and V", "option2": "V and δ", "option3": "P and Q", "option4": "Q and V", "answar": "4", "explain": "All the bus in the power system is generally categorized into three categories\n\nGeneration Bus\nLoad Bus\nSlack Bus\nThe two of the four quantities are mentioned above are specified for each of the buses.\nLoad bus: This is also called as PQ bus and here the real power |P| and reactive power |Q| are specified.", "category": "Transmission and Distribution", "": ""},
{"question": "The specified quantities of Generation bus is", "option1": "Q and V", "option2": "V and δ", "option3": "P and Q", "option4": "Q and V", "answar": "3", "explain": "Generation Bus is also called as the voltage-controlled bus.\nThe specified quantities of Generation bus is P and V and here the real power |P| and voltage magnitude |V| are specified.", "category": "Transmission and Distribution", "": ""},
{"question": "The specified quantities of Slack bus is", "option1": "Q and V", "option2": "V and δ", "option3": "P and Q", "option4": "Q and V", "answar": "2", "explain": "The slack bus is also known as the swing bus or reference bus.\nThe voltage magnitude |V| and phase angle |δ| are specified here.\nThis bus is selected to provide additional real and reactive power to supply the transmission losses.", "category": "Transmission and Distribution", "": ""},
{"question": "The range of accelerating factor is", "option1": "10 to 20", "option2": "20 -30", "option3": "15.5 -20.2", "option4": "1.6 -1.8", "answar": "4", "explain": "For Gauss-seidel load flow method, an acceleration factor normally used to lead fast convergence as it reduces the number of iterations.\nAfter doing repeated load flow it has been observed that normally it work well for the acceleration factor of 1.6 to 1.8.", "category": "Transmission and Distribution", "": ""},
{"question": "The advantage of the Newton Raphson method is", "option1": "Less number of iteration", "option2": "Less computation Time", "option3": "Applicable for large power system network\n", "option4": "All of the above", "answar": "4", "explain": "Newton Raphson’s method is perhaps the best-known method for finding successively better approximations to the zeroes (or roots) of a real-valued function.\n\nThe advantages of the Newton-Raphson method are\n\nNewton Raphson method needs less number of iterations to reach convergence, hence take less computation time.\nThe accuracy of the N-R method is more and convergence is not affected by the choice of slack bus.\nThe accelerating factor is not required in the Newton Raphson method.\nThe N-R method is best suited for a large power network.", "category": "Transmission and Distribution", "": ""},
{"question": "The advantages of the Gauss-Seidel method is", "option1": "The less computational time required", "option2": "Simplicity in technique", "option3": "Less computer memory required", "option4": "All of the above", "answar": "4", "explain": "The advantages of the Gauss-Seidel method are:-\n\n A simple algebraic equation is used hence it requires less number of arithmetic operation to complete iteration and therefore the time required for each iteration is less\nThe need for computer memory is less.\nThis method is most suitable for small size networks.", "category": "Transmission and Distribution", "": ""},
{"question": "The disadvantages of the Gauss-seidel method are", "option1": "A large number of iteration required", "option2": "Slow convergence rate", "option3": "Inefficient for large system network", "option4": "All of the above", "answar": "4", "explain": "The disadvantages of the Gauss-Seidel method are:-\n\nThis method is not applicable to large power system.\nThe convergence is affected by the choice of slack bus.\nIt requires more number of iteration to obtain the solution.\nThe rate of convergence is slow.\nIt required an accelerating factor for convergence.\nIncrease in the number of iteration with an increase in the number of buses.", "category": "Transmission and Distribution", "": ""},
{"question": "Z bus matrix is a", "option1": "Full matrix", "option2": "Null Matrix", "option3": "Unit matrix", "option4": "None of the above", "answar": "1", "explain": "Z Matrix or bus impedance matrix is an important tool in power system analysis.\nIt is an important tool in power system studies like short circuit analysis or fault study.\nZ Matrix can be formed by either inverting the Ybus matrix or by using Z bus building algorithm.\nZ matrix is a full matrix i.e zero elements in Ybus become non-zero elements in the corresponding Zbus.", "category": "Transmission and Distribution", "": ""},
{"question": "Which of the following matrix is used for load flow studies?", "option1": "Unit matrix", "option2": "Null Matrix", "option3": "Y bus matrix", "option4": "Z bus matrix", "answar": "3", "explain": "Y bus is a bus admittance matrix that is used (generally) in Load flow analysis.\nThis matrix helps in finding values of P, Q, |V| & δ.\nWith any type of changes in the network, the elements can be changed without actually changing the whole matrix in Y bus matrix.\nWe know that I= V/Z and Z= 1/Y.\nHence I=Y*V.\nAll these are matrices and hence the division by matrices is very hard we use multiplication using Y instead of dividing with Z.\nY is additive is parallel and we know that in power systems mostly loads are connected in parallel, that’s why power system calculation is done in admittance matrix form Y rather than Z because it helps to simplify calculations.", "category": "Transmission and Distribution", "": ""},
{"question": "For n number of buses the power system size of Y, bus matrix is", "option1": "(n-1)^2", "option2": "(n-2)^2", "option3": "n*n", "option4": "nono of the above", "answar": "3", "explain": "In power engineering, the nodal admittance matrix (or just admittance matrix) or Y Matrix or Ybus is the square matrix of an order of N x N matrix describing a power system with N buses.\nY matrix is symmetrical and there are many zeros in it. Hence it requires less memory as load flow analysis is done in computers.", "category": "Transmission and Distribution", "": ""},
{"question": " Find the number of strands of ACSR conductor for 3 layer transmission line?", "option1": "10", "option2": "19", "option3": "29", "option4": "27", "answar": "2", "explain": "The total number of strands in ACSR conductor is given as\nN = 3x² – 3x + 1  where\nx = number of layer\n\nSo the total number of strands\nN = 3×3² – 3×3 + 1 = 19\n\n", "category": "Transmission and Distribution", "": ""},
{"question": " Find the total diameter of the ACSR conductor with 2 layers and the diameter of each strand is 3?", "option1": "9", "option2": "10", "option3": "5", "option4": "15", "answar": "1", "explain": "The diameter of the ACSR  conductor can be calculated by\nD = (2x – 1)xd where\nx = number of layer\nd = diameter of each strand\n\nTherefore, Total diameter of ACSR conductor\nD = (2×2 -1)3\nD = 9", "category": "Transmission and Distribution", "": ""},
{"question": "Telecommunication lines are transposed to reduce the", "option1": "Voltage level", "option2": "Short circuit current", "option3": "Radio interference in communication line", "option4": "All of the above", "answar": "3", "explain": "Usually, telecommunication lines and power lines travel close to each other, then the current flowing through power line produces magnetic flux linkage between telecommunication lines so that voltage is induced in the telecommunication line which causes the disturbance in communication.\nTo reduce this effect t the conductors are transposed. Transposition can be made either to the power conductors or telephone (communication ) lines at regular intervals.\nWhen conductors are not transposed at regular intervals, the inductance and capacitance of the conductors will not be equal.\nWhen conductors such as power lines are run in parallel to transmission lines, there is a possibility of high voltages induced in the lines.  This can result in acoustic shock or noise.", "category": "Transmission and Distribution", "": ""},
{"question": "Which of the following produces the radio interference in communication lines?", "option1": "Electromagnetic induction", "option2": "Electrostatic induction", "option3": "Both 1 & 2", "option4": "None of the above", "answar": "3", "explain": "High voltage transmission lines and substations can cause radio interference.\nSince radio noise is associated with corona, it mainly depends on the potential gradients at the conductors.\nRadio interference due to corona is of the importance for lines above 200 kV.\nIn electromagnetic effect, the current flowing in the power line produces magnetic flux linkage with the communication line conductor which induces an emf in the telecommunication line conductor.\nAn electrostatic affect the electric field is produced by the charges of the earth induces a voltage in between the conductors of the telecommunication lines.", "category": "Transmission and Distribution", "": ""},
{"question": "Bundled conductors in EHV transmission lines help in", "option1": "Decrease capacitance", "option2": "Decrease Inductance", "option3": "Increase capacitance", "option4": "Increase inductance", "answar": "2", "explain": "Total inductance is given as L = 2*10-7 * ln(d/r’)\nA bundle conductor is a conductor made up of two or more sub-conductors and If we use bundled conductors, the effective radius will increase hence increase in radius will decrease the inductance.\nBundled conductor Primarily used to reduce the potential gradient on the surface of the conductors so that occurrence of Corona can be reduced.\nIt helps in obtaining better voltage regulation and efficiency by reducing the inductance and skin effect present in the power lines.", "category": "Transmission and Distribution", "": ""},
{"question": " If the frequency is increased, then the skin effect will", "option1": "Decrease ", "option2": "Remain the same", "option3": "Increase ", "option4": "None of the above", "answar": "3", "explain": "The skin effect is inversely proportional to the skin depth.\nThe skin depth is given as\nskin depth = 1/√(πfµσ) where\nf = frequency\nµ = permeability\nσ = conductivity\n\nSo by increasing the frequency, the skin depth decreases, and skin effect increases.", "category": "Transmission and Distribution", "": ""},
{"question": "Proximity effect is more in case of", "option1": "Overhead line ", "option2": "Power cable", "option3": "DC transmission ", "option4": "None of the above", "answar": "2", "explain": "The alternating magnetic flux produced in the conductor due to the current flowing through the neighboring conductor gives rise to the circulating current which increases the resistance of the conductor. This phenomenon is called the proximity effect.\nThe proximity is more in the case of power cable and underground line where the distance between the conductor is small.\nThis effect is negligible in the case of overhead transmission lines because the distance between the conductors is large.\nThe proximity effect is absent in the case of DC transmission because the frequency of DC transmission is zero.\nThe proximity effect depends upon the size of the conductor, spacing between the conductor, frequency and permeability of the conductor material.", "category": "Transmission and Distribution", "": ""},
{"question": "The distribution constant of the transmission line is", "option1": "Resistance", "option2": "Inductance", "option3": "Capacitance", "option4": "Resistance, Inductance, Capacitance, Conductance", "answar": "4", "explain": "Transmission lines are the circuit with the distributed constant such as Resistance, Inductance, Capacitance, Conductance which is distributed along the length of the transmission line.\nThese constant are not concentrate at any point. There value expressed as per kilometer length of the line.", "category": "Transmission and Distribution", "": ""},
{"question": "In which of the following transmission lines capacitance effect is negligible?", "option1": "Long transmission lines", "option2": "Short transmission line", "option3": "Medium transmission line\n", "option4": "Any of the above", "answar": "2", "explain": "Generally, the length of the short transmission line is less than 80 km, therefore, charging current and leakage current is very less.\nHence the capacitance and conductance effects are negligible for short transmission lines only.", "category": "Transmission and Distribution", "": ""},
{"question": " The fact that current density is higher at the surface when compared to the centre is known as", "option1": "Skin effect", "option2": "Proximity effect", "option3": "Corona effect", "option4": "None of the above", "answar": "1", "explain": "In skin effect the eddy current causes the electron to be repelled towards the outermost surface of the conductor.\nRepelling the electron towards the outer surface of the conductor increase the conductor resistance.\nDue to skin effect, the area of the current flowing path is reduced.", "category": "Transmission and Distribution", "": ""},
{"question": " The charging current drawn by the cable is", "option1": "Lags voltage by 90°", "option2": "Lead voltage by 90°", "option3": "Lead voltage by 45°", "option4": "None of the above", "answar": "2", "explain": "The charging current drawn by the cable is capacitive in nature, therefore, it leads the voltage by 90°. ", "category": "Transmission and Distribution", "": ""},

]
